{"issue":{"title":"[CF 1036] Shroud of Con - timer ","body":" <p>Sorry I didn't attach a string on the previous ticket. Below is the string for the icon which I am trying to track Shroud of Concealment and have it with a timer. Everything else I track with TMW, the timer works, but when I try and track Shroud of Concealment on myself (player), I am unable to get the timer working. ps - I am not the rogue, my 2's partner is the rogue so he pops it, and I go into it and the icon pops up, but no timer. Below is the string.</p><p>^1^T^SShowTimer^B ^SType^Sbuff ^SAlpha^N0.6 ^SName^SShroud~`of~`Concealment;~`Agile ^SEnabled^B ^t^N72101^S~`~| ^Sicon^^</p><p>What steps will reproduce the problem?<br>1. have a rogue friend (in a party with you) pop Shroud of Concealment<br>2. you stand in the range of the Shroud of Concealment<br>3.</p><p>What do you expect to happen? What happens instead?<br>I get the icon to appear which is what I want, but I can't get the timer sweep to work. But the icon then disappears correctly once the Shroud dissipates</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>Forgot to check - I'm at work atm, I can provide this later. Sorry.</p><p>Do you have an error log of what happened?<br>string included above.</p><p>Please provide any additional information below (including any export strings if applicable; see above.)<br>Included.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/icehawk15\">icehawk15</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1036\">#1036</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1036.html\">Raw</a>","closed":true,"closed_at":"2014-11-26T21:07:03Z","created_at":"2014-11-25T02:12:44Z","updated_at":"2014-11-26T21:07:03Z","labels":["defect","invalid"]},"comments":[{"body":" <p>There is no timer because the buff, when it is on you, has no timer. Only the rogue's buff has a timer.</p>\r\n<p>If you want to track it on anyone, track it on \"party1-4;raid1-40\", and set some unit conditions to restrict it to only rogues within 100 yards of you.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-11-26T21:06:56Z"}]}