{"issue":{"title":"[CF 1041] \"Force top-row runes to only match...\" is a global setting ","body":" <p>What steps will reproduce the problem?<br>1. Log in as a DK.<br>2. Import the icon below twice (the group and icon ids don't matter, this bug occurs on whichever two icons);<br>3. Open icon 1, switch to the Conditions tab;<br>4. Notice \"Force top-row runes to only match non-death runes.\" on condition 1 is unchecked;<br>5. Open icon 2, repeat step number 4;<br>6. Tick \"Force top-row runes to only match non-death runes.\" on condition 1, notice it is now checked;<br>7. Open icon 1 again and notice \"Force top-row runes to only match non-death runes.\" on condition 1 is checked.</p><p>What do you expect to happen? What happens instead?<br>I expect Conditions and their options to be icon-specific (except Group Conditions).<br>Instead, changing that particular option on condition X on whichever icon in whichever group will change that option for all other icons, as long as condition X for that icon is also a Resources-&gt;Runes condition.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>v7.2.1</p><p>Do you have an error log of what happened?<br>Does not produce an error.</p><p>Please provide any additional information below (including any export strings if applicable; see above.)<br>Bug occurs regardless of icon type.<br>Example icon:<br>^1^T^SType^Scooldown ^SName^SIcy~`Touch ^SConditions^T ^N1^T ^SRunes^T ^N5^B ^t^SType^SRUNES ^t^Sn^N1 ^t^SEnabled^B ^t^N72101^S~`~| ^Sicon^^</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/hugofpsilva\">hugofpsilva</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1041\">#1041</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1041.html\">Raw</a>","closed":true,"closed_at":"2014-12-02T17:18:37Z","created_at":"2014-12-02T17:15:39Z","updated_at":"2014-12-02T17:18:37Z","labels":["defect","duplicate"]},"comments":[]}