{"issue":{"title":"[CF 1043] = function on notifications event condition ","body":" <p>IMPORTANT: If your issue is only occurring with a specific icon, include an export string of the icon in this ticket. Similarly, if the issue involves an entire group or an entire profile, include the entire export string of the group or profile.</p><p>To get an export string, open the icon editor, and click button labeled \"Import/Export/Backup\". Select the \"To string\" option for the appropriate export type for your issue, and then press CTRL+C to copy it to your clipboard.</p><p>Hello TMW,<br>The issue I am running into is getting an event notification to play a sound at a \"=\" duration.</p><p>What steps will reproduce the problem?<br>1. Create a new TMW icon.<br>2. Buff/Debuff<br>3. Choose spell to check: Blood Plague<br>4. Units to watch: target<br>5. Unit Condition: check Debuff<br>6. Under the \"Notifications Ribbon choose sound notification<br>7. Choose Trigger: On Condition Set Passing<br>8. Sound to play: TMW - Pling 1<br>9. Add an event condition<br>10. Type: \"Debuff - Duration\"&nbsp; &nbsp; &nbsp; Unit: \"target\"&nbsp; &nbsp; Operator: \"==\"&nbsp; &nbsp; Value: \"7 sec\"&nbsp; &nbsp; Debuff to check: \"Blood Plague\"&nbsp; check the box that shows only cast by you</p><p>What do you expect to happen? What happens instead?<br>I expect to hear the TMW - Pling 1 when there is 7 seconds left on the debuff.&nbsp; Instead I hear nothing.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>V7.2.1</p><p>Do you have an error log of what happened?<br>No</p><p>Please provide any additional information below (including any export strings if applicable; see above.)<br>I can get it to work when I use the function \"&lt;=\" however changing the operator function to \"==\" produces nothing.&nbsp; I tried switching the debuff from blood plague to frost fever to see if maybe it was something with that particular debuff however no change.&nbsp; This very well could be a user error so if I am doing something incorrectly please feel free to disregard.</p><p>Thank you for your time<br>Cshafty</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/cshafty\">cshafty</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1043\">#1043</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1043.html\">Raw</a>","closed":true,"closed_at":"2014-12-07T19:34:57Z","created_at":"2014-12-05T15:51:21Z","updated_at":"2014-12-07T19:34:57Z","labels":["defect","invalid"]},"comments":[{"body":" <p>The chance that the duration will ever be exactly equal to 7 seconds is extremely slim. When TMW runs an update, it is more likely that it will be 7.00213 seconds, 6.982 seconds, etc., etc. </p>\r\n<p>Checking that it is less than or equal to 7 seconds is indeed what you want.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-12-07T19:34:43Z"}]}