{"issue":{"title":"[CF 1046] Icon sort broken ","body":" <p><strong>IMPORTANT: If your issue is only occurring with a specific icon, include an export string of the icon in this ticket. Similarly, if the issue involves an entire group or an entire profile, include the entire export string of the group or profile.</strong></p>\r\n<p>To get an export string, open the icon editor, and click button labeled \"Import/Export/Backup\". Select the \"To string\" option for the appropriate export type for your issue, and then press CTRL+C to copy it to your clipboard.**</p>\r\n<p>Just for the test.<br>\r\nDC priest self cooldown tracker with the sorting:</p>\r\n<p>^1^T^SStrata^SLOW ^SPoint^T ^Sy^F-4721044323443488 ^f-50^Sx ^F8932032366331635^f-45 ^t^SScale^F5402557757259775 ^f-52^SRows ^N5^SColumns ^N1^SGUID ^STMW:group:1KY8J6nfXygC^SIcons ^T^N1^T ^SShowTimer^B ^SType^Sunitcooldown ^SName^S10060:`2:00;`8122:`45;`32375:`15;`47540:`9 ^SShowTimerText^B ^SEvents^T ^N1^T ^SType^SAnimations ^SDuration^N1 ^SAnimation^SACTVTNGLOW ^SEvent^SOnShow ^t^Sn^N1 ^t^SShowWhen^N1 ^SEnabled^B ^t^t^SSortPriorities^T ^N1^T ^SMethod^Sduration ^t^N2^T ^SMethod^Sid ^t^N3^T ^SMethod^Svisiblealpha ^t^N4^T ^SMethod^Sshown ^SOrder^N1 ^t^N7^T ^SMethod^Sstacks ^t^t^SLayoutDirection^N7 ^SName^Stest ^SControlled^B ^t^N72101^S`| ^Sgroup^N15 ^^</p>\r\n<p><strong>What steps will reproduce the problem?</strong><br>\r\n1. Set icon sorting priority by time (in any vertical group).<br>\r\n2. Perform any action to pop out (display) some icons in a group (3 or more)<br>\r\n3. Wait till icons start fading one by one</p>\r\n<p><strong>What do you expect to happen? What happens instead?</strong></p>\r\n<p>Expect - icon sorting by time, longest on the botom, shortest on the top. Group growing in the order specified by the settings (for example growing from the botom to the top)</p>\r\n<p>Happens - It either anchors on the top and grows botom with the shortest duration on the botom, or it anchors on the botom and grows top with the shortest duration on the top. The shortest duration is always in the direction of growth. Group grows without correct order. The top icon always stays on top, other icons can start growing bottom instead of the top. This leads to the gaps between icons etc.</p>\r\n<p>Also icon sorting by the \"shown\" condition not working at all.<br>\r\nAnd this option for my opinion is quite important in many situations.<br>\r\nFor example boss cooldown tracker when you need to see the last used spell on the top of the list no mater the duration and icon id.</p>\r\n<p>Screenshot of the gaps: <a href=\"http://i.imgur.com/LaaJbb9.png\" rel=\"nofollow\">http://i.imgur.com/LaaJbb9.png</a></p>\r\n<p>Example with the icons:</p>\r\n<p>1. When all icons displayed at the same time (all seems alright):</p>\r\n<p>[60 cd]<br>\r\n[30 cd]<br>\r\n[15 cd]<br>\r\n[5 cd ]</p>\r\n<p>2. Then icons start to fading (at 1st fading the 5 sec cd icon as example):</p>\r\n<p>[60 cd]<br>\r\nGAP<br>\r\n[30 cd]<br>\r\n[15 cd]</p>\r\n<p>3. Then 15 sec cd icon expires:</p>\r\n<p>[60 cd]<br>\r\nGAP<br>\r\nGAP<br>\r\n[30 cd]</p>\r\n<p>Somehow the first icon stays at the top and the others growing to the bottom (instead of growing to the top).</p>\r\n<p><strong>What version of TellMeWhen are you using? (\"The latest\" is not a version)</strong><br>\r\n7.2.1</p>\r\n<p><strong>Do you have an error log of what happened?</strong><br>\r\n-</p>\r\n<p><strong>Please provide any additional information below (including any export strings if applicable; see above.)</strong><br>\r\nThis problem is very old. I actually can remember when I faced the same bug at the star of pandaria. Since then it's not fixed.<br>\r\nBy now many people using TMW as primary addon (enemy cd tracking, diminishing tracking, cc tracking, buff - debuff display) the option of correct icon sorting is very important to us. <br></p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/jLight\">jLight</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1046\">#1046</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1046.html\">Raw</a>","closed":true,"closed_at":"2014-12-11T06:24:13Z","created_at":"2014-12-10T11:27:24Z","updated_at":"2014-12-11T06:24:13Z","labels":["defect","invalid"]},"comments":[{"body":" <p>The same problem explained here (2012 dated) - <a href=\"http://us.battle.net/wow/en/forum/topic/7004697382\" rel=\"nofollow\">http://us.battle.net/wow/en/forum/topic/7004697382</a></p>\r\n<p>\"I want my icons to be anchored on the right and grow left, with the lowest duration always at the right. No combination of Layout Order, Update Order, or Icon Sorting Low/High settings grants this result.\"</p>\r\n<p>\"I've tried changing update order from Ascending and Descending. I've even tried to make this work from either going left or right horizontally with no success.\"</p>\r\n<p>\"It either anchors on the right and grows left with the shortest duration on the left, or it anchors on the left and grows right with the shortest duration on the right. The shortest duration is always in the direction of growth, and the settings appear broken when it comes to achieving anything else.\"</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"12 10 2014 09:18:13 (CST) (UTC-6:00)\" data-epoch=\"1418224693\">Dec 10, 2014</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/jLight\">jLight</a>","created_at":"2014-12-10T15:13:35Z"},{"body":" <p>Not broken - you have it configured wrong. Icons that are hidden can still have a duration, so your first sort priority should be Shown (respect/ignore Always Hide doesn't matter in this case), not Duration. Your second priority should then be Duration, and your third Icon ID.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-12-11T03:54:44Z"},{"body":" <p><cite>@<a href=\"https://github.com/tmw-issue-import/TellMeWhen/issues?q=%5BCF%201046%5D+in%3Atitle\" rel=\"nofollow\">Cybeloras</a>: <a href=\"https://github.com/tmw-issue-import/TellMeWhen/issues?q=%5BCF%201046%5D+in%3Atitle\" rel=\"nofollow\">Go</a></cite>\r\nCybeloras thank you very much and sorry for my misunderstanding of the addon options.\r\nWith your help i figured it out. It's working now.</p>\r\n<p>Can I taking the opportunity and ask you one more question.\r\nIs there any option in the addon to sort the icons by the \"icon shown\" condition.\r\nI mean when the icon sorted no mater the duration and icon id but by the time it was shown.\r\nThe \"fresh triggered\" icons that shown earlier will always stay on the top of the bar and the icons shown later on the bottom.</p>\r\n<p>At first I thought that \"Shown (respect/ignore)\" option will do that.\r\nThank you in forward!</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/jLight\">jLight</a>","created_at":"2014-12-11T05:53:59Z"},{"body":" <p>Because of the way the data is recorded and then harvested by icons, that can't be done without massive changes. Sorry. </p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-12-11T06:23:48Z"}]}