{"issue":{"title":"[CF 1053] Conditions - Spell cooldown comparison with energy ","body":" <p>Hi,</p><p>I'm looking for a way to compare the remaining cooldown of an ability with the energy i'm going to regain during it's remaining cooldown.</p><p>E.g.:</p><p>As a Brewmaster Monk you have 2 abilities with energy as a resource. Keg Smash and Jab (both 40 energy ). Keg Smash has a 8 sec cooldown but gives twice as many Chi and does significant more damage. So you want to press Keg Smash on cooldown, to do that the condition for Jab would include something like:</p><p>[current energy] + ([energy.regen pro sec] * [remaining cooldown of Kegsmash]) &gt;= [80]</p><p>TMW could give the user a comparison mode were energy and energy.regen/s are fix and the user has to add the ability and the energy he wants to have when the ability comes off cooldown.<br>I know it's a very specific problem but it would be nice if you could consider implementing it.</p><p>Another feature from my wishlist is a way to compare a spell cooldown with a Boss mod timer the same way the condition \"Spell cooldown - Comparison\" works.</p><p>Greetings and thanks for this awesome addon.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Skudnfroodie\">Skudnfroodie</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1053\">#1053</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1053.html\">Raw</a>","closed":true,"closed_at":"2015-01-05T06:42:25Z","created_at":"2014-12-27T22:25:08Z","updated_at":"2015-01-05T06:42:25Z","labels":["enhancement","resolved"]},"comments":[{"body":" <p>Use this as a Lua condition:</p>\r\n<div><div><div>\n\n```\n(UnitPower(\"player\") + (GetPowerRegen() * CooldownDuration(\"Keg Smash\"))) &gt;= 80\r\n\n```\n</div></div>\r\n</div><p>The boss mod comparison with a cooldown can't be done easily in a Lua condition because of the way that these conditions are initialized when they are first used.</p>\r\n<p>I probably won't implement either of these as standalone conditions unless there is more demand. I would love to overhaul conditions and allow for more interesting things like this without knowledge of Lua, but it is unlikely that this will happen - I just don't have the time anymore.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-12-28T21:20:46Z"},{"body":" <p>Thanks, for the Lua condition. (I should definitely familiarize myself with the wow api).</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Skudnfroodie\">Skudnfroodie</a>","created_at":"2014-12-29T14:54:23Z"}]}