{"issue":{"title":"[CF 1065] but hide when and duplicate condition ","body":" <p>just some suggestions:)</p><p>First off conditions.</p><p>1. I really wish there was a \"But hide when\" option here. Some icons i want to have visible most of the time but only hide under certain conditions. This would also make it far easier dealing with than compensating with more difficult meta strains.</p><p>A \"hide when\" would allow to room for lower priority icons to appear even tho the higher ones are met. alternatively a change priority on meta icons when certain conditions are met. I cant figure this out if its possible to downprioritize atm. if it is its not really that intuitive.</p><p>2. When making intricate or long condition lists i really miss a button to duplicate a condition to move around on other sides of logicals and brackets and such. A simple button would really improve usability. Might be a small thing but its abit fustrating making the same ones over and over.</p><p>Also something that i miss is popup background panels, resizable and with opacity and such.</p><p>Lastly i wish there was a visual clicking if icons could somehow communicate with an actionbar or keybindings that this certain key is being clicked.<br>These would add to making TMW a great customizable and visual \"actionbar\" hovering a hidden one.</p><p>also just an off topic question since i dont know much about programming, but does having a large chain of meta icons or many conditions in anyway lower reliability or cause delay in the final icon?</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/shisagi\">shisagi</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1065\">#1065</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1065.html\">Raw</a>","closed":true,"closed_at":"2015-01-12T04:25:56Z","created_at":"2015-01-09T07:14:39Z","updated_at":"2015-01-12T04:25:56Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>You can simplify your conditions by using Icon Shown conditions that point to other icons that have part of your conditions. This is especially useful if you find yourself duplicating the same conditions over and over again.</p>\r\n<p>A duplicate condition button sounds like a good idea.</p>\r\n<p>Not sure what you mean about popup background panels.</p>\r\n<p>Clicking icons to do things will never happen because it can't happen.</p>\r\n<p>Having a large chain of meta icons or conditions won't delay anything by any number of cycles - when a meta icon checks an icon, it always tries to update that icon before it it checked to see if it is shown or not. The same goes for Icon Shown conditions - they always update the icon before checking if it is shown. </p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2015-01-09T18:41:50Z"},{"body":" <p>After playing around with it for a bit, I've decided that I won't add in a duplicate condition button. It just clutters up an already cluttered interface with something that will be seldom used.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2015-01-12T04:25:00Z"}]}