{"issue":{"title":"[CF 1071] Command Demon cooldown not being detected from spell ID ","body":" <p>IMPORTANT: If your issue is only occurring with a specific icon, include an export string of the icon in this ticket. Similarly, if the issue involves an entire group or an entire profile, include the entire export string of the group or profile.</p><p>To get an export string, open the icon editor, and click button labeled \"Import/Export/Backup\". Select the \"To string\" option for the appropriate export type for your issue, and then press CTRL+C to copy it to your clipboard.</p><p>What steps will reproduce the problem?<br>1. Have the included icon in a group.<br>2. Use Wrathstorm (untested with other Command Demon pet abilities).<br>3. The icon will not show anything, even though Wrathstorm is on cooldown.<br>4. Replace the spell ID with \"Command Demon\".<br>5. The icon will now properly show when Wrathstorm is on cooldown.</p><p>What do you expect to happen? What happens instead?</p><p>The icon does not seem to detect that Wrathstorm is on cooldown when Command Demon's spell ID is used, but *does* detect it when the string \"Command Demon\" is used.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)</p><p>7.2.2</p><p>Do you have an error log of what happened?</p><p>Nope.</p><p>Please provide any additional information below (including any export strings if applicable; see above.)</p><p>^1^T^SShowTimer^B ^Swasmscd^B ^SType^Scooldown ^SName^S119898 ^SShowTimerTextnoOCC^B ^SShowTimerText^B ^SUnAlpha^N0.5 ^SShowWhen^N1 ^SEnabled^B ^t^N72218^S~`~| ^Sicon^^</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Vvoon\">Vvoon</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1071\">#1071</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1071.html\">Raw</a>","closed":true,"closed_at":"2015-01-15T03:54:02Z","created_at":"2015-01-15T03:50:57Z","updated_at":"2015-01-20T04:56:37Z","labels":["defect","invalid"]},"comments":[{"body":" <p>Command Demon is an ability that gets replaced with an ability from whatever demon you have active. SpellIDs always refer to a very specific spell - this replacement action doesn't change what the spellID refers to. Spell names, on the other hand, can point to different spells based on the state of your character. One of the main reasons for this is that so macros that use Command Demon will still work when this spell changes, but any addons that check spell cooldowns will work the same way - checking by name will find the correct spell, but checking by ID will always point to the baseline Command Demon spell, which never actually has a cooldown.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2015-01-15T03:56:05Z"},{"body":" <p>Makes sense; thanks for the informative correction!</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Vvoon\">Vvoon</a>","created_at":"2015-01-20T04:56:37Z"}]}