{"issue":{"title":"[CF 1078] [Question] All-Unit Buff/Debuff w/o Target ","body":" <p>Hi,</p><p>i'm looking for a way to display all my dots on all units except for my current target. My target has a extra group and I would like to keep it that way.</p><p>Is this possible with conditions or something? Thanks.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Skudnfroodie\">Skudnfroodie</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1078\">#1078</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1078.html\">Raw</a>","closed":true,"closed_at":"2015-01-21T19:01:02Z","created_at":"2015-01-19T23:39:24Z","updated_at":"2015-09-28T16:54:36Z","labels":["invalid"]},"comments":[{"body":" <p>Could you show me a screenshot of your specific usage case? I'm not sure if I would want to add in something that would cause icons to jump about as you switch targets without knowing that there are use cases that can make use of such a feature without it feeling clunky.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2015-01-20T05:14:58Z"},{"body":" <p>yeah, I didn't thought that through...</p>\r\n<p>thanks</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Skudnfroodie\">Skudnfroodie</a>","created_at":"2015-01-21T19:00:47Z"},{"body":" <p>Actually, this is exactly what the addon Raven does if set up Debuff Tracker and exclude display of debuffs on Target.</p>\r\n<p>I'm not sure Cybeloras will notice a comment to this old bug that's been already marked as Invalid. But I would be also very interested if this functionality was added to TMW. Namely, buff/debuff tracking on multiple targets, grouped up by units, with the option to exclude current target. So far the best addon that I found that does that is Raven. If this comment goes unnoticed, I'll probably submit a separate ticket after a while.</p>\r\n<p>Couple of images (rather, it's two versions of the same one, Raven display section is highlighted on the second one for better visibility):</p>\r\n<p><a href=\"http://imgur.com/h7qstGL\" rel=\"nofollow\">http://imgur.com/h7qstGL</a></p>\r\n<p><a href=\"http://imgur.com/6xfWysa\" rel=\"nofollow\">http://imgur.com/6xfWysa</a> (Raven section and unit sub-sections emphasized)</p>\r\n<p>Here, I'm standing next to 4 training dummies and have one of them targeted. Raven is set up to display debuffs as bars, grow direction (by units) is upward, on all units but current target. You can see that it shows two different debuffs (red and green) on two units and the third (topmost) unit has only one debuff (green). Current target is excluded from that Raven display.</p>\r\n<p>You could say that Raven bars do, in fact, jump around. Namely, if you change your current target, a unit in Raven display that is now you current target may be replaced with your previous target. I don't find it problematic so far, as long as the unit label next to those debuffs changes correspondingly.</p>\r\n<p>I just set up Raven a few days ago and am not sure how to best describe what it does and what other screenshots to provide, but I'd be happy to run any additional tests and make more screenshots upon request.</p>\r\n<p>Raven's debuffs display can also be set up as icons, but it has a serious limitation, namely, icons can only be displayed horizontally or vertically, and that means ALL icons, for all debuffs and on all targets. So, it'd either be a long row, or a long column. There's no way to set Raven up to group icons by different units vertically, with icons belonging to the same unit being grouped up horizontally. Which is something I would imagine TMW would be able to do if this functionality was created.</p>\r\n<p>Another useful example that Raven cannot do would be, to only show debuffs if a certain debuff is present on that unit. For example, don't show any debuffs on off-targets, unless those off-targets have Rupture on them. Raven has Conditions functionality, but it's not possible to set up a condition like that without specifying UnitID for the unit who has the debuff in question (Player, Pet, Target, Focus). I'm not sure if this is a Raven-specific limitation or it's not possible to create a check like that for units that don't have specific UnitID.</p>\r\n<p>In conclusion, I believe this functionality would be very helpful to have in TMW. When searching for solutions, I found multiple requests for something like that in various threads (not to mention my friends in game also wanting something like this). It was surprising to learn that the closest approximation to what myself and others had in mind could only be provided by one addon (Raven) that is no longer being supported. Weak Auras has Multi-Target display option (set Unit=\"Multi-target\" under Trigger), but it doesn't group up buffs by targets (it can only display target names on bars).</p>\r\n<p>Thanks for reading (possibly), and once again, I'd be happy to help with example use cases if needed.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"09 28 2015 11:54:36 (CST) (UTC-5:00)\" data-epoch=\"1443459276\">Sep 28, 2015</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/nordveien\">nordveien</a>","created_at":"2015-09-28T16:42:58Z"}]}