{"issue":{"title":"[CF 108]  Rune Support ","body":" <p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>3.0.3</p><p>Do you have an error log of what happened?</p><p>Please provide any additional information below.<br>First I would like to thank you for this addon.&nbsp; I have utilized it on every class I have played and it has allowed me to close in on theoretical max dps on all but one, the Death Knight.&nbsp; While I can setup abilities based on the rune system as reactive and allow me to know when they are available, this does not allow me to monitor the best time to utilize them based on rune availability.&nbsp; You have updated the mod to now allow the tracking of combo points, runic power etc through conditions.&nbsp; There is only one thing missing now: the tracking of runes.&nbsp; While there are mods to allow for the tracking of combo points, yours was a much better solution as it had less heads down time - the icon just popped up when it was time to use it.&nbsp; I didn't have to keep an eye on a combo pts monitoring addon.&nbsp; The same is true for the runes, your addon could do it so much better.</p><p>Here is an example using the priority list of an unholy DK<br>Diseases &gt; Dark Transformation &gt; DnD*/SS if both Unholy and/or all Death runes are up &gt; FeS if both pairs of Blood and Frost runes are up &gt;<br>DC if SD, 100 RP, will overcap RP with anything else or if RC isn’t up &gt; DnD*/SS &gt; FeS &gt; DC &gt; HoW.</p><p>I setup TellMeWhen left to right by priority, so the first two icons on the left are easy, I just look for the existance of the relative debuff on the mob and display the icon if it isn't present.&nbsp; Dark Transformation is just reactive - easy.&nbsp; Next is where I run into issues.&nbsp; It requires the condition of (both unholy and/or all Death runes available).&nbsp; DnD and SS require only one unholy rune and thus if setup as reactive will show much earlier than the required condition asking for 2unholy or 2death runes available.</p><p>This addon has gradually evolved into a near perfect, can do all addon.&nbsp; From a dps perspective, this appears to be the last thing missing.&nbsp; You continue to work to perfect it, so I thought I would mention the tracking of runes.</p><p>Thanks again for your work on this wonderfull addon.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/leissh\">leissh</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/108\">#108</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/108.html\">Raw</a>","closed":true,"closed_at":"2011-02-01T02:57:36Z","created_at":"2011-01-30T15:35:12Z","updated_at":"2011-02-01T02:57:36Z","labels":["enhancement","resolved"]},"comments":[]}