{"issue":{"title":"[CF 1088] Could TMW be causing massive lag on Kromog encounter? ","body":" <p>Hi, I'm sorry I don't quite know how to formulate my question better or provide a specific string, but is it at all possible that TMW could be contributing to lag issues on Kromog? In my raid, most of the people don't use TMW and those who do were all lagging (even without Bloodlust), some more, some less. Other people didn't seem to have such big lag as we did, so I'm trying to look at things that those who lagged have in common. Our hardware is pretty recent and should support 30 man raiding no problem (one person only lagged on Kromog and he never lags). I tried googling and found a video that complains about lag on that fight, it looks like they were also using TMW (<a href=\"https://www.youtube.com/watch?v=Pgimr7bFSw4\" rel=\"nofollow\">https://www.youtube.com/watch?v=Pgimr7bFSw4</a>); though I personally didn't notice much lag in this video.</p><p>In case it helps, my screen was freezing at the very start (he casts Stone Breath soon after engaging, then Slam a few seconds after, both do raid-wide AoE). Second time my screen froze when he started doing Thundering Blows, that's also a raid-wide AoE. I have a lot of TMW icons, including Buff/Debuff, Condition, Meta, so if you could point me in a direction what kind of icon or conditions could be the most problematic, I would try to test it shortly.</p><p>I apologize in advance if TMW doesn't have anything to do with our lag. It's just I thought I'd ask if it's a possibility before pugging that fight without TMW, as it would require a lot of preparations on my part (TMW is pretty essential for my rotation currently). Thanks!</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/nordveien\">nordveien</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1088\">#1088</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1088.html\">Raw</a>","closed":true,"closed_at":"2015-02-17T02:06:42Z","created_at":"2015-02-12T07:12:46Z","updated_at":"2015-02-17T02:06:42Z","labels":["declined"]},"comments":[{"body":" <p>Its extremely unlikely that TMW is the cause of this.</p>\r\n<p>Enable Lua errors (Game Menu &gt; Interface &gt; Help &gt; Display Lua Errors) and post any errors that you get that relate to TMW to a new ticket here. Aside from that, I have no idea what might be causing the issue. TMW has numerous protections in place to prevent it from running for too long at any given moment, and Blizzard placed restrictions back in cataclysm that prevent any addon from running for more than 200ms in a single script while in combat.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2015-02-14T01:45:28Z"},{"body":" <p>Thank you for the response.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/nordveien\">nordveien</a>","created_at":"2015-02-14T09:56:28Z"}]}