{"issue":{"title":"[CF 1094] proc/buff used up, timer keeps running ","body":" <p>I've noticed a bug with a buff icon on my Retribution Paladin which I've not noticed on any other buff or on any other toon - either the problem is limited to this buff (or a few number of buffs), or I just did not notice it anywhere else so far, as there was an update to TMW just yesterday, so the bug might have been introduced in that version (7.2.4-6-gd918c1e). Therefor I will describe the bug for this specific situation.</p><p>The problem affects the buff you get from the \"Empowered Divine Storm\" passive: each time you use your holy power, you have a chance to be able to use your next Divine Storm for free. When this ability procs, you get a buff called \"Divine Crusader\" which lasts 12 seconds and is consumed the next time you use an ability that costs holy power.</p><p>I am tracking this buff through an icon which is always shown and uses the timer animation to display the remaning time (export string below). In the past, when I used up the buff, the timer on that icon would just disappear, as expected. Now, whenever I gain the buff, the timer starts running and the icon displays a small number \"1\" in the lower right corner, which I think is new (seems to be the buff's stacks, although this buff can never have more than one stack, so this info is not needed at all). When I use up the buff, the small number \"1\" disappears, but the timer just keeps running, which is very irritating, as the buff is actually gone, as my buff bar confirmed.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>7.2.4-6-gd918c1e<br>I'm not sure if this is the version the issue showed up for the first time, as I have not played my ret paladin for a week or two. I've never had this problem before, though, so it must have been introduced pretty recently.</p><p>Do you have an error log of what happened?<br>no</p><p>Please provide any additional information below (including any export strings if applicable; see above.)<br>^1^T^SShowTimer^B ^SType^Sbuff ^SName^S144595 ^SShowTimerText^B ^SSettingsPerView^T ^Sicon^T ^STextLayout^Sicon1 ^STexts^T ^N1^SQ ^t^t^t^SShowWhen^N3 ^SEnabled^B ^t^N72504^S~`~| ^Sicon^^</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Kezo\">Kezo</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1094\">#1094</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1094.html\">Raw</a>","closed":true,"closed_at":"2015-03-03T18:04:23Z","created_at":"2015-03-03T09:58:52Z","updated_at":"2015-03-03T18:04:23Z","labels":["defect","resolved"]},"comments":[{"body":" <p>Thanks for the report. Should be fixed in g995c6cf.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2015-03-03T18:02:48Z"}]}