{"issue":{"title":"[CF 1118] Spell with Charge ","body":" <p>With more and more spell using the charge system would it be possible have on the main page area an option field like stack and duration to show the icon if you have atleast 1 charge active or more.</p><p>I am using TellMeWhen for alot of my rotation and when I come with a spell like on my Elemental Shaman Lava Burst which has 2 Charge with Echo of the Element. I have to be able to make it appear when I have a charge and disappear when I have none and only show when my charge is below 3 sec. I have to produce with a condition that say if I have more than 1 Charge to show the icon or if I have 0 charge but the cooldown is less than 3 sec then show. The issue is that it's really cubbersome and more abilities actually use this system for many class.</p><p>The idea would be to get on the main option page an option where you could check the min number of Charge to show the spell being 1 and the max of time to show it being 3.</p><p>Example of the Icon I am using :</p><p>^1^T^SShowTimer^B ^SType^Scooldown ^SName^SLava~`Burst ^SShowTimerText^B ^SConditions^T ^N1^T ^SType^SSPELLCHARGES ^SOperator^S&gt;= ^SLevel^N1 ^SName^SLava~`Burst ^t^N2^T ^SType^SSPELLCD ^SOperator^S&lt;= ^SLevel^N3 ^SName^SLava~`Burst ^SPrtsBefore^N1 ^SAndOr^SOR ^t^N3^T ^SType^SSPELLCHARGES ^SPrtsAfter^N1 ^SName^SLava~`Burst ^t^Sn^N3 ^t^SShowWhen^N3 ^SEnabled^B ^SDurationMax^N3 ^t^N72603^S~`~| ^Sicon^^</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/InfernalAura\">InfernalAura</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1118\">#1118</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1118.html\">Raw</a>","closed":true,"closed_at":"2015-05-10T23:39:19Z","created_at":"2015-05-10T19:26:20Z","updated_at":"2015-05-11T04:31:39Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>No, sorry. I already wish that the stack and duration requirements on the main tab of the IE weren't there, but removing features isn't fun to do for me or for people who use them, so alas, they're still there. The reason for this is that their implementation is very ugly in the code, and they date back to a time when TMW was 80% spaghetti code. The v6.0.0 rewrite required the creation of an entire subsystem just to handle these 2 settings that I really would have liked to not included.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2015-05-10T23:39:09Z"},{"body":" <p>Yeah I understand but out of curiosity would it then be possible to implement a Spell Charge Icon Type to work around those Spell. I am wondering since even if I don't use the Timer property of the icon and just go with 0% opacity while on cooldown and 100% opacity while not on cooldown it create the little annoying side effect that the icon will not show while there's a charge on cooldown which kinda render the whole Spell Cooldown Icon kinda useless unless you play with condition.</p>\r\n<p>Hehe I also get what you say that you don't like removing feature I know I would kinda be bummed if these 2 property would go away since they are part of about 99% of all the icon I am creating through TMW Lolll</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"05 10 2015 18:51:48 (CST) (UTC-5:00)\" data-epoch=\"1431301908\">May 10, 2015</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/InfernalAura\">InfernalAura</a>","created_at":"2015-05-10T23:48:51Z"},{"body":" <p>Well, anything's possible, but its not something that I would be willing to do. You'll have to stick to using conditions for this.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2015-05-11T04:31:39Z"}]}