{"issue":{"title":"[CF 1162] properly tracking pvp trinkets ","body":" <p>^1^T^SShowTimer^B ^SType^Sunitcooldown ^SName^SPvP~`Trinket:~`2:00;~`Every~`Man~`for~`Himself:~`2:00 ^SGUID^STMW:icon:1L_Pdhhl3_kc ^SShowWhen^N3 ^SUnit^Starget ^SEnabled^B ^t^N73501^S~`~| ^Sicon^^</p><p>What steps will reproduce the problem?<br>1.<br>2.<br>3.</p><p>What do you expect to happen? What happens instead?<br>Trying to have the icon track both a pvp trinket/the human racial, but it only puts whatever cooldown was entered first into the box and won't track the other.&nbsp; If I have it so it has 2 columns instead of one then it works fine, but it defeats the purpose because then one icon is isn't going to be active unless a human equips a pvp trinket and uses it. Or If I'm tracking a non-human target, I'd have the human racial sitting there which wouldn't be triggered ever as they're not human.</p><p>...They both work, I just can't track both of them with only one icon, as they overlap each other and won't change the icon based on what was used. Having it as a group controller doesn't help.</p><p>I realize that having usable unchecked remedies the situation, but I want the icon to always show whether or not it is on a cooldown.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)</p><p>v7.3.5<br>Do you have an error log of what happened?<br>No.</p><p>Please provide any additional information below (including any export strings if applicable; see above.)</p><p>Also... I was wondering if it was possible to have some sort of lua that would ignore player as a target for tracking said cd, because if I use @party1 it just takes whoever is in the first slot, but I want the icon to ignore showing it if it's for @player.</p><p>... or simply just a way to make it so that my raid frame doesn't show while having raid frames up would work, but that's not really tellmewhen orientated.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Ayiu\">Ayiu</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1162\">#1162</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1162.html\">Raw</a>","closed":true,"closed_at":"2016-06-26T02:39:46Z","created_at":"2015-09-19T18:42:58Z","updated_at":"2016-06-26T02:39:46Z","labels":["resolved"]},"comments":[{"body":" <p>I want an icon to always be there whether or not the CD is up, I realize that remedies the situation if I don't have usable checked.</p>\r\n<ul><li>I realize that having usable unchecked remedies the situation, but I want the icon to always show. </li></ul> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"09 19 2015 13:45:33 (CST) (UTC-5:00)\" data-epoch=\"1442688333\">Sep 19, 2015</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Ayiu\">Ayiu</a>","created_at":"2015-09-19T18:44:55Z"},{"body":" <p>You can roughly simulate this by using the \"Only observed spells\" filter, but I'll add a Unit Race condition to make this even easier.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2016-04-02T19:02:28Z"}]}