{"issue":{"title":"[CF 1163] SpellCache + AuraCache arrays occupy a HUGE space ","body":" <p>TMW version used: v7.4.0</p><p>i was looking into optimizing my alts' login/logout times... and i stumbled on this...</p><p>why are the arrays \"SpellCache\" and \"AuraCache\" stored up in SavedVariables?</p><p>they use up a HUGE chunk of variable storage space, both in memory and on disk... is it really needed for them to be dumped into the global<br> SavedVariables\\TellMeWhen_Options.lua&nbsp; storage EVERY time an alt logs out and then read back when another alt logs back in?</p><p>Can these two arrays be moved to a static .lua file definition and not be dumped to disk and read back at each alt's login/logout?</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Adrian_G2\">Adrian_G2</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1163\">#1163</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1163.html\">Raw</a>","closed":true,"closed_at":"2015-09-21T21:55:15Z","created_at":"2015-09-21T16:59:41Z","updated_at":"2015-09-21T21:55:15Z","labels":["enhancement","invalid"]},"comments":[{"body":" <p>No. There would have to be a separate one for every locale, and it would have to be manually regenerated every single WoW patch. AuraCache is generated completely dynamically as you play. SpellCache is generated from static data, but it is an intensive process that would take longer than loading/saving it to disk does.</p>\r\n<p>Disable the config in combat setting if you don't want _Options loading every time you log in.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"09 21 2015 13:03:50 (CDT) (UTC-5:00)\" data-epoch=\"1442858630\">Sep 21, 2015</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2015-09-21T18:02:50Z"},{"body":" <p>would it be possible then to somehow group SpellCache by zone or current patch+previous patch, or some other way, so that only a subset of the spells is actually cached and the rest is loaded from the static list on an as-needed basis?</p>\r\n<p>i see a lot of spells there that are specific to very-rarely-visited areas of the game... and because of those my SpellCache array is 70k+ lines of the form<br>\r\n[spellid] = \"spell name string\"</p>\r\n<p>AuraCache is much smaller, a bit under 9k items and without text strings attached, a lot thinner and much more well-behaved than the SpellCache elephant.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Adrian_G2\">Adrian_G2</a>","created_at":"2015-09-21T18:29:56Z"},{"body":" <p>Location has nothing to do with it, and furthermore, spells don't have a location - they just exist, independent of what they are used by, or where those things are.</p>\r\n<div><p> or current patch+previous patch</p>\r\n</div>\r\n<p>Again, this would require the list to be generated manually with each new TMW version, which would require me to log in once for each locale that WoW offers, log out, copy that list from saved variables, and paste it into some file that would be distributed to every single TMW user, regardless of whether or not they play under that locale. That's around 10 MB of extra data for every single user.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2015-09-21T21:55:08Z"}]}