{"issue":{"title":"[CF 1173] More settings for custom textures ","body":" <p>When trying to setup TMW icons for the T18 Frost Mage 4pc bonus (4 stacks of fingers of frost), I ran in to some problems.</p><p>I am trying to recreate the look from popular WeakAuras, where you get a smaller version of the proc graphics in complement to your two ones to display the extra two charges of fingers of frost.</p><p>I use the texture at: Textures\\SpellActivationOverlays\\Frozen_Fingers</p><p>However, I have not found any way to mirror the texture, so that it looks ok on the right hand too. In WA there is a mirror-option so you can mirror your texture. This would be interesting both for the icon itself when you use custom textures, and on the image overlay in notifications.</p><p>Also, there is no way to actually set the size of the image. It is always a square. I see that you can load it as an Image Overlay as a notification and set the size of the image there, but I have not gotten that to work. When i go to Image Overlay, and enter the same path to the texture, nothing shows.</p><p>Thankful for any input you guys might have.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/hiar_nl\">hiar_nl</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1173\">#1173</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1173.html\">Raw</a>","closed":true,"closed_at":"2016-07-17T04:08:24Z","created_at":"2015-11-02T07:00:06Z","updated_at":"2016-07-17T04:08:24Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>TMW isn't meant to be a one-for-one replacement for WA. TMW's primary function is to display icons. It isn't out of the question that I could add a new display method that would support things like this, but it isn't high on the list because I'd rather spend what time I can devote to the project on making it better at the things that it already does rather than making it good at things that other addons do.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2016-07-17T03:31:23Z"}]}