{"issue":{"title":"[CF 1183] Dynamic multi-target group for buffs/debuffs ","body":" <p>Hi, I'd like to resurrect a feature request posted in an old ticket, <a href=\"https://github.com/tmw-issue-import/TellMeWhen/issues?q=%5BCF%201078%5D+in%3Atitle\" rel=\"nofollow\">http://wow.curseforge.com/addons/tellmewhen/tickets/1078-question-all-unit-buff-debuff-w-o-target/</a></p><p>I'm not sure if any other classes but rogues could currently benefit from the kind of advanced conditioning that I'm going to talk about below. And who knows if even rogues will still need it in Legion. So I completely understand if the \"useful output/effort\" ratio of this request would be too low to warrant its implementation. Still, I'd like to at least type it out what my friends and I had in mind for this feature :)</p><p>================================================<br>Currently, there's Raven addon that allows you to track buffs/debuffs on multiple targets, but it lacks configurability. WA also allows it through \"Multi-target\" unit, but it looks even worse than Raven and also lacks useful options.</p><p>So, for general behavior of such group, for how would icons/bar behave on the screen, you could take a look at how it's done in Raven. I can provide screenshots with more specific cases if needed.</p><p>Example screenshot: <a href=\"http://imgur.com/6xfWysa\" rel=\"nofollow\">http://imgur.com/6xfWysa</a> (Raven section and target sub-sections highlighted).<br>Here I track two debuffs on 3 Training Dummies that are not my current target. You can set up the group to grow dynamically upward or downward, left or right. Also it could display as bars or icons. All buffs/debuffs are being grouped by target (unit).</p><p>Whenever I switch targets, I think it tries to keep the unit positioning more or less the same, meaning if there were dots ticking on units A, B and C, and I switch targets from A to B, it replaces B with A in the display and keeps C where it was. If dots drop from one of the targets and there's nothing to show for that unit anymore, it disappears from the display and all units that were showing \"after\" that unit in the sense that they were further from the anchor get bumped down one position.</p><p>If tracking on current target is enabled, when I tested it with 3 targets total it worked like this. First of all, it adds the header \"Target\" somewhere next to the unit that you have currently targeted (the exact position of that header is configurable). While dots are ticking on all targets, it would keep the positions of all three target groups when switching between targets and simply move the \"Target\" header from one to the other.</p><p>All in all, it doesn't feel like bars or icons are \"jumping around\" and serves the purpose pretty well.</p><p>================================================<br>Here are some cases of interest that can't be configured in Raven or WA (at least without having to custom code):</p><p>1. Allow to set up spacing between groups of debuffs (when grouped by target). Basically, I'd like to make the separation between different targets more prominent in the display shown on the picture. Raven doesn't allow that.</p><p>2. Allow grouping of icons in the following manner, for example: icons grow direction for the same target is horizontal (left or right), group grow direction when new targets are added is vertical (up or down).</p><p>3. Only show a debuff on a target if another debuff is present on that target. For example, only show Deadly Poison debuff if Rupture is present on the same target. Furthermore, should be also be able to show Debuff A only if either Debuff B, or Debuff C are present on the same target. Existing TMW conditions functionality would be perfect for that.</p><p>4. Be able to change color for Debuff A if Debuff B is present (or not present) on that target.</p><p>5. Show Debuff A; if Debuff B is also present on that target, then instead of simple timer for Debuff A show \"min(timer A, timer B)\" colored by the debuff's custom color. So, if debuff B runs out earlier than Debuff A, then show Debuff A icon/bar with Debuff B timer, timer text colored with specific \"Debuff B\" color.</p><p>6. Maybe also an option to add a target's health bar to the display? Like on this picture I stole from another discussion thread, only nothing would be clickable of course: <a href=\"http://i.imgur.com/orKCBV4.jpg\" rel=\"nofollow\">http://i.imgur.com/orKCBV4.jpg</a></p><p>================================================</p><p>Thank you for taking time to read this, and I'd be happy to try helping with testing if ever needed.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/nordveien\">nordveien</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1183\">#1183</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1183.html\">Raw</a>","closed":true,"closed_at":"2016-11-26T22:56:22Z","created_at":"2015-12-01T09:16:21Z","updated_at":"2016-11-26T22:56:22Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>While I do like many of these ideas, the time that I have available to work on TMW is very fleeting. My <a href=\"https://github.com/ascott18/TellMeWhen/commits/newtabs\" rel=\"nofollow\">current project</a> hasn't been touched in 3 months - I had to drop it right in the middle when life showed up. I will probably find time/energy to finish it before Legion, but there probably won't be much else coming into TMW in that timeframe besides the completion of this project and the standard expansion updates that are expected.</p>\r\n<p>Here's a quick rundown of my thoughts:</p>\r\n<ol><li>This could probably be done. (No promises, though, and certainly no timeframe on it)\r\n</li><li>See #1\r\n</li><li>No, sorry. Conditions wouldn't work at all here - the reason that there are no unit conditions for all-unit buff/debuff icons is because this icon type doesn't check unitIDs to get its information (aside from occasional fleeting glimpses to try and keep things synchronized). Everything comes from the combat log, so the data only exists in a format that the icon type is aware of what to do with. Integrating with conditions would end up being clunky and inconsistent.\r\n</li><li>For similar reasons as #3, this one is difficult. Additionally, I can't see it getting much use.\r\n</li><li>Way too complicated. Sorry.\r\n</li><li>Not a good fit for TMW; feels clunky, and doesn't fit into the way that TMW is architected.</li></ol> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2015-12-02T05:51:23Z"},{"body":" <p>I see, I suspected that #3 and so on could be impossible because of the lack of proper UnitIDs.</p>\r\n<ol><li>#1 and #2 would be be nice GUI improvements over existing Raven displays, but overall don't seem that big of a deal. So I completely understand that this is a very low priority improvement and maybe it's for the best if it never gets implemented, your efforts would be better put elsewhere. I'd personally much rather have routine TMW updates for as long as you could possibly maintain it <span>:)</span>\r\n</li></ol>\r\n<p>At least after your explanation it's clear that more advanced configuration than Raven currently allows is not possible. So if people are looking for something like this, they could probably find this ticket by googling, like I have the older one, and just use Raven or WA. </p>\r\n<p>Thanks again for taking time to review this!</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/nordveien\">nordveien</a>","created_at":"2015-12-02T10:07:35Z"}]}