{"issue":{"title":"[CF 1222] Textual readout when making conditions ","body":" <p>A textual readout for what the conditions that are currently set up require for the icon to trigger.</p><p><a href=\"http://i.imgur.com/e3lUmbi.jpg\" rel=\"nofollow\">http://i.imgur.com/e3lUmbi.jpg</a></p><p>For example, this one might be something like</p><p>A is equipped OR B is equipped OR C is equipped OR D is equipped.</p><p>For icons that require more intensive conditions, a visual text description of what they equate to is really helpful to quickly eyeball a conflicting condition or other mistake.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Jalopyy\">Jalopyy</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1222\">#1222</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1222.html\">Raw</a>","closed":true,"closed_at":"2016-09-18T22:24:31Z","created_at":"2016-06-28T04:37:55Z","updated_at":"2016-09-18T22:24:31Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>I've thought about this before. It would be cool, but ultimately it would be a localization nightmare. That, and it would just take quite a long time to do - there are a LOT of conditions. I suppose this is already done in a limited form now with the dropdown conditions (like unit class, spec, etc), but doing this for everything would take quite a lot more work, and I don't have a whole lot of time on my hands for things like this.</p>\r\n<p>I can barely bring myself to spend my time on the weekends or when I get home from work to update the buff/debuff equivs for Legion. I've gotten Stunned and Slowed done, and those both took about an hour and a half each of scraping through spells, hopping around on characters and watching the combat log to determine what the correct spellID for the debuff is for each and every one of them - its the spellID of the spell in your spellbook only maybe 50% of the time.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2016-07-07T15:45:59Z"}]}