{"issue":{"title":"[CF 1250] DRData out of sync ","body":" <p>Hi,</p><p>I maintain an addon called AdiButtonAuras and a user posted an issue today - <a href=\"https://github.com/AdiAddons/AdiButtonAuras/issues/213\" rel=\"nofollow\">https://github.com/AdiAddons/AdiButtonAuras/issues/213</a><br>We tracked it down to the version of DRData you are using. It appears to contain old data.</p><p>The problem boils down to both of us using different versions of DRData and yours having a higher minor than ours. I moved away from the wowace version of DRData since the project is not listed anymore. However it appears that the git repo is still around and you push to it, so now our histories diverge.</p><p>The version I maintain could be found under <a href=\"https://github.com/AdiAddons/DRData-1.0\" rel=\"nofollow\">https://github.com/AdiAddons/DRData-1.0</a> It has been just partially updated for legion but the old spell ids are definitely removed.</p><p>I do plan to drop DRData support in the mid-term since it does not detect silences and knockbacks and it is possible for me to provide the spells for the other categories through LibPlayerSpells (I still have to evaluate this though, so not set in stone).</p><p>So, the question is how should we solve this? If you would merge my changes I could switch back to the wowace repo. Or you could pull from <a href=\"https://github.com/AdiAddons/DRData-1.0.git\" rel=\"nofollow\">https://github.com/AdiAddons/DRData-1.0.git</a> if you wish. Just tell me what you prefer.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/rainrider\">rainrider</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1250\">#1250</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1250.html\">Raw</a>","closed":true,"closed_at":"2016-07-26T23:02:19Z","created_at":"2016-07-25T22:26:40Z","updated_at":"2016-07-26T23:02:19Z","labels":["defect","resolved"]},"comments":[{"body":" <p>If you're going to fork off of the main version, you need to rename the major version of your fork. TellMeWhen is far from the only addon that uses the official DRData - there at at least 7 others (7 here, including you: <a href=\"http://www.wowace.com/addons/drdata-1-0/reverse-relationships/\" rel=\"nofollow\">http://www.wowace.com/addons/drdata-1-0/reverse-relationships/</a>, and classic Gladius also uses it but isn't listed on that page).</p>\r\n<p>I'm confused when you say it isn't listed. It's right here, and I've updated it with what should be all the changes needed for Legion to the best of my ability: <a href=\"http://www.wowace.com/addons/drdata-1-0/files/\" rel=\"nofollow\">http://www.wowace.com/addons/drdata-1-0/files/</a></p>\r\n<p>If you're concerned about it being marked abandoned, why not have Adirelle, who is a listed author on it, go poke the project status? That will get it listed back up on Curse.com, if that's what you meant.</p>\r\n<p>Otherwise, you're welcome to keep using the official repo and contribute your changes there - it's open for commits from anyone. </p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2016-07-25T22:58:48Z"},{"body":" <p>Well, it says in a big red box that the project is abandoned. If you search for DRData on wowace or curse, it is not listed in the search results. The only way to know that it exists is to now the exact project link, which I happened not to know <span>:)</span> It is pointless discussing which one is official or not, I'd just want to find a solution.</p>\r\n<p>All the spell ids from the bug report I got are still in v2.8.6-54-g343ae86, which is the most current update and they are all not in the game anymore. The IDs are 1499, 60192 and 119403.</p>\r\n<p>Feel free to use the spell data from the AdiAddons fork, I don't care about credits. The spells for monk, hunter and demon hunter are verified in game. Since there is no official info on DR for Legion, I can't tell for sure that they are in the proper category, I relied on the tooltips.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/rainrider\">rainrider</a>","created_at":"2016-07-26T01:51:08Z"},{"body":" <p>I pushed the needed changes and switched back to the repo on wowace. This should fix the situation for the time being.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/rainrider\">rainrider</a>","created_at":"2016-07-26T21:52:08Z"},{"body":" <p>Awesome! Thank you!</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2016-07-26T23:02:11Z"}]}