{"issue":{"title":"[CF 1255] My other profiles are empty! Lost settings? ","body":" <p>What steps will reproduce the problem?<br>1.&nbsp; Go to the import button in configuration window to import / copy over a profile<br>2.&nbsp; Select \"Sadue - Alleria\"</p><p>What do you expect to happen? What happens instead?<br>My TMW icons should be populated with the icons from that profile. But it just imports and empty profile instead.<br>Gaeldra - Alleria, an older profile, is the only one that has a working profile to import, but I don't want that one.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>8.1.1-1-g5b2d596</p><p>Do you have an error log of what happened?<br>No error.</p><p>Please provide any additional information below (including any export strings if applicable; see above.)<br>I can see the profile exists within the Tellmewhen.lua saved variables, and there exists the settings there too. I just don't know why it won't import. If you can fix TMW to import correctly, or repair the broken TellMeWhen.lua savedvariables (or give directions on how to repair it), that'd be great.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Ssateneth\">Ssateneth</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1255\">#1255</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1255.html\">Raw</a>","closed":true,"closed_at":"2016-07-26T23:01:25Z","created_at":"2016-07-26T20:11:51Z","updated_at":"2016-07-26T23:01:25Z","labels":["defect","invalid"]},"comments":[{"body":"<strong>Attachment Added:</strong><a href=\"https://media.forgecdn.net/attachments/76/184/TellMeWhen.lua\" target=\"_blank\"> TellMeWhen.lua</a><br> <div class=\"attachment-desc\"> <h4 class=\"attachment-title\">TellMeWhen.lua</h4> <p>&lt;p&gt;My savedvariables file&lt;/p&gt;</p> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Ssateneth\">Ssateneth</a>","created_at":"2016-07-26T20:11:51Z"},{"body":" <p>There are no icons for that profile in your saved variables. Do you keep backups of your files? Perhaps an older version of your saved variables will have it. If not, perhaps its time to set up a backup plan. Gaeldra - Alleria and Gaeldra - Alleria 2 are your only two profiles that have anything in them.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2016-07-26T21:19:46Z"},{"body":" <p>I will also point out that the character Sadue is configured to use the profile \"Gaeldra - Alleria\". Perhaps you never configured anything for the profile \"Sadue - Alleria\"?</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2016-07-26T21:21:28Z"},{"body":" <p>Mm, you are telling me that Sadue literally pointed to Gaeldra, and Sadue didn't have anything in itself? Then looks like I'll be using the Gaeldra profile instead. Apologies for the inconvenience.</p>\r\n<p>It's an older warrior profile while I played Sadue later on, thought Gaeldra would've been so out of date that it'd need more work than it would be to write a new set of icons from scratch. But looking at it again, seems you're right. Some of the icons there are new-ish.</p>\r\n<p>Thank you for your time. You may close this ticket.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Ssateneth\">Ssateneth</a>","created_at":"2016-07-26T22:47:24Z"}]}