{"issue":{"title":"[CF 1258] Conditions &gt; Spell Cast &gt; Absent ","body":" <p>Works with blank group.</p><p>What steps will reproduce the problem?<br>1. Create a new group<br>2. Reload UI<br>3. Right click first icon<br>4. Go to conditions and pick Spells/Items &gt; Spell Cast<br>5. Tick Absent<br>6. Type New Moon into Spell to Match (i do not press the enter key afterwords)<br>7. Right click the second icon<br>8. Go to conditions and pick Misc &gt; Icon is Shown<br>9. Change Icon is Shown to Spells/Items &gt; Spell Cast<br>10. 50% of the time the \"Absent\" tick box will have vanished from either the first or second icon. 50% of the time nothing goes wrong.<br>11. Reload UI to solve the issue</p><p>What do you expect to happen? What happens instead?</p><p>The \"Absent\" tick box should not dissapere.<br>Although the \"Absent\" tick box dissapered, the text readout above the missing tick box still said \"Absent\"</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)</p><p>Using Legion Beta Client<br>v8.0.0 r109 (g45c797a)<br>Update: Tried in the following version and still bugged<br>v8.1.2 r5 (g696770f)</p><p>Do you have an error log of what happened?</p><p>No however once when I right clicked an icon that was not part of the bug process, I had an error and I could not see the conditions of my icons. After right clicking a few random icons my conditions re-appeared.</p><p>Please provide any additional information below (including any export strings if applicable; see above.)</p><p>I made sure to delete all the conditions I had for Spell Cast and reloaded my UI for good measure before attempting to re-produce the issue. The issue was successfully reproduced.</p><p>All other addons were disabled.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/LordEos\">LordEos</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1258\">#1258</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1258.html\">Raw</a>","closed":true,"closed_at":"2016-08-03T11:45:20Z","created_at":"2016-07-28T15:29:01Z","updated_at":"2016-08-03T11:45:20Z","labels":["defect"]},"comments":[{"body":" <p>Ah ha! Thank you so much for this. I saw this once and tried for way too long to try and reproduce it with no success.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2016-07-30T01:01:24Z"},{"body":" <p>No problem! And thanks for the quick fix!</p>\r\n<p>It was really starting to get irritating when I needed 9 icons in a row with that condition xD Working on a boomkin rotation helper that displays the next 2 spells to cast. I need to use that condition very often to pre-show icons with cooldowns before they move over to the main meta icon so that they don't instantly appear in the first slot rather than the second.</p>\r\n<p>Might be a good suggestion actually unless i'm missing the function. Say you are using 2 meta icons and you are expanding sub meta. It would be really handy to have an option that forced any new icon that appears to populate the second meta slot until the icon in the first slot becomes hidden. This would free up a heck of a lot of conditioning.</p>\r\n<p>Anyway! Thanks again!</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"08 3 2016 06:45:20 (CST) (UTC-5:00)\" data-epoch=\"1470224720\">Aug 3, 2016</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/LordEos\">LordEos</a>","created_at":"2016-08-03T10:30:07Z"}]}