{"issue":{"title":"[CF 126] I could not do without this addon ","body":" <p>Firstly thanks guys for all your hard work.<br>I am a Lock and have played since the start. I found TMW when it first started and can only say I could not play without it.<br>I love the the way your changing the interface adding more features making this more dynamic.</p><p>I'm also 55 years old and starting to loose the idea of the new features. I am sure I could get a vast amount more out of your addon but I now don't understand what everything does. This tends to make me keep it simple so I don't make full use of your had work.</p><p>Is there a way an old git like me could find out more simply how to use TMW to its full advantage? I don't tend to mean rewrite all the tool tips but a web page with broken down examples on configuration would be better. Possibly a note on the configuration screen telling people where to look. Several of my guildies won't use TMW because they don't understand it's full capabilities and how they would be assisted by it. My wife will not go near it because she just doesn't understand it.</p><p>I hope you get my drift and keep up my number one addon.</p><p>Regards</p><p>Lucero</p><p>Emerald Dream</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Lucero1\">Lucero1</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/126\">#126</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/126.html\">Raw</a>","closed":true,"closed_at":"2011-05-15T08:16:52Z","created_at":"2011-02-27T12:49:25Z","updated_at":"2011-05-15T08:16:52Z","labels":["enhancement","resolved"]},"comments":[{"body":" <p>I think one way that one could convince their friends to try the addon would be if you could export groups to other users using the addon, that way you could help others with their setups.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Beruchan\">Beruchan</a>","created_at":"2011-02-27T17:40:56Z"},{"body":" <p>I still plan on doing a full, step-by-step guide with pictures and the whole nine yards, but I have been pretty busy lately. I hope to start on it next week.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-03-15T21:46:53Z"},{"body":" <p>I feel pretty bad for putting this off for three months, but at the same time, I'm not really sure that there is a need for such a full-scale guide. I am always here and will be more than happy to create some icons and give you the import strings if you are having trouble getting an icon to do what you want. Just open a ticket or post a comment on Curse and I will be happy to help.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-05-14T00:48:30Z"}]}