{"issue":{"title":"[CF 1268] Fill bar up - small display bug ","body":" <p>The bar displays as filled for a split second at the start of the animation. The lower you set TMW's update interval the less it's noticeable (it's still infrequently visible at 0 sec interval), so it's not really that big of an issue I suppose.</p><p>I'm using spell cooldown bars to represent individual charges of Ironskin Brew (3 charges 3 bars) with conditions hiding bars according to charges.</p><p>Here's a slow-mo video of it at 0.06 sec interval recorded @ 60 fps: <a href=\"https://youtu.be/K6feR65UUpg\" rel=\"nofollow\">https://youtu.be/K6feR65UUpg</a><br>The top number is a GetTime via. a counter via. the Counter dogtag and the bottom number is the Duration dogtag for an Ironskin Brew icon off-screen.<br>I'm not entirely sure if my CPU will be helpful info but I've got an AMD fx6300 @ ~4.313 GHz &amp; the game was running @ ~61.5 fps with vsync off during the recording.</p><p>Again it's not a huge deal but if you've got any ideas as to how I could work around this with some fancy magic that would be really sweet :^D</p><p>Edit: figured I might as well throw in the relevant import string <a href=\"http://pastebin.com/sBwfYNL9\" rel=\"nofollow\">http://pastebin.com/sBwfYNL9</a></p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Ghath519\">Ghath519</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1268\">#1268</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1268.html\">Raw</a>","closed":true,"closed_at":"2016-08-15T23:37:44Z","created_at":"2016-08-08T01:08:21Z","updated_at":"2016-08-15T23:40:27Z","labels":["defect","resolved"]},"comments":[{"body":" <p>Something is weird with the way that Blizzard's statusbars update now. For some reason, when you set the value, the actual texture that represents the progress of the bar isn't updated until 1 or 2 frames after you call it. No idea why its like this.</p>\r\n<p>Ended up having to reverse-engineer a bit of the way that statusbars work to force the texture to be updated immediately whenever the percentage of the bar changes by more than 2%.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2016-08-15T23:40:27Z"}]}