{"issue":{"title":"[CF 1269] Timer Sweep: Allow GCD and spells with charges ","body":" <p>Currently, the timer sweep setting for spell cooldown icons for spells with charges essentially ignores the \"Allow Global Cooldown\" option.</p><p>This can have my preferred behavior of showing the global cooldown sweep after use even with charges recharging and or remaining by altering a portion of Components\\IconTypes\\IconType_cooldown\\cooldown.lua at line 189 from the current:</p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; start, duration = start_charge, duration_charge</p><p>To instead be:</p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; start, duration = GetSpellCooldown(iName)<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; if not OnGCD(duration) or not icon.ClockGCD then<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; start, duration = start_charge, duration_charge<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; end</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/canofbutter\">canofbutter</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1269\">#1269</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1269.html\">Raw</a>","closed":true,"closed_at":"2016-08-14T20:40:32Z","created_at":"2016-08-08T15:54:00Z","updated_at":"2016-09-20T03:37:18Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>This is actually quite a bit more complicated than what you did above. ClockGCD is a setting for the CooldownSweep icon module. Using it to make decisions in a cooldown type breaks encapsulation, and also does not account for the other ways in which a GCD can be allowed (timer bars and DogTags). The code you gave assumes that the icon uses the regular icon display method. To properly display both the GCD and the charge timer on an icon requires some weird stuff that Blizzard introduced to their action bars in Legion which involves creating two timer sweeps on a single button. This isn't supported by Masque, so I wouldn't be able to implement this properly without breaking appearances for most users who skin their icons with Masque.</p>\r\n<p>To do this properly, I would have to pass along some extra data to SetInfo, which incurs a (small) performance penalty, and since this is the first request for this feature that I've ever gotten in the whole time that spell charges have existed (4 years now), I can't see that the tradeoff of breaking Masque skinning and (ever so slightly) reduced performance would be worth it. If I implemented it so that the GCD just replaces the charge timer (which wouldn't break Masque), I think that many people would find it annoying that they could only see their charge timer when not in a GCD.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2016-08-14T20:39:51Z"},{"body":" <p>I hadn't considered other icon types (or issues with Masque), however perhaps there's an alternate way to accomplish this feature as desired without breaking any functionality by implementing it elsewhere in a different module. What about creating a new notification animation type for \"gcd sweep.\" It could then be used with an \"While Condition Set Passing\" \"gcd active\" condition to then display that animation.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/canofbutter\">canofbutter</a>","created_at":"2016-08-14T21:02:18Z"},{"body":" <p>I want to come in and echo this sentiment - I've been using a modified version similar to the code listed above, but with the downside of losing out on the charge sweeps.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/bboyser8\">bboyser8</a>","created_at":"2016-09-19T21:44:21Z"},{"body":" <p>The most recent version made changes that seem to allow this behavior, though at the expense of the timer text always being visible; I'm assuming that's just a bug and will be fixed. I definitely appreciate the new change otherwise! </p>\r\n<p>Edit: the bug was fixed quickly! This behavior is now working and maintains the charge timer as well as the gcd sweep. Awesome job, Cybeloras - thanks so much!</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"09 19 2016 22:37:18 (CST) (UTC-5:00)\" data-epoch=\"1474342638\">Sep 19, 2016</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/canofbutter\">canofbutter</a>","created_at":"2016-09-19T22:36:50Z"}]}