{"issue":{"title":"[CF 1290] Copying Groups With Icon Is Shown Conditions ","body":" <p>What is the enhancement in mind? How should it look and feel?</p><p>This probably won't effect most people in a major sense. So it is low priority imo.</p><p>I created a profile for a Boomkin rotation with 500 conditions. 50-100 of them conditions were Icon Is Shown conditions. These conditions were designed around when my major 3 minute cooldowns were not active.</p><p>I had two choices. 1: Make some extremely complicated conditions to update the icons when I popped my 3 minute cooldowns or 2: Duplicate everything so that 1 set of icons were shown when cooldowns are active and 1 set of icons were shown when cooldowns are not active.</p><p>To easily do option 2 I need to re-create the Icon Is Shown conditions with the current state of TMW.</p><p>It would be handy if there was an option to duplicate multiple groups and re-assign their identifications to the newly created group. I emphasise \"multiple groups\".</p><p>There is a warning in TMW at the moment when you attempt to do this telling you that the groups copied will reference the old icons, however there is no way to automate the process of referencing new icons.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/LordEos\">LordEos</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1290\">#1290</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1290.html\">Raw</a>","closed":true,"closed_at":"2016-09-18T21:13:37Z","created_at":"2016-09-05T09:53:36Z","updated_at":"2016-09-18T21:13:37Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>Well, I posted a response to this, but it seems to be gone. Cool.</p>\r\n<p>Long story short is that if all your icons are in one group when you copy them, all the references within that group will be updated. So, if you need to clone a huge number of icons, move them all to their own groups, clone that group, and then move them all out into separate groups.</p>\r\n<p>This is way too much of an edge case to warrant me writing anything to handle it.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2016-09-18T21:13:28Z"}]}