{"issue":{"title":"[CF 1300] Automatically switch profile on spec change ","body":" <p>I have a radically different profile for each spec. What's more, my configs throw warning on spec change, since they are invalid.</p><p>This is a common feature for other addons&nbsp; - would be great if I could set a profile per spec, and have it automatically switch (or at least have an easy way to quickly switch profiles without opening the options menu).</p><p>Example addon that does this great is bartender</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/ariehg\">ariehg</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1300\">#1300</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1300.html\">Raw</a>","closed":true,"closed_at":"2016-10-29T00:54:55Z","created_at":"2016-09-15T09:17:47Z","updated_at":"2016-10-29T00:54:55Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>You can switch profiles using the slash commands documented in the addon description here on CurseForge and on Curse.</p>\r\n<p>The intended way to do this in TMW, however, is to just have one profile, using the spec settings on each group (not group conditions - conditions don't apply in config mode, while the spec settings on the group do).</p>\r\n<p>If you are already doing this and still getting warnings about invalid icons, then this is a bug, and I'd be interested in seeing an export of your profile so I can figure out why it might be happening.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2016-09-16T21:38:08Z"},{"body":" <p>Using the spec settings did remove the errors, but then I end up with a lot of profiles per char, and it is now how I am running.</p>\r\n<p>I do want to point out that this method is somewhat limiting - for one, I have too many groups. For another - it limits the ability to share/import profiles, since cross-group dependencies don't import well if you import them on top of your current profile.</p>\r\n<p>I love the flixibility that comes with the role/spec selection in the group settings, and it's amazing for global groups, but having an automatic profile switch would also have been great.</p>\r\n<p>Will also look into the slash command. Might just have a macro that both changes the spec and the profile.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/ariehg\">ariehg</a>","created_at":"2016-09-18T12:55:40Z"}]}