{"issue":{"title":"[CF 1303] \"Allow Global Cooldown\" not working for Blessed Hammer ","body":" <p>IMPORTANT: If your issue is only occurring with a specific icon, include an export string of the icon in this ticket. Similarly, if the issue involves an entire group or an entire profile, include the entire export string of the group or profile.</p><p>To get an export string, open the icon editor, and click button labeled \"Import/Export/Backup\". Select the \"To string\" option for the appropriate export type for your issue, and then press CTRL+C to copy it to your clipboard.</p><p>^1^T^SShowTimer^B ^SType^Scooldown ^SName^S축복받은~`망치 ^SClockGCD^B ^SEnabled^B ^SShowTimerText^B ^SStates^T ^N2^T ^SAlpha^N1 ^t^N3^T ^SAlpha^N1 ^t^N4^T ^SAlpha^N1 ^t^t^t^N81209^S~`~| ^Sicon^^</p><p>(The Korean words above are for Blessed Hammer)</p><p>What steps will reproduce the problem?</p><p>1. choose the Prot. Paladin talent Bleseed Hammer<br>2. make a TMW Spell Cooldown icon for Blessed Hammer<br>3. check the Allow Global Cooldown</p><p>What do you expect to happen? What happens instead?</p><p>The icon does not show the Global Cooldown when Blessed Hammer has less than 3 charges. It only reacts to the Global Cooldown when it has full 3 charges.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)</p><p>v.8.1.2</p><p>Do you have an error log of what happened?</p><p>N/A</p><p>Please provide any additional information below (including any export strings if applicable; see above.)</p><p>I want the TMW Blessed Hammer icon to behave like the default WOW UI action bar icon. Thanks a lot for this great addon.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/BongKim\">BongKim</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1303\">#1303</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1303.html\">Raw</a>","closed":true,"closed_at":"2016-09-18T20:47:45Z","created_at":"2016-09-18T05:23:41Z","updated_at":"2016-09-18T20:47:45Z","labels":["defect","resolved"]},"comments":[]}