{"issue":{"title":"[CF 1319] Add a way to input bar height/width manually ","body":" <p><strong>What version of TellMeWhen are you using now? (\"The latest\" is not a version)</strong></p>\r\n<p>8.1.2</p>\r\n<p><strong>What is the enhancement in mind? How should it look and feel?</strong></p>\r\n<p>The group settings for bar and vertical bar groups would contain an extra slider to control the group's width or height. Just like the other sliders (e.g. the ones for the scale or the X and Y offsets) this would be right-clickable to allow typing a number into a text box instead. I'm not sure if this makes more sense in the \"Bar\" section in the left column (with the other bar-specific options) or in the \"Position\" section on the right (with the scale, the option it is most similar to).</p>\r\n<p><strong>Please provide any additional information below.</strong></p>\r\n<p>I am aware that you can drag the corner of the group (when unlocked) to change the bar width. However, trying to use this to make bars that line up with other interface elements is very frustrating because dragging the corner tends to change the group's <em>scale</em> in addition to its length. Presumably it was the difficulty of producing pixel-perfect layouts using only the mouse that led to all the other position-related options being editable directly, so not being able to do the same for bar lengths seems like an oversight.</p>\r\n<p>Ideally the input would be measured in screen pixels like the X and Y offsets, as this would be less confusing to the user and make it easier to match the length of TMW bars to other addon elements like unitframes. However -- because I solved my immediate problem by manually editing my saved variables file -- I'm aware that TMW internally represents these lengths as they are <em>before</em> the group's scale is applied, and exposing that to the user instead would be fine too. (IIRC padding works that way already.)</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/polveroj\">polveroj</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1319\">#1319</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1319.html\">Raw</a>","closed":true,"closed_at":"2018-09-09T22:04:10Z","created_at":"2016-10-21T20:40:14Z","updated_at":"2018-09-09T22:04:10Z","labels":["enhancement","resolved"]},"comments":[]}