{"issue":{"title":"[CF 1355] Notification option to tint icon/bars ","body":" <p>I'd love to see an option to have a Notification apply a solid tint to a color or bar. There's already the color flash option, which I can set the flash duration to 0 and it appears to be solid, but at least for timer bars, it ends up behind the bar instead of tinting the bar itself.</p>\r\n<p>&nbsp;</p>\r\n<p>The reason I'm interested in this is I have a timer bar that's a Primary Resource bar and I want to change its color when my primary resource goes above a certain threshold. Right now I've implemented this by having 2 bars, one using the default color and one overriding it, and controlling the visibility of the bars based on that threshold, but whenever my resource crosses the threshold, for one frame it draws at the wrong location (it draws where the second bar would be if both bars were visible), and that bugs me.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/eridius\">eridius</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1355\">#1355</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1355.html\">Raw</a>","closed":true,"closed_at":"2017-01-02T20:23:12Z","created_at":"2016-12-28T04:15:19Z","updated_at":"2017-01-02T20:23:24Z","labels":["declined","enhancement"]},"comments":[{"body":" <p>You solution is the correct way to do this. If you'd like to report a bug regarding the position of the icons, please open a ticket for that and include the export string of the icons (or group) that you're having trouble with.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"01 2 2017 14:23:24 (CST) (UTC-6:00)\" data-epoch=\"1483388604\">Jan 2, 2017</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2017-01-02T20:23:12Z"}]}