{"issue":{"title":"[CF 1362] Add icon activation border and/or ability current resource requirement to conditions ","body":" <p>Hello TMW devs,</p>\r\n<p>&nbsp;</p>\r\n<p>Firstly, thanks for the great addon.</p>\r\n<p>&nbsp;</p>\r\n<p>7.1.5 is live and the changes to Prot Warriors have resulted in me being unable to achieve something i now want to with TMW.</p>\r\n<p>&nbsp;</p>\r\n<p>Protection Warriors now have their ability \"Revenge\" costing 30 rage usually, but costing no rage when you get a proc (from dodging or parrying an opponent). This new proc when active has a semi-circle graphic that displays in the center-right of the screen (similar to how many procs in the game do) and the icon on the action bar gets that sparkly yellow activation border, but it does NOT show any buff icon up the top-right of the screen. Without it registering as an actual buff, i cannot manipulate TMW icons as well/easily based on it being active. What I want to do is simply have the TMW icon only appear when the proc is active (but not when the ability is usable without the proc active).</p>\r\n<p>&nbsp;</p>\r\n<p>Hence I request either of the following:</p>\r\n<p>&nbsp;</p>\r\n<p>1. I see when configuring a reactive ability there's a checkbox for \"Check activation border\". Can checking the activation border be added to the condition types for Spells/Items? Then i could make a simple condition for success:</p>\r\n<p>if spell_border ~= absent</p>\r\n<p>&nbsp;</p>\r\n<p>or alternately/additionally:</p>\r\n<p>2. Can checking the current resource cost of a spell or ability be added to the condition types for Spells/Items? That way i could check if Revenge currently costs 0 rage (or &lt;30, whatever) and achieve the same goal, because the proc makes it cost no rage instead of 30.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>...or if there's some way i can achieve this outcome with the current options or with some custom scripting, i'd appreciate any advice.</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks for your time.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/KorrodeAU\">KorrodeAU</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1362\">#1362</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1362.html\">Raw</a>","closed":true,"closed_at":"2017-02-12T04:41:23Z","created_at":"2017-01-10T20:13:04Z","updated_at":"2017-02-12T04:42:24Z","labels":["enhancement","resolved"]},"comments":[{"body":" <p>As a protection warrior myself, I really want to add the \"sparkling border\" check function in TMW. &nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>The closest method so far is&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>1. Add \"Notifications\" to the Revenge in \"Spell Cooldown\"</p>\r\n<p>&nbsp;</p>\r\n<p>2. Add \"Icon:Activation Border\" in \"While Condition Set Passing\"</p>\r\n<p>&nbsp;</p>\r\n<p>3. Add \"Spell reactivity\" and \"Revenge\" to \"Trigger Conditions\"; check \"Usable\"</p>\r\n<p>&nbsp;</p>\r\n<p>However, the above setting makes the TMW Revenge icon sparkle when it's usable.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>My suggestion is</p>\r\n<p>&nbsp;</p>\r\n<p>1. It would be great that there's a condition to check if the sparkly yellow border around an action is on. &nbsp;&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>2. If there's an additional condition to check the cost of a spell (because Revenge is free without 30 rage cost when it procs) it could be possible to simulate the action bar.</p>\r\n<p>&nbsp;</p>\r\n<p>3. In \"Reactive Ability\" icon setting add \"Show Activation border\" checkbox.</p>\r\n<p>&nbsp;</p>\r\n<p>Any of the above would be cool. Thank you.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"01 13 2017 03:00:30 (CST) (UTC-6:00)\" data-epoch=\"1484298030\">Jan 13, 2017</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/BongKim\">BongKim</a>","created_at":"2017-01-13T07:30:45Z"},{"body":" <p>Added a setting to reactive abilities to only allow them to display as usable if the activation border is present.</p>\r\n<p>&nbsp;</p>\r\n<p>Also added a spell cost condition.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"02 11 2017 22:42:24 (CST) (UTC-6:00)\" data-epoch=\"1486874544\">Feb 11, 2017</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2017-02-12T04:41:23Z"}]}