{"issue":{"title":"[CF 1427] Individually Disable DogTags on Buffs/Debuffs ","body":" <p><a href=\"http://i.imgur.com/sNXm0e0.jpg\" rel=\"nofollow\">http://i.imgur.com/sNXm0e0.jpg</a></p>\r\n<p>&nbsp;</p>\r\n<p>For example, I want to track 2 debuffs (or maybe a ton more). For the purpose of Overpower, there is only 1 buff ever, but Cleave can stack from 1 to 5, so I need the [Stacks] tag on it. However if I track both in one, Overpower will also show 1, which is extraneous information that I don't want. If I want to circumvent this, I'd have to make a meta and make 2 separate auras.</p>\r\n<p>&nbsp;</p>\r\n<p>Is it possible to create a way for TellMeWhen to recognize a suffix attached to a buff and omit DogTags from processing that buff? For example I could put:</p>\r\n<p>&nbsp;</p>\r\n<p>Overpower!-DT2; Cleave</p>\r\n<p>&nbsp;</p>\r\n<p>The '-DT2' would be checked to strip the Overpower aura from being processed by the 2nd DogTag line, which is the Stacks tag (hence DT2), but the Cleave would still be processed as normal with the tag.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>This would be a great feature since for more than a few things already I have to create auras SPECIFICALLY separate to avoid this issue, which can be especially annoying when combining auras in groups. Some things have stacks which require the [Stacks] tag, but then some others don't and I don't want or need the extra numbers.</p>\r\n<p>&nbsp;</p>\r\n<p>Another solution would be for TellMeWhen to somehow recognize which de/buffs can stack and which can't, though I imagine this would require manual input of every aura or something which isn't feasible.</p>\r\n<p>&nbsp;</p>\r\n<p>One last thing I could think of - maybe the above (recognizing which can stack) IS in and if there are two buffs in the same aura, one which can stack and one that can't, TMW defaults to showing the stacks of EVERY aura, regardless if it can go past one? It would explain why this aura has that nature and some others I have the [Stack:Hide(0)] tag not succeed to show a 1 if every aura in the group has no stacking component. So in that case this behavior that I'm reporting in the first place is a bug in itself?</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Jalopyy\">Jalopyy</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1427\">#1427</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1427.html\">Raw</a>","closed":true,"closed_at":"2017-08-06T04:24:06Z","created_at":"2017-07-14T22:09:35Z","updated_at":"2017-08-06T04:24:06Z","labels":["declined","enhancement"]},"comments":[{"body":" <p>Things that don't stack that still show stacks is because Blizzard normally doesn't report a stack number if something doesn't stack, but for some reason for a few random spells, they will report a stack of 1 sometimes even if the thing doesn't stack.</p>\r\n<p>&nbsp;</p>\r\n<p>I think a lot of other interfaces handle this by also hiding stacks of 1, but I didn't really want to do that as the default text for TMW.</p>\r\n<p>&nbsp;</p>\r\n<p>You could:</p>\r\n<ol>\r\n<li>Use Stacks:Hide(0,1) to also hide stacks of 1 (not really nice for Cleave, though).</li>\r\n<li>Write the logic into the text display itself - <strong>[Spell = 'Cleave' ? Stacks]</strong>. This is way better. (this is shorthand for [if Spell = 'Cleave' then Stacks end]</li>\r\n</ol> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"08 5 2017 23:04:42 (CST) (UTC-5:00)\" data-epoch=\"1501992282\">Aug 5, 2017</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2017-08-06T04:04:20Z"}]}