{"issue":{"title":"[CF 1428] Request for new available state ","body":" <p>Hi there, I absolutely love the AddOn, been using for years. I have a bug bounty I'd be happy to donate $100 for the resolution of. I recently came across a mechanic I needed to represent for which I didn't have the available state.<br><br>When a mage casts Flurry,&nbsp;Winter's Chill debuff will be applied to the target. The presence of a debuff is obviously available as state, but it unfortunately doesn't fit this use case. Flurry is a missile spell that takes a few MS to land, before the debuff is applied, and there is a gap in timing that I need to indicate to use Ice Lance.<br><br>The availability of Last Used spell is somewhat functional&nbsp;for this use case, as I can check if Last Used is Flurry. There is, however, no timeout on this. So upon the target dying or anything like that, the icon will remain active indefinitely until another ability is used.<br><br>There are therefore 3 adjustments that could be made to fit this use case, and IMO all 3 should be added as they are all useful.<br>1.) A timeout on Last Used (i.e. Last Used within the past 3 seconds)<br>2.) A spell state of \"in flight\", which would indicate that a&nbsp;spell was cast but has not landed on the target yet.&nbsp;I assume the game makes the states available to let you know that a spell has been cast, and then you can check for a hit/crit/miss/absorb etc to determine whether it has landed.<br>3.) A timeout since a buff or a debuff fell off of player/target.<br><br>Any of those 3 additions of state would suit my use-case,&nbsp;for which I would consider the bounty fulfilled. The remaining 2 issues are still useful pieces of state that surely others have uses for in their conditionals.<br><br>Thank you, and thanks for the great AddOn</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/ralusek\">ralusek</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1428\">#1428</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1428.html\">Raw</a>","closed":true,"closed_at":"2017-08-12T04:46:19Z","created_at":"2017-07-15T20:55:20Z","updated_at":"2017-08-12T04:46:19Z","labels":["enhancement"]},"comments":[{"body":" <p>Obviously I'm not Cybeloras but&nbsp;-&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>You want a short duration timer that lasts for a &lt;1.5s to denote a window of time where you can shove an ice lance before/while flurry hits (because they both get effected by fingers or something like that?) right?</p>\r\n<p>&nbsp;</p>\r\n<p>Combat event icon tracking flurry, set to cast success, source player, don't reset since flurry prob hits multiple times and might try to refresh the icon and just put a custom icon for ice lance to remind yourself.</p>\r\n<p>&nbsp;</p>\r\n<p>^1^T^SShowTimer^B ^SCLEUEvents^T ^SSPELL_CAST_SUCCESS^B ^t^SType^Scleu ^SCLEUDur^N1.5 ^SName^SFlurry ^SCLEUNoRefresh^B ^SSettingsPerView^T ^Sicon^T ^STextLayout^Sicon2 ^t^t^SCustomTex^S30455 ^SStates^T ^N1^T ^t^N3^T ^t^N4^T ^t^t^SEnabled^B ^SSourceUnit^Splayer ^t^N84002^S~`~| ^Sicon^^</p>\r\n<p>&nbsp;</p>\r\n<p>Should work if I understand you right.</p>\r\n<p>&nbsp;</p>\r\n<p>E: I'm not sure if when you cast flurry you ALWAYS want to lance right after for this effect, but if it's conditional based on certain buffs being up, you can just add those buffs individually as conditions under buff -&gt; buff duration -&gt; != absent</p>\r\n<p>&nbsp;</p>\r\n<p>E2: Alternatively, if there's a VERY specific window where you have to cast that ice lance (can't just shove it instantly after the flurry, there has to be some kind of self-imposed delay) then you could make 2 auras, 1 condition aura for last spell cast = flurry and 1 condition aura that watches the first aura and will only show after it has appeared after X seconds. Might still have to tack on buff conditionals to the first one too.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"07 15 2017 19:56:00 (CST) (UTC-5:00)\" data-epoch=\"1500166560\">Jul 15, 2017</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Jalopyy\">Jalopyy</a>","created_at":"2017-07-16T00:30:42Z"},{"body":" <p>Does this work for you, ralusek?</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2017-08-06T03:57:30Z"}]}