{"issue":{"title":"[CF 1431] New Conditional Tab for Visibility Conditionals ","body":" <p>Right now the conditional tab is be all end all for 'for the icon to succeed as true, these conditions must be met'. However, sometimes a lot of the conditions I'm adding aren't necessary conditions for what I need the icon to be to be true, but just added so I don't have the icon popping up in certain places, such as lower raid difficulties, out of combat, if the boss is a certain name.</p>\r\n<p>&nbsp;</p>\r\n<p>How about having 1 tab for conditions for the icon to be true, and 1 for the icon to show in the first place? It's similar to WeakAuras where they have 'Triggers' for the icon to succeed as true, and then 'Load' where there're a list of options for what scenarios the icon will turn itself on in. It also fixes some situations where you want the group to be shown out of combat, but a meta icon has icons that you don't want to see out of combat, and if you put a condition for player in combat, it stops the entire combat event aura from checking (since it reads in combat as a requirement to fire), so it can not show sometimes.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Jalopyy\">Jalopyy</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1431\">#1431</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1431.html\">Raw</a>","closed":true,"closed_at":"2017-08-06T03:55:16Z","created_at":"2017-07-22T02:09:41Z","updated_at":"2017-08-06T03:55:16Z","labels":["declined","enhancement"]},"comments":[{"body":" <p>This would be a very significant architectural change to TMW, that I'm not willing to undergo at this point in the addon's life and my available level of effort to put into it (I know I already told you about this in PM).</p>\r\n<p>&nbsp;</p>\r\n<p>The intended solution for this is group conditions. I know its not the best solution to have this behavior tightly coupled to the same system that governs icon layout, but for the vast majority of use cases, a group of icons with similar functionality that you want to be functioning only under some conditions will probably be grouped together, so it works out nicely in the end for a lot of setups.</p>\r\n<p>&nbsp;</p>\r\n<p>Your setups go way beyond the original intentions behind TMW, and while this is awesome, it will probably require more work for you to make things like this work. You could, for example, put your icon that you only want for a certain boss fight in its own group with group conditions checking the current fight, and put your conditions specific to the icon on the icon itself (checking boss mod timers or HP percentages or whatever), and then bring that icon into the location where you want it via meta icon.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2017-08-06T03:55:16Z"}]}