{"issue":{"title":"[CF 1442] Meta icon errors when component icons aren't loaded ","body":" <p>When a meta icon references an icon whose group isn't loaded (e.g. it's for another spec), it outputs to chat an error message such as:</p>\r\n<div>\n\n```\nTellMeWhen: The #3 icon checked by meta icon  Global Group: Global Display (1), Icon: 9 is invalid.\n```\n</div>\r\n<p>Additionally, in the meta icon's options, the component icon will say \"&lt;Unknown/Unavailable Icon&gt;\".</p>\r\n<p>&nbsp;</p>\r\n<p>There is no corruption or any serious issues going on, when the component icon gets loaded (e.g. spec change) one can see that the component icon's GUID is preserved. It is a minor annoyance because (1) the chat error spam, and (2) I cannot see what the component icons are if the group is not loaded. I am using a pattern where a single meta icon might contain components from multiple specs and classes, and only the ones for the current spec/class are loaded. However, it would be nice to see the icons from the other specs/classes that can fill the slot, with some indicator that those icons are not currently loaded.</p>\r\n<p>&nbsp;</p>\r\n<p>The problem probably stems from the addon not being able to detect a mapping from GUID to icon info when the icon's group is not loaded. Maybe it would be possible to have a \"lite\" load of all icons, even from non-loaded groups, that pulls in basic metadata about every icon.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Arcinde\">Arcinde</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1442\">#1442</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1442.html\">Raw</a>","closed":true,"closed_at":"2017-10-15T00:21:38Z","created_at":"2017-10-08T20:40:39Z","updated_at":"2017-10-15T00:21:38Z","labels":["resolved"]},"comments":[{"body":" <p>You can turn the chat warnings off - uncheck \"Warn about invalid icons\" in the options.</p>\r\n<p>&nbsp;</p>\r\n<p>I'll add better text for unloaded icons.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2017-10-15T00:21:38Z"}]}