{"issue":{"title":"[CF 1449] Unable to install (dependency error) ","body":" <p>I am currently unable to isntall this addon through the twitch client:</p>\r\n<p>&nbsp;</p>\r\n<div>\n\n```\nError:\r\nUnable to install dependency. The following addon ID could not be found in the database: 101646\n```\n</div>\r\n<p>&nbsp;Unfortunately I was not able to find which addon the addon ID belongs to or a dependency list for the TellMeWhen addon.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/yaccin\">yaccin</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1449\">#1449</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1449.html\">Raw</a>","closed":true,"closed_at":"2018-01-20T21:10:18Z","created_at":"2017-11-16T17:25:02Z","updated_at":"2018-01-20T21:10:18Z","labels":["resolved"]},"comments":[{"body":" <p>Having the same issue.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/falcon2001\">falcon2001</a>","created_at":"2017-11-17T06:26:20Z"},{"body":" <p>Either of you manage to fix this?</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/tobbo111\">tobbo111</a>","created_at":"2017-11-19T01:53:10Z"},{"body":" <p>I have the same issue, is there any chance this will get fixed soon?</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/ColdCrystal975\">ColdCrystal975</a>","created_at":"2017-11-19T14:41:49Z"},{"body":" <p>same here, can't download</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/pike14\">pike14</a>","created_at":"2017-11-20T09:08:44Z"},{"body":" <p>I'm not responsible for defects with Curse and/or Twitch. For some unknown reason, there are two now-deleted libraries listed as dependencies of the latest release of TMW:&nbsp;<a href=\"https://wow.curseforge.com/projects/tellmewhen/files/2470515\" rel=\"nofollow\">https://wow.curseforge.com/projects/tellmewhen/files/2470515</a> (at the bottom of the page).&nbsp; These libraries have never been used by TMW, have never been packaged with TMW, have never been listed as part of any previous alpha or release version, and are not listed as a dependency of either of the two alpha versions that post-date the latest release, 8.4.2.</p>\r\n<p>&nbsp;</p>\r\n<p>I am given the option to edit the 8.4.2 release and remove these now-deleted projects as dependencies, but when I do so, my changes have no effect. The two projects, \"LibAuraCalculation-1.0\", and \"LibAuraTracker-1.0-deleted\", are still listed as dependencies.</p>\r\n<p>&nbsp;</p>\r\n<p>The best I can do is release a new version of TMW and hope that curse doesn't add dependencies to the project for libraries I've never used.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2017-11-24T01:44:06Z"},{"body":" <p>To the Curse/CurseForge support person/developer reading this: I was able to finally remove the two dependencies on these files by unchecking the incredibly vague and inconspicuous checkbox, \"Include Default Project Relations\", when removing those two dependencies from the file.</p>\r\n<p>&nbsp;</p>\r\n<p>This only leaves me with more questions (which developed into more of a stream of confused consciousness as I wrote it):</p>\r\n<ol>\r\n<li>Could a description be added to the edit pages that explains what this checkbox does, and perhaps also could you make its existence a bit more obvious?</li>\r\n<li>I assume that it causes any libraries that are listed at&nbsp;<a href=\"https://wow.curseforge.com/projects/tellmewhen/relations/dependencies\" rel=\"nofollow\">https://wow.curseforge.com/projects/tellmewhen/relations/dependencies</a> to be added as dependencies when I save, <em>regardless of the fact that I just requested that they be removed</em>. I'm trying to figure out, then, why leaving this checkbox checked prevented these references to&nbsp;\"LibAuraCalculation-1.0\" and \"LibAuraTracker-1.0-deleted\" from being removed, seeing as neither of them are actually listed on <a href=\"https://wow.curseforge.com/projects/tellmewhen/relations/dependencies\" rel=\"nofollow\">https://wow.curseforge.com/projects/tellmewhen/relations/dependencies</a> ?</li>\r\n<li>I just tested saving the file again, and these two projects were&nbsp;<strong>RE-ADDED</strong> as dependencies when I left that checkbox enabled. That must mean they're coming from somewhere else - not from&nbsp;<a href=\"https://wow.curseforge.com/projects/tellmewhen/relations/dependencies\" rel=\"nofollow\">https://wow.curseforge.com/projects/tellmewhen/relations/dependencies</a></li>\r\n<li>Oh, I see now that they're ACTUALLY coming from <a href=\"https://wow.curseforge.com/projects/tellmewhen/settings/default-relations\" rel=\"nofollow\">https://wow.curseforge.com/projects/tellmewhen/settings/default-relations</a>. I'm assuming, then, that they got added to this particular file (8.4.2) when I edited it manually after it was packaged to add additional supported WoW versions to the file.</li>\r\n<li>This brings up the next most obvious question - how did these projects end up on&nbsp;<a href=\"https://wow.curseforge.com/projects/tellmewhen/settings/default-relations?\" rel=\"nofollow\">https://wow.curseforge.com/projects/tellmewhen/settings/default-relations?</a> I've now deleted them from this list, but I'd still like to know how they got here (their full links are&nbsp;<a href=\"https://wow.curseforge.com/projects/project-101566\" rel=\"nofollow\">https://wow.curseforge.com/projects/project-101566</a> and&nbsp;<a href=\"https://wow.curseforge.com/projects/project-101646\" rel=\"nofollow\">https://wow.curseforge.com/projects/project-101646</a>)</li>\r\n<li>Can I also just take a moment before I post this comment to reiterate how absurd it is that the behavior of editing a file worked out as follows:\r\n<ol>\r\n<li>I click the edit button on the file</li>\r\n<li>I check a box to add 7.2.5 as a supported WoW version of the file.</li>\r\n<li>I click the save button at the bottom of the page.</li>\r\n<li>CurseForge takes the liberty of adding two additional dependencies to my project because some checkbox was checked by default on the edit page.</li>\r\n</ol>\r\n</li>\r\n</ol>\r\n<p>Checkboxes are traditionally used to indicate, and allow modification to, a binary setting. No reasonable user would expect that a checkbox that the user&nbsp;<span style=\"text-decoration:underline\">did not toggle themselves</span> would cause some unknown and ultimately adverse behavior to happen upon saving their changes. This checkbox should be removed altogether, and replaced with a button that, upon the user's explicit clicking of, would add from the magical \"default relations\" list any projects which are not already included in the list of dependencies. Only after the user's opportunity to visually inspect the outcome of pressing this button (by looking at what dependencies were just added to the page) would the user then decide that additional dependencies being added to their project is a desired action. Then the user presses save to express their intent to keep these added dependencies.</p>\r\n<p>&nbsp;</p>\r\n<p>I apologize for my frustrated and combative tone, but I have been nothing but disappointed, and at times like this, downright angry at how much worse the \"new\" Curseforge is compared to how it was 2 years ago. Entire features are gone (forums, multiple repos per project), and existing features were made much worse (issue tracking). I mean, the issue tracker doesn't even have a search feature. There was no involvement with addon authors in the design of the new site, and there has been zero progress made on it since the day it was released. This is one of the biggest causes of the significant drop in the amount of time I spend working on my addons - I no longer feel like I have a decent platform to host them on.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2017-11-24T02:20:53Z"},{"body":" <p>Just wanted to say thanks&nbsp;<a href=\"https://wow.curseforge.com/members/Cybeloras\" rel=\"nofollow\">Cybeloras</a>&nbsp;for the great addon and all of your effort tracking this down!</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/rekoilgzs\">rekoilgzs</a>","created_at":"2017-11-24T13:21:25Z"}]}