{"issue":{"title":"[CF 150] Internal cooldown/Spell duration tigger conditions ","body":" <p>Well, i didn't expect it to happen - but it seems i found something that i currently can't keep track of with TellMeWhen.</p><p>Playing a shadowpriest, i wanted to setup an aura to see if my Empowered Shadow (Spell id: 95799) is buffed by Revelation (Normal SpellId: 91024 | Horoic SpellId: 92320) - which is the proc from Theralion's Mirror (Trinket). Empowered Shadow lasts 15sec. and is applied or refreshed when you cast Mind Spike or Mind Blast and have Shadoworbs consumed by the cast.</p><p>Therefore, i tried to setup a TMW aura of the 'Internal cooldown/Spell duration'-type watching the Spell id of Empowered Shadow. This works like a charm, tiggering the configured 15sec. CD everytime Empowered Shadow is refreshed. But now i need to distinguish if Revelation currently active, or not. In the case that it's not up, the configured ICD should not refresh.<br>This is different from checking this via a 'Icon Shown'-Condition, since if Empowered Shadow is buffed by Revelation, and Revelation runs out - Empowered Shadow remains buffed for the rest of its duration. (Making you not want to refesh it early)</p><p>There are also other examples where a 'tigger only if Icon X shown' conditions would be nice to have: Maybe an easier to understand example is when Bloodlust/Heroism runs out, dots which are cast prior to this still benefit from the haste Blodlust provided - same as above: You avoid to refresh them early.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Twister\">Twister</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/150\">#150</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/150.html\">Raw</a>","closed":true,"closed_at":"2011-04-04T04:05:47Z","created_at":"2011-04-01T17:21:54Z","updated_at":"2011-04-04T04:05:47Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>Because of the way things are currently coded, this would require way too much overhaul than I am currently willing to do. This is just something that is best left to the human brain to keep track of, at least until I get time to maybe make something like this possible.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"04 3 2011 23:05:04 (CST) (UTC-5:00)\" data-epoch=\"1301889904\">Apr 3, 2011</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-04-03T06:26:58Z"}]}