{"issue":{"title":"[CF 1501] quaking affix ","body":" <p>Anyone knows how to (or has a import string) to add the cool down and timer for the quaking affix?<br>I have seen examples of it for weak aura but couldn't replicate that using this wonderful, fast and resource light addon</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Ahoora\">Ahoora</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1501\">#1501</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1501.html\">Raw</a>","closed":true,"closed_at":"2018-07-14T22:48:25Z","created_at":"2018-07-01T17:23:37Z","updated_at":"2018-07-14T22:48:25Z","labels":["question"]},"comments":[{"body":" <p>It is definitely possible.</p>\r\n<p>&nbsp;</p>\r\n<p>First you need to know how the debuff works, for example if it happens on a fixed timer like every 30 seconds during the dungeon. Lets assume its on a fixed timer, otherwise I don't know how to help.</p>\r\n<p>&nbsp;</p>\r\n<p>Next you would need to get a spell ID or the name of the quaking debuff. Getting the name of the debuff is easy, just mouse over it, assuming there is a debuff! To get the spell ID you can log your dungeon in warcraft logs and clicking the picture of the debuff on warcraft logs will take you to wowhead which will give you a spell ID. Also there are also addons which can display spell ID's for you. Alternatively you can check to see what you take damage from in warcraft logs and get the spell ID or name from there.</p>\r\n<p>&nbsp;</p>\r\n<p>Thats a lot to take in I know. The spell ID is usually better since blizzard like to call lots of things the same name, so using the name can accidentally track multiple things. Also you may have more success with the debuff name/spell ID or you may have more success with the damage taken name/spell ID.</p>\r\n<p>&nbsp;</p>\r\n<p>Next you would need to use this information.</p>\r\n<p>&nbsp;</p>\r\n<p>There are several ways to go about this. But the simplest way would be to make an icon with the icon type of \"combat event\"</p>\r\n<p>&nbsp;</p>\r\n<p>To test it can actually work you should set it to:</p>\r\n<p>what to track: The spell ID of the damage/debuff you found or the name of the damage/debuff you found.</p>\r\n<p>Events to check: Choose \"Any Event\" at the top initially. This will check every type of debuff/damage type that the combat event icon can track.</p>\r\n<p>timer to set on event: 0:10 (10 seconds)</p>\r\n<p>dont type anything in source unit</p>\r\n<p>dont type anything in destination unit</p>\r\n<p>timer running: 100%</p>\r\n<p>timer not running: 30%</p>\r\n<p>&nbsp;</p>\r\n<p>You should also enable the \"show timer\" and \"cooldown sweep\" options or w/e they are called so you can see the standard blizzard sweep animation of the timer.</p>\r\n<p>&nbsp;</p>\r\n<p>If it works at this point but it is randomly resetting and doing some crazy stuff, its likely because we chose \"Any Event\" and it is tracking when you take damage from it, when the debuff is applied, and all sorts of stuff. You will now need to narrow this down and pick a specific event type and hopefully find whichever one it is you need to track.</p>\r\n<p>&nbsp;</p>\r\n<p>You can then tune the 10 second timer to however long it is between quakes.</p>\r\n<p>&nbsp;</p>\r\n<p>There are other ways to go about it if you have trouble with any of these steps, which are way more complex.</p>\r\n<p>&nbsp;</p>\r\n<p>Good luck!</p>\r\n<p>&nbsp;</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"07 10 2018 08:13:19 (CST) (UTC-5:00)\" data-epoch=\"1531228399\">Jul 10, 2018</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/bobthegoat2\">bobthegoat2</a>","created_at":"2018-07-10T10:20:08Z"},{"body":" <p>Fixed a mistake.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/bobthegoat2\">bobthegoat2</a>","created_at":"2018-07-10T13:05:12Z"}]}