{"issue":{"title":"[CF 1529] Load basic info of component icons from different profiles ","body":" <p>(This is basically a reopen of&nbsp;<a href=\"https://github.com/tmw-issue-import/TellMeWhen/issues?q=%5BCF%201442%5D+in%3Atitle\" rel=\"nofollow\">https://wow.curseforge.com/projects/tellmewhen/issues/1442</a>. After that issue was closed, the problem went away for other specs in the same profile, but it still exists cross-profile.)</p>\r\n<p>&nbsp;</p>\r\n<p>A meta icon may have icons from two different profiles as component icons. This works fine as each icon is only loaded in its respective profile. However, in the dropdown, the component icons from not-currently-loaded profiles appear as \"Unknown/Unavailable Icon\".</p>\r\n<p>&nbsp;</p>\r\n<ul>\r\n<li>It&nbsp;is not possible to distinguish between the not-loaded icons, versus truly invalid icons. There could be an invalid component icon in the middle of the screenshot below that I should delete, but I wouldn't know without manually checking every single profile. (I would consider this the main issue.)</li>\r\n<li>One has to uncheck \"Warn about invalid icons\" to avoid errors in chat. This is not ideal.</li>\r\n<li>One cannot see the names of the not-loaded icons.</li>\r\n</ul>\r\n<p><img src=\"https://i.imgur.com/7yKYYXP.png\"></p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Arcinde\">Arcinde</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1529\">#1529</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1529.html\">Raw</a>","closed":true,"closed_at":"2018-07-29T20:19:27Z","created_at":"2018-07-23T10:39:28Z","updated_at":"2018-07-29T20:19:27Z","labels":["declined","enhancement"]},"comments":[{"body":" <p>I can't do it for icons across profiles - the performance implications are too significant, for one.</p>\r\n<p>&nbsp;</p>\r\n<p>I think the better way to go about what you're doing is have a meta icon in each profile that represents the profile-specific contents of this uber-meta icon. Then, include just the one meta icon for each profile, and use the Expand sub-metas option.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2018-07-24T03:28:05Z"},{"body":" <p>Thanks, that's a good idea, I might just do that.</p>\r\n<p>&nbsp;</p>\r\n<p>I don't think it'll be a big performance impact, however. One doesn't have to fully load the icon, just build/maintain a GUID to name table. So we traverse over all icons in all groups in all profiles in TellMeWhenDB once, which is probably ~100-1000 table accesses and would add a fraction of a millisecond to load time.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Arcinde\">Arcinde</a>","created_at":"2018-07-25T02:00:27Z"},{"body":" <p>You're not wrong, but at this point its just not an effort I'm willing to invest. If this turns out to be something that would be helpful to lots and lots of users, then perhaps, but at this point, you're the only person that has ever brought this up as an issue.&nbsp; Sorry.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2018-07-29T20:19:27Z"}]}