{"issue":{"title":"[CF 1539] Guardians - Imps ","body":" <div>Hi,</div>\r\n<div>&nbsp;</div>\r\n<div>Great job on the Guardians icon! It works very well. I found a mechanic that the icon does not take in to account.</div>\r\n<div>&nbsp;</div>\r\n<div>The imps, no matter if summoned by Hand of Gul'dan (HoG) or by Inner Demons (ID) talent have twice as long despawn time if the player is out of combat. Basically the mechanic seems to be that imps that spawn out of combat (ID) always have 24 seconds of life and Imps that are spawned while player is engaged in combat (HoG and ID) have 12 seconds of life. However, here's the interesting part: any imps that were spawned in combat and are still alive when the player leaves combat will get 12 seconds added to their life on top of whatever was left of the original 12 seconds. This can of course only happen once for an imp, i.e. an imp can have a maximum life of 24 seconds no matter what.</div>\r\n<div>&nbsp;</div>\r\n<div>One thing to note is that it is not any combat that triggers this. I do not know the terms for this but the player has to use offensive spells to trigger the change in despawn rate and if the units that were affected by offensive spells died then the imps seem to go back to 24s mode even though the player may still be in combat with units that the player has not attacked.</div>\r\n<div>&nbsp;</div>\r\n<div>Also, Guardians does not factor in the talent Demonic Consumption when casting Summon Demonic Tyrant.</div>\r\n<div>&nbsp;</div>\r\n<div>Hope this helps in any way and thanks so much for updating this!</div>\r\n<p><a rel=\"nofollow\">​</a></p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/meltra67566\">meltra67566</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1539\">#1539</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1539.html\">Raw</a>","closed":true,"closed_at":"2018-12-25T01:03:16Z","created_at":"2018-07-30T19:00:22Z","updated_at":"2018-12-25T01:03:16Z","labels":[]},"comments":[{"body":" <p>Wild imps have a duration of 24 seconds however they can only attack a maximum of 5 times before they despawn automatically, that's why it doesn't change based on combat status, they must be attacking the target to despawn quicker and that only happens when you yourself attacked something. I'm assuming this is where the discrepancy comes from, though I have no idea how he would fix it.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/MindxKiller\">MindxKiller</a>","created_at":"2018-08-02T10:38:56Z"},{"body":" <p>I'll fix it for Demonic Consumption. Not sure what to do about the duration thing. For all practical purposes, while in combat on a boss fight for example, you can assume the imps to last about 12 seconds (really it seems more like 10, though). I don't think its worth starting them at 24 seconds, counting out 5 casts, and then just removing them (because they would be getting removed at 12 seconds remaining).</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2018-08-04T21:51:53Z"},{"body":" <p>I've been looking some more at this and it looks like MindxKiller is correct. All imps (HoG, ID) either despawn after 24 seconds or after they fire 5 bolts, whichever comes first.&nbsp; And another thing is that the rate at which the imps are firing the bolts scales with haste.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>So yeah, the question is what to put on the timers...&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Power Siphon, Demonic Consumption and Implosion kind of makes you wish that you could track the time and number of imps as precisely as possible, but now I'm not really sure if I understand what Blizzard intended with this class, seeing as they removed their own icons that helped you track your summoned guardians in Legion.</p>\r\n<p>&nbsp;</p>\r\n<p>I don't really have any ideas except maybe an option to not remove imp icons unless the imps are actually gone. This way you can at least be safer using Power Siphon and Implosion as they are instant casts.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"08 5 2018 17:16:48 (CST) (UTC-5:00)\" data-epoch=\"1533507408\">Aug 5, 2018</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/meltra67566\">meltra67566</a>","created_at":"2018-08-05T22:14:09Z"}]}