{"issue":{"title":"[CF 1568] New Condition: Max Charges ","body":" <p>(or add an option to Spell Charges condition that you can set what the max charges for the checked spell are)</p>\r\n<p>&nbsp;</p>\r\n<p>Would be useful for if you want to create things like activation overlays when when a spell, that can be talented to have more than the default amount of uses.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>IE Overpower has 1 charge, but can be talented to have two. I have an activation overlay for when it has 1 charge, but if it ever has 2 charges when I talent it, I have to either make a long conditional string w/2 parenthesis separated by an 'or' between them, or make 2 icons entirely that track different amounts of spell charges.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p><a href=\"https://i.imgur.com/eEjwhSc.jpg\" rel=\"nofollow\">https://i.imgur.com/eEjwhSc.jpg</a></p>\r\n<p>&nbsp;</p>\r\n<p>Here is what I currently use to track it. It'd be more intuitive for players not as familiar with TMW to have a specific condition set out for max charges than to figure out something like I'm doing. I'm pretty sure any ability with multiple charges has that listed somewhere on the tooltip, either abilities with inherent multiple charges or those where you can talent to get multiple, so creating a condition where 'max charges' is a true/false logic shouldn't be too hard, I wouldn't imagine?</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Jalopyy\">Jalopyy</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1568\">#1568</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1568.html\">Raw</a>","closed":false,"created_at":"2018-08-31T06:49:26Z","updated_at":"2018-09-26T08:32:54Z","labels":["enhancement"]},"comments":[{"body":" <p>Honestly, I've kind of wanted this since Mists because of the Monk Momentum talent adding 1 charge to Roll, and I only wanted the icon to show when Roll was recharging, which of course changes based on number of charges.&nbsp; It was never a big enough deal because I rarely changed that talent row, so I just manually changed stacks required to show each time, but this may become relevant again when I play Paladin in BfA because there's a talent that adds 1 charge to Divine Steed, a very similarly-used ability.</p>\r\n<p>&nbsp;</p>\r\n<p>Anyway yeah, if it ever became too annoying, I was going to do exactly what you did there.&nbsp; That's probably why it's not really worth it to do this, but I agree with you it'd be nice for others.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Kosouda\">Kosouda</a>","created_at":"2018-09-12T18:45:41Z"},{"body":" <p>@Jaloppy - can't you just have the activation condition be \"cooldown == 0\"? If it's on max charges it's not on cooldown (that's what I am using for SotR for eg)</p>\r\n<p>&nbsp;</p>\r\n<p>@Kosouda - can't it be achieved with \"cooldown &gt; 0 &amp;&amp; charges == 0\"?&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Basically - max charges can be inferred from ability cooldown - if it's not recharging you're at max stacks, and when it's recharging you aren't. So any condition that relies on \"max stacks\" should also be able to be defined using the spell cooldown condition</p>\r\n<p>&nbsp;</p>\r\n<p>(I'm also looking into how difficult it is to infer this from LUA API, but I think both use cases can be simply solved without any new options (unless I'm misunderstanding the examples)</p>\r\n<p>&nbsp;</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/ariehg\">ariehg</a>","created_at":"2018-09-26T07:03:22Z"},{"body":" <p>That wouldn't work because I only want the notification I'm using to trigger when the charges are maxed - if I had 2 charges and 1 remaining, cooldown==0 would proc at both 1 and 2 charges remaining (pretty sure that's how it'd work, because I probably tried that at first).</p>\r\n<p>&nbsp;</p>\r\n<p>And I know HOW to make it work, that's what the example was for. The suggestion is for people less capable with TMW to have an easy option because they don't know enough to string multiple conditions together.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Jalopyy\">Jalopyy</a>","created_at":"2018-09-26T08:32:54Z"}]}