{"issue":{"title":"[CF 160] Groups hidden until group lock toggle ","body":" <p>This is Twisters daily ticket for you ;)</p><p>This time it's tricky for me find an exact way to reproduce the failure i'm experiencing. I have several TMW Groups, some of them only show in combat, and some anchored to these groups. I dont know whats exaclty happening, but some groups don't show uppon login, ui reloading or zone changing until i toggle the group lock once. After that, their working like they did in 4.0.0 Beta 9</p><p>I cant exactly tell you whats causing these groups not to show, as other groups with very similar settings doesn't show this issue.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Twister\">Twister</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/160\">#160</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/160.html\">Raw</a>","closed":true,"closed_at":"2011-04-12T22:22:53Z","created_at":"2011-04-12T17:56:49Z","updated_at":"2011-04-13T09:11:00Z","labels":["defect","resolved"]},"comments":[{"body":" <p>I think I know what is going on here. Do some of the groups that are anchored to other groups have a higher groupID than the group that they are anchored to? If so, this is why. When TellMeWhen first initiates everything after logging in or reloading your UI, groups are setup in the order of their IDs. If a group is set to be anchored to a group with a higher ID, that group will never appear because it is being anchored to a group that simply doesn't exist yet.</p>\r\n<p>I will separate the positioning code from the main setup code so that groups don't attempt to anchor themselves to groups that don't exist yet.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-04-12T22:04:03Z"},{"body":" <p>Yeah, that is what is happening. Fixed.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-04-12T22:22:46Z"},{"body":" <p>You're right. The 2 hidden groups were definded before the group they're anchored to. Tested release 4.0.2 and it fixed the issue. Thanks.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Twister\">Twister</a>","created_at":"2011-04-13T09:11:00Z"}]}