{"issue":{"title":"[CF 161] Improve ButtonFacade support ","body":" <p>I'm using a quite complex and awkward TMW configuration which is working fine so far, but horrible to setup or apply changes to it. I'm using different TMW Groups layered ontop of each other to be able to change their Buttonfacade color uppon certain conditions. Let me explain my setup by using some images:</p>\r\n<p>Example 1:<br>\r\n<img src=\"http://dl.dropbox.com/u/9474793/tmw_example5.jpg\" alt=\"http://dl.dropbox.com/u/9474793/tmw_example5.jpg\"><br>\r\n<a href=\"http://www.wowhead.com/spell=8092\" rel=\"nofollow\"><strong>Mindblast</strong></a> (Big Icon 1)<br>\r\n- CD ready,<br>\r\n- at least one Orb (Icon to the left)<br>\r\n- Empowered Shadows (icon below) not active currently<br></p>\r\n<div><p> <strong>Result: Green border on Mindblast. (cast asap)</strong></p>\r\n</div>\r\n<p><a href=\"http://www.wowhead.com/spell=87151\" rel=\"nofollow\"><strong>Archangel</strong></a> (Big Icon 2)<br>\r\n- CD ready, but not 5 stacks of Dark Evangelism (icon below)<br></p>\r\n<div><p> <strong>Result: Red border on Archangel (wait for green border)</strong></p>\r\n</div>\r\n<p>Example 2:<br>\r\n<img src=\"http://dl.dropbox.com/u/9474793/tmw_example3.jpg\" alt=\"http://dl.dropbox.com/u/9474793/tmw_example3.jpg\"><br>\r\n<a href=\"http://www.wowhead.com/spell=8092\" rel=\"nofollow\"><strong>Mindblast</strong></a> (Big Icon 1)<br>\r\n- on CD,<br>\r\n- no Shadow Orb (Icon to the left)<br>\r\n- Empowered Shadows (icon below) active and time remaining &gt; 6.5 sec (hidden in this case)<br></p>\r\n<div><p> <strong>Result: Gray border (Cast Mindblast without an Orb immediately after its CD finishes (2 second timeslot))</strong></p>\r\n</div>\r\n<p><a href=\"http://www.wowhead.com/spell=87151\" rel=\"nofollow\"><strong>Archangel</strong></a> (Big Icon 2)<br>\r\n- CD ready, and 5 stacks of Dark Evangelism (icon below (hidden when time remaining &gt; 5 and stacks = 5)<br></p>\r\n<div><p> <strong>Result: Green border on Archangel (cast asap)</strong></p>\r\n</div>\r\n<p>Example 3:<br>\r\n<img src=\"http://dl.dropbox.com/u/9474793/tmw_example2.jpg\" alt=\"http://dl.dropbox.com/u/9474793/tmw_example2.jpg\"><br>\r\n<em>Bad example: Haha, uppon writing i saw that i haven't tanken a correct screenshot, since another condition is causing MB border to be red<br>\r\nbut in my example it should be:<br>\r\n</em><br>\r\n<a href=\"http://www.wowhead.com/spell=8092\" rel=\"nofollow\"><strong>Mindblast</strong></a> (Big Icon 1)<br>\r\n- on CD,<br>\r\n- no Shadow Orb (Icon to the left)<br>\r\n- Empowered Shadows (icon below) active but running out in &lt; 6.5 sec (should be shown in the example)<br></p>\r\n<div><p> <strong>Result: Red border (Don't cast Mindbalst without an orb this time!)</strong></p>\r\n</div>\r\n<p>It would be nice to be able to configure ButtonFacade for each icon rather than each group. With this in mind, i don't know how Meta Icons are implemented, but they should inherit the ButtonFacade options defined on the icon they are currently showing.<br>\r\nWell, i guess this is not an easy change - nor ontop of your todo list, but i would love to see any improvements.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Twister\">Twister</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/161\">#161</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/161.html\">Raw</a>","closed":true,"closed_at":"2011-04-16T00:42:40Z","created_at":"2011-04-12T19:41:10Z","updated_at":"2011-04-16T00:42:40Z","labels":["enhancement","resolved"]},"comments":[{"body":" <p>I thought about this one for a while, and here is what I have decided.</p>\r\n<p>First of all, let me explain how meta icons work. When an icon is set to 'fake hidden', that icon's update function is no longer called automatically by the icon engine, but rather it is called by the meta icon/icon shown condition which is checking that icon, and only if needed. When an icon's update function is called, and it is determined that that icon should be shown, the meta icon takes all of the visual attributes that were set by that icon's update function, and sets those attributes on itself.\r\nAnother implementation of meta icons that I have considered, and this would make your request simpler, and make meta icons a great deal more efficient, is to quite literally move the icon to where the meta icon is. This creates a problem, however, when multiple meta icons are checking and displaying the same icon. This also makes it impossible for icons to be included in meta icons and still be shown in their original location (fake hidden disabled). I considered only moving the icon if it is completely safe to do so (it is fake hidden, and no other icons are checking it), but this would create some inconsistent behavior between different icons. This also removes the ability of meta icons to check other meta icons, since meta icons would become just an anchor point, instead of a fully functional icon like all the other icon types.</p>\r\n<p>Now, on to ButtonFacade. BF only allows you to skin things at the group level, not at the button level. While I could make each icon a BF group, this would flood the BF options pretty quickly and potentially confuse new users. I could also manually \"steal\" all of the skin info from an icon being replicated by a meta and apply that manually to the meta, but this would cause problems when 1) BF is updated, or 2) when using different skins on different groups that feed icons into the same meta icon. Now, since it seems that the border color is the only thing that you have different between each icon, I may just add an option for meta icons to inherit the border color and nothing else, since this shouldn't be something that will be broken by new versions of BF (although this is still a little bit \"hackey\")</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"04 14 2011 17:02:03 (CST) (UTC-5:00)\" data-epoch=\"1302818523\">Apr 14, 2011</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-04-14T22:00:32Z"},{"body":" <p>I see a potential change to meta icons in the way you mention beeing only an anchor point for icons will not only be an inconsistent behavior, it sounds even more awkward to handle than my current setup! <span>:D</span></p>\r\n<p>With Buttonface i would be perfectly fine if i could change the border color somehow! I haven't looked into it, but i'm using another addon that works with or without BF and applies color highlightings to my actionsbars unter certain (simple) conditions. The mod is named <a href=\"http://wow.curse.com/downloads/wow-addons/details/inline-aura.aspx\" rel=\"nofollow\">Inline Aura</a>.</p>\r\n<p>Another thing i would be thinking of is to use BF <em>\"State Colors\"</em> options by changing the button state. This could perhaps be an easy way to implement? Currently TMW seems only to use the normal button state, but BF has different color options for the following button states:<br></p>\r\n<ul><li>normal<br>\r\n</li><li>highlight<br>\r\n</li><li>checked<br>\r\n</li><li>flash<br>\r\n</li><li>pushed<br>\r\n</li><li>disabled<br></li></ul> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Twister\">Twister</a>","created_at":"2011-04-14T22:57:37Z"},{"body":" <p>TMW uses the highlight state as well, and also will used the pushed state the next revision. Disabled is unused by almost every LBF skin out there, normal is the state that you already use, checked is unused - TMW icons are not check buttons. Flash is used for the small flash at the end of a cooldown on blizzard action bars - I currently don't have plans to implement this into TMW.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-04-15T02:10:01Z"}]}