{"issue":{"title":"[CF 1610] \"Totem\" tracking ","body":" <p>Hi, as a MW Monk i use Jade Serpent Statue, and i would like to track the passive Soothing Mist's duration from my statue. However i could not figure out a way to do that as the statue is considered a totem, and i cannot choose such a thing from \"who to track\". Am i overlooking something? If not, it would be a nice and welcome addition to this already great addon. Thanks.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/taktzeit\">taktzeit</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1610\">#1610</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1610.html\">Raw</a>","closed":true,"closed_at":"2018-12-25T00:56:39Z","created_at":"2018-11-07T08:03:41Z","updated_at":"2018-12-25T00:56:39Z","labels":[]},"comments":[{"body":" <p>You cannot do this from the basic TMW interface (afaik) since the uid of the totem is dynamic. You will need to use LUA to see when the totem is summoned and then use the uid to track the spell cast start event for that target.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>This is very similar for what I'm currently doing in my Dave tracker (though that one tracks Dave's health). You can find some information about it <a href=\"https://wow.curseforge.com/projects/tellmewhen_script_tools\" rel=\"nofollow\">here</a> (though it does require the linked addon to work).</p>\r\n<p>&nbsp;</p>\r\n<p>Alternatively, you can try and use the \"combat_log_event\" icon type, and track \"Events to Check &gt; Casts &gt; Spell Cast Success\" and put \"Soothing Mist\" in \"What to track\" (and player in \"source unit\". This will let you init a timer for soothing mist, and since your statue starts soothing when you do, you can use that as the timer initiator.&nbsp;</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/ariehg\">ariehg</a>","created_at":"2018-11-11T19:47:00Z"}]}