{"issue":{"title":"[CF 162] min/max duration behavior on aura-type buffs or debuffs ","body":" <p>I've tried to make some minor changes to my raidbuffs tracked by TMW. (God, i love meta icons!)<br>\r\nTherefore i wanted to add an aura that shows ie. <em>Bonus Stamina</em> if its about to drop in less than 10 minutes. Therefore setup my aura like this:<img src=\"http://dl.dropbox.com/u/9474793/tmw_stamina.jpg\" alt=\"http://dl.dropbox.com/u/9474793/tmw_stamina.jpg\"></p>\r\n<p>If i'm buffed with <a href=\"http://www.wowhead.com/spell=79105\" rel=\"nofollow\">Power Word: Fortitude</a> this works like intended: hidden if duration &gt; 10min, else shown.<br>\r\nBut if i'm buffed with <a href=\"http://www.wowhead.com/spell=6307\" rel=\"nofollow\">Blood Pact</a> this is allways shown. Tried to add a setting of Minimum to 1, but this doesn't change anything. I would have expected an different behavior for auratype buffs/debuffs.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Twister\">Twister</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/162\">#162</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/162.html\">Raw</a>","closed":true,"closed_at":"2011-04-16T00:41:54Z","created_at":"2011-04-12T20:52:13Z","updated_at":"2011-04-16T00:41:54Z","labels":["declined"]},"comments":[{"body":" <p>Blood pact does not have a duration, so duration settings will never affect it. If you just want to see if fort is about to drop, then just have \"Power Word: Fortitude\" as the name, instead of tracking all health buffs.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-04-12T21:47:53Z"},{"body":" <p>That's what i meant with aura-type buffs: Buffs that don't have a duration. Sure, i can split each Raidbuff group in buffs with or / without duration, but like i said i expected an different behavior by setting min or max duration for buffs that dont have a duration. (So i won't have to split em)</p>\r\n<p>Lets have a look how min / max duration are used with buffs that have a duration:</p>\r\n<ol><li>If you set min duration, you want the Icon to be shown until the duration falls below a certain treshhold.\r\n</li><li>If you set max duration, you want the Icon to be hidden until the duration falls below a certain treshhold.\r\n</li><li>If you set both, you want the icon only the be shown if it's duration is lying in between both values.\r\n</li></ol>\r\n<p>And now what i expected from durationless buffs:</p>\r\n<ol><li>If you set min duration, i expected the Icon to be shown since its duration can't fall below the defined treshhold\r\n</li><li>If you set max duration, i expected the Icon to be hidden since its duration can't fall below the defined treshhold\r\n</li><li>The 3rd case however wasn't so obvious for me. <del>My 1st guess was that the Icon should be shown, since it's duration will never leave the defined sweet spot.</del> But now i think that it should be hidden since it's duration can't fall below the defined min value (thus should be shown) but also exceeds every defined max value since it's duration is infinite (and thus should be hidden) <del>It just never hits the sweet spot in which it should be shown.-</del></li></ol> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Twister\">Twister</a>","created_at":"2011-04-13T09:01:28Z"},{"body":" <p>The way that I would think of it is this:</p>\r\n<ol><li>If you set min duration, you want the Icon to be shown while the duration is above a certain threshold.\r\n</li><li>If you set max duration, you want the Icon to be shown while the duration is below a certain threshold.\r\n</li><li>If you set both, you want the icon only the be shown if it's duration is lying in between both values.\r\n</li></ol>\r\n<p>I suppose a better way to explain this would be to look at the (slightly modified) code itself:</p>\r\n<div><div><div>\n\n```\nlocal d = expirationTime - time -- d is the time, in seconds, until the buff expires\r\n--\"expirationTime\" is a number that is comparable to \"time\", which both are based on the amount of time that your computer has been on, and gives the value of \"time\" at which the buff will expire. Buffs with an undefined duration (infinite duration) give expirationTime a value of zero.\r\nif expirationTime ~= 0 then -- this is currently why duration settings do not affect buffs with infinite duration: it simply does not even check them.\r\n\tif (icon.DurationMinEnabled and icon.DurationMin &gt; d) or (icon.DurationMaxEnabled and d &gt; icon.DurationMax) then\r\n\t\ticon:SetAlpha(0)\r\n\tend\r\nend\r\n\n```\n</div></div>\r\n</div><p>Now, there are two ways I could go about doing this. Either I remove the check to make sure that expirationTime isn't equal to zero, and so the duration will end up being a large negative number, or I could make the duration be zero if expirationTime is zero. Logic says pick option 2. Actually, now that I think about it, the only reason that that check to see if expirationTime isn't equal to zero is even there is because duration settings used to always be on - there was no checkbox to enable/disable them.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-04-13T21:51:35Z"},{"body":" <p>r42 has this change. Let me know if it does what you want.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-04-13T23:03:43Z"},{"body":" <p><em>1 new comment was made while you were working on your own. You can submit again if you're still satisfied.\r\n</em></p>\r\n<ul><li>argh* - was writing a response to this <span>:D</span>\r\nGuess it will do it, but due to the wrong reason. I'll going to check now...\r\n</li></ul> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Twister\">Twister</a>","created_at":"2011-04-13T23:06:34Z"},{"body":" <p>I broke some things in r42. r43 fixed them.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-04-13T23:28:12Z"},{"body":" <p>Tested r42:\r\nOk - my guess was correct <span>:D</span> I could do the job now: not by setting a max duration, but rather (also) setting a min duration. However, this seems not logical to me.</p>\r\n<p>Lets go back: I dont think that your case 1, 2 and 3 are different form mine, just another way to say the same.</p>\r\n<p>But I think that we should differ technical \"expirationTime\" and human logical \"expirationTime\": From the technical point of view, buffs with an undefined duration (infinite duration) give expirationTime a value of zero.\r\nBut from the human, or mathematical point of view, an infinite duration should be the highest number you could ever image. Well - this is not very scientifically expressed, but i think you get the point.</p>\r\n<p>Seeing your comment - i'll test r43 first and write more soon</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"04 13 2011 18:32:16 (CST) (UTC-5:00)\" data-epoch=\"1302737536\">Apr 13, 2011</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Twister\">Twister</a>","created_at":"2011-04-13T23:31:29Z"},{"body":" <p>This was a fast one - r43 showed the same behavior as r42. Maybe i wasn't running into the the things you broke with r42?</p>\r\n<p>Lets have a look at the sourcecode. If you just killed the filtering IF-Condition, then there are two cases in which icons could be hidden:</p>\r\n<ol><li>icon.DurationMin &gt; d (matches case 1)<br>\r\n</li><li>d &gt; icon.DurationMax (matches case 2)\r\n</li></ol>\r\n<p>Since d is zero for buffs with infinite duration, case 1 is true while case 2 is false. But from the the human, or mathematical point of view i case 1 should be false and case 2 should be true.</p>\r\n<p>I guess that this would do the trick<br></p>\r\n<div><div><div>\n\n```\nlocal d = expirationTime - time -- d is the time, in seconds, until the buff expires\r\n--\"expirationTime\" is a number that is comparable to \"time\", which both are based on the amount of time that your computer has been on, and gives the value of \"time\" at which the buff will expire. Buffs with an undefined duration (infinite duration) give expirationTime a value of zero.\r\nif (icon.DurationMinEnabled and d and icon.DurationMin &gt; d) or \r\n  (icon.DurationMaxEnabled and d &gt; icon.DurationMax) or\r\n  (icon.DurationMaxEnabled and not d) then\r\n\t\ticon:SetAlpha(0)\r\nend\r\n\n```\n</div></div>\r\n</div><p>I'm goining to bed now. Read you tomorrow <span>;)</span></p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"04 13 2011 19:00:16 (CST) (UTC-5:00)\" data-epoch=\"1302739216\">Apr 13, 2011</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Twister\">Twister</a>","created_at":"2011-04-13T23:53:22Z"},{"body":" <p>Typing 999999999999999999999999999999999999999999999999 into the editbox isn't very elegant.</p>\r\n<p>I'm still not sure what the point of this whole thing is anyway. Do you just want a warning when fort has less than 10 minutes so you can be reminded to rebuff it? (Or yell at someone else to rebuff if you aren't a priest) If you don't want blood pact to show, then exclude it from the list of spells to check. If this whole issue is really a \"what if...\" issue, then I'm not going to put much more into it, because it is a \"what if...\" that I don't really see ever happening. Only one of the bonus stamina spells can be active at a time, so if you don't want to check for blood pact, then don't include it.</p>\r\n<p>r43 just fixed some things with meta icons and icon shown conditions that I broke.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-04-14T00:03:23Z"},{"body":" <blockquote><cite>Quote from Cybeloras:</cite><p>If this whole issue is really a \"what if...\" issue, then I'm not going to put much more into it, because it is a \"what if...\" that I don't really see ever happening.</p>\r\n</blockquote><p>\r\nThis is why i haven't chosen the chategory \"defect\" or \"enhancement\" for the ticket. Its more a question what do you think a player is expecting by setting a min- or max duration filter for auras that last until canceled. There could be many answers to this question, i.e.<em> \"min &amp; max durations should have no impact on auras that last until canceled\"</em> This one would be the answer to the behavoir before r43.</p>\r\n<p>I'm also getting your point: \"Players should not use min- / max duration on this type of auras.\" It's also something which i could accept right away if your not willing to make changes on.</p>\r\n<p>All i was trying to express is that i would have expected a different behavior for buffs that last until canceled form the min and max settings. Let me comment on this quote:\r\n</p><blockquote><cite>Quote from Cybeloras:</cite><p>The way that I would think of it is this:\r\n1. If you set min duration, you want the Icon to be shown while the duration is above a certain threshold.</p>\r\n</blockquote><p>\r\nThe value a player enters in min or max settings is allways thought of as seconds. So, if i enter 60 as the min duration, i expect the icon to be shown when the buff will still be active in one minute. But with r43, auras that lasts until canceled will be hidden when the min option is activated. And the second case is quite similar: </p><blockquote><cite>Quote from Cybeloras:</cite><p>2. If you set max duration, you want the Icon to be shown while the duration is below a certain threshold.</p>\r\n</blockquote><p>If i enter 120 as max duration, i expect the icon to be shown when it's remaining time will be less than 2 minutes. However - an aura that lasts until canceled will still be active in 5 minutes, 10 minutes, or X minutes but with r43 it is allways shown when the max option is enabled.</p>\r\n<p>If you change your If condition block in Types/buffs.lua at line 155ff to the following this will be corrected.</p>\r\n<div><div><div>\n\n```\nif icon.DurationEnabled then\r\n\tlocal d = expirationTime == 0 and 0 or expirationTime - time\r\n\tif (icon.DurationMinEnabled and d ~= 0 and icon.DurationMin &gt; d) or\r\n\t   (icon.DurationMaxEnabled and d ~= 0 and d &gt; icon.DurationMax) or\r\n\t   (icon.DurationMaxEnabled and d == 0) then\r\n\t\ticon:SetAlpha(0)\r\n\t\treturn\r\n\tend\r\nend\r\n\n```\n</div></div>\r\n</div> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Twister\">Twister</a>","created_at":"2011-04-14T22:14:56Z"}]}