{"issue":{"title":"[CF 1645] Correct loading between snippets and icons ","body":" <p>I know TMW uses&nbsp;TMW_INITIALIZE callback to load both - snippets and icons. However in most cases icons loading earlier when you use low global refresh rate or snippet is not first que. So my issue is prettry simply, I have functions inside snippet which uses&nbsp;immediately after your enter in the world and TMW return me debug errors&nbsp; with them, I see with help by errors and understand that they won't load&nbsp;proportionally. I think need in any case load snippets and only after that start do anything with icons at TMW initialize, it will prevent issues and errors.&nbsp;I hope my problem will help improve TellMeWhen :)</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/cordankos\">cordankos</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/1645\">#1645</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/1645.html\">Raw</a>","closed":true,"closed_at":"2019-01-18T02:30:32Z","created_at":"2019-01-13T05:25:52Z","updated_at":"2019-01-18T02:30:32Z","labels":["enhancement"]},"comments":[{"body":" <p>I cant see any case where icons would ever be created before all startup snippets have ran. Some specific examples of the issues you're encountering would be helpful.</p>\r\n<p>&nbsp;</p>\r\n<p>Add this to a snippet that runs on startup - you'll see that both numbers print as zero, meaning that no groups exist at that time:</p>\r\n<p>&nbsp;</p>\r\n<p>print(\"STARTUP!\", #TMW.global, #TMW.profile)</p>\r\n<p>&nbsp;</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2019-01-17T02:54:01Z"},{"body":" <p>Something has been changed after enter in the world, now its loading longer than&nbsp;previous build. Before same issues was only on arena and bg, but not outside. Thanks for print thing,&nbsp;it helped to find a place of error. I checked - no issues with snippets, they loading properly, its my mistake :)</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/cordankos\">cordankos</a>","created_at":"2019-01-17T20:58:33Z"},{"body":" <p>The staggered loading at login was to fix \"script ran too long\" errors that some people we getting when logging in. You're correct that this behavior used to only be present when loading into arenas and battlegrounds, but it had to be expanded to the first load when logging in as well.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2019-01-18T02:30:32Z"}]}