{"issue":{"title":"[CF 178] Sort debuffs by time ","body":" <p>Could you please enable sorting by time for different debuffs tracked with the same icon. i use tellmewhen for debufftracking of important crowdcontrolls etc. on my toon. i have put all those different debuffs with different durations (polymorph, cyclone, stuns, disarms etc.) in one icon. it would be great if those debuffs could be sorted by time (longest lasting debuff active on me allways on top showing up).</p><p>thank you very much, i promise to never say \"plx\" again :)</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Rhyn23\">Rhyn23</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/178\">#178</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/178.html\">Raw</a>","closed":true,"closed_at":"2011-05-01T10:03:50Z","created_at":"2011-04-24T10:14:43Z","updated_at":"2011-05-01T10:03:50Z","labels":["enhancement","resolved"]},"comments":[{"body":" <p>I think it would be more elegant if meta icons would just allow their subicons to be arranged by time remaining (descending and ascending), rather than a fixed order. Then simply add all the desired debuffs as subicons with the condition \"only show when present\" and let the meta icon sort them by time remaining. This could then also be used in order to create a single meta icon tracking the shortest remaining cooldown from a list.</p>\r\n<p>On a related note: could you also give meta icons the function \"fake hidden\"?</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/AmeroGer\">AmeroGer</a>","created_at":"2011-04-30T17:56:51Z"},{"body":" <p>Another thought that just occured to me was, if meta icons were sortable by time remaining, you could also use submetas that were sorted by a priority list to get kind of a parenthesis effect.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/AmeroGer\">AmeroGer</a>","created_at":"2011-04-30T18:08:19Z"}]}