{"issue":{"title":"[CF 194] Request: Predefined Icon Textures ","body":" <p>May I suggest the following feature? I'd really like icons to be able to use predefined icon textures as opposed to trying to look for some ability on the actionbars. For example I use TellMeWhen to track enemy cooldowns in the arena. But whenever I leave the arena TellMeWhen will \"forget\" what textures those enemy cooldowns were using, so the next time I enter the arena I have to wait until an enemy uses the cooldown again before I get the proper texture back.</p><p>Regards,<br>Qwop</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/AmeroGer\">AmeroGer</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/194\">#194</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/194.html\">Raw</a>","closed":true,"closed_at":"2011-05-23T00:28:46Z","created_at":"2011-05-11T19:58:37Z","updated_at":"2011-05-23T00:28:46Z","labels":["enhancement","resolved"]},"comments":[{"body":" <p>Using the spellIDs instead of the spell names will ensure that the proper texture is always displayed</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-05-11T21:47:50Z"},{"body":" <p>Well that solves this one particular problem, however it still falls short in some other instances. </p>\r\n<p>Examples:</p>\r\n<p>1. I have a Thirst for Blood proc coming up (internal cooldown) and want TellMeWhen to display the Overpower texture.</p>\r\n<p>2. An enemy mage has Deepfreeze off cooldown and I'd like TellMeWhen to display the Spell Reflection texture.</p>\r\n<p>Both isues coul be alternatively mended via a condition icon if unit cooldown and internal cooldown were checkable as conditions.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/AmeroGer\">AmeroGer</a>","created_at":"2011-05-12T16:11:38Z"},{"body":" <p>This could be done with an \"Icon shown\" condition</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-05-12T21:37:06Z"},{"body":" <p>I had honestly overlooked that feature before. I am going to have to review my icons now. I'm pretty sure this is going to come in handy somewhere. So thanks for the tip.</p>\r\n<p>However the one thing that still bugs me is the fact that I can't see the time remaining spiral on my condition icon. I can only check wether the other icon I'm checking is active or not, not how long it will presumably remain active. The result: since I consolidate both my overpower proc and my taste for blood internal cooldown into the same meta I can no longer tell the difference between the two, which I hoped I could've done with the omnicc cd spiral on taste for blood.</p>\r\n<p>This may seem like a trivial complaint but I have similar issue elsewhere. I try to use TellMeWhen with my restoration druid in the arena to track mage counterspells. The optimal icon I'm looking for is one that displays the shortest remaining cooldown on any counterspell, provided that all counterspells of any mage are on cooldown. Using the \"icon shown\" condition almost gets me there, but I still can't tell how long the shortest counterspell will remain on cooldown. Do you have any suggestions?</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/AmeroGer\">AmeroGer</a>","created_at":"2011-05-16T15:28:41Z"},{"body":" <p>Condition icons are intended to be simple displays for simple things. If you want to show the cooldown spiral, you will need to use another icon type. What you could do to distinguish between the two is set the alpha of one of them to a level lower than the other. (They have the same icon, correct? The ICD is triggered by the TfB buff being applied to you, and that same buff allows the use of overpower, correct me if I'm wrong)</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-05-16T22:01:24Z"},{"body":" <p>TfB is trivial, I can get the result I want except with the TfB texture rather than the OP texture, which is only a minor imperfection. The bigger issue is how to track the shortest remaining Counterspell/Spell Lock/Wind Shear cooldown in an arena, so I know how much longer I can disregard fakecasting.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/AmeroGer\">AmeroGer</a>","created_at":"2011-05-21T09:15:26Z"}]}