{"issue":{"title":"[CF 205] Announcements+ ","body":" <p>Announcements can add new short name for currently shown icon's SpellName/Duration, It's looks like %t for you target.</p>\r\n<p>Here are some examples.<br>\r\n$s for SpellName <br>\r\n$d for Cooldown/Duration remaining</p>\r\n<p>examples 1: $s cooldown is finish.(On Finish)<br>\r\nexamples 2: $s start, finish in $d seconds.(On Start)</p>\r\n<p>This will make announcements perfect.</p>\r\n<p>Sorry for my bad english! T.T</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/lsjyzjl\">lsjyzjl</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/205\">#205</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/205.html\">Raw</a>","closed":true,"closed_at":"2011-05-21T04:53:07Z","created_at":"2011-05-19T09:48:42Z","updated_at":"2011-05-21T04:53:07Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>I thought about implementing this, but it would turn out really weird. Because of the diversity of icon types, some of them have names, some of them do not, and most accept spellIDs that must be turned into a name, but some are itemIDs or item names, and some are names that are already difficult to obtain (I'm looking at you, weapon enchant icons). For almost all icon types, the data about the name isn't available anymore once an icons finishes/hides. This begs the question, should icons using multiple spells/items that finish use the first spell/item in the list? Or should they use the last seen spell/item? If the answer to the second question is yes (and it must be for announcements like \"%s faded on %t!\" to function as expected), then the last value for the name must be cached so that an icon can get the name even after the data is no longer available with Blizzard's API.</p>\r\n<p>Duration is much simpler to implement, but there are still a few weird cases. The first is with update throttling. An icon that monitors a 15 second cooldown might not update until the duration left on the cooldown is 14.7 seconds. Duration values are also almost always an ugly number, like 14.7100003345, so they will need to be rounded (although this is not hard at all). Buffs/debuffs with infinite duration also have to be handled as a special case, as currently, the duration \"formula\" returns a large negative number for infinite durations.</p>\r\n<p>The final issue is one of practicality. If you have an icon that monitors multiple things, is it really useful to have announcements about when the icon state changes? I understand things like Bane of agony/doom/havoc, but you could just have the announcement say \"Bane fell off!\".\r\nIcons that monitory many, unrelated things probably shouldn't be announcing anything anyway. And most of the time, things have fixed durations, which means that they can just be typed in manually.</p>\r\n<p>Let me know if some of this doesn't make sense because I was doing other things while I was writing this.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-05-19T23:59:29Z"},{"body":" <p> It seems too complicated, forget it. Orz</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/lsjyzjl\">lsjyzjl</a>","created_at":"2011-05-20T00:27:49Z"}]}