{"issue":{"title":"[CF 216] Import from PowerAuras ","body":" <p>Thanks for a really great addon.</p><p>PowerAuras seem to have a large base of ready made exports for various classes abilities and procs.<br>See here: <a href=\"http://powerauras.wikispaces.com/EXPORTS\" rel=\"nofollow\">http://powerauras.wikispaces.com/EXPORTS</a></p><p>Having the ability to import POWA exports (even partially) into TMW will be great, it will make moving from POWA to TMW much easier for new users, and create a very large base of ready-made configuration instantly available for TMW users.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/feiloose\">feiloose</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/216\">#216</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/216.html\">Raw</a>","closed":true,"closed_at":"2011-06-04T20:04:19Z","created_at":"2011-05-31T11:06:40Z","updated_at":"2011-06-04T20:04:19Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>In fact if Tmw was able to display the kind of textures Powa Auras can aswell as do some animations, there would be no reason left to keep PA installed at all. One step closer to world domination!</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/AmeroGer\">AmeroGer</a>","created_at":"2011-05-31T14:49:26Z"},{"body":" <p>This is certainly something that I would consider doing (and something that I had never thought of before).</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-05-31T21:33:08Z"},{"body":" <p><cite>@<a href=\"https://github.com/tmw-issue-import/TellMeWhen/issues?q=%5BCF%20216%5D+in%3Atitle\" rel=\"nofollow\">AmeroGer</a>: <a href=\"https://github.com/tmw-issue-import/TellMeWhen/issues?q=%5BCF%20216%5D+in%3Atitle\" rel=\"nofollow\">Go</a></cite></p>\r\n<p>I am hesitant to do this, as one of the key features of TMW is that it isn't Power Auras. Not trying to take a shot at Power Auras here - I used it for a long time back in WotLK and it helped me a ton - but TMW and Power Auras are two different addons that display their information in two different ways. Even from the very first version, TMW's philosophy has been this (From <a href=\"http://wow.curseforge.com/addons/tellmewhen/pages/main/r1/\" rel=\"nofollow\">the original description of the addon</a>): \"TellMeWhen provides a flexible system of icons for displaying vital information ... always in a consistent place on your screen.\" TMW aims to be a grid of information (displayed with Blizzard's textures), while Power Auras is more of a collage of information (Displayed with custom textures). Both have their strengths and weaknesses, but in the end, they are different.</p>\r\n<p>The reason that I went off on that tangent is this: I'm not sure if animations and abstract (or just non-square) would fit into TMW at all. Animations might, but then icons would end up overlapping at times and would require users to hassle with icons spacing within a group to get things right. Power Auras can have animations because when its textures overlap, it doesn't look to bad - mostly because many of them are intended to be placed around the middle of the screen, encircling the player within them. A bunch of overlapping and growing and shrinking squares won't look very good at all - especially when it must be determined what icons shows on top of the ones around it and which ones should show underneath it when/if they overlap.</p>\r\n<p>TL;DR: TMW and POWA are different. I would like to keep it that way.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-05-31T21:47:18Z"},{"body":" <p>I imagine that it'd be a load of work, still I'd love to explore some of the possibilities as a user. If it ends up looking weird I can just go back to where I came from, right?</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/AmeroGer\">AmeroGer</a>","created_at":"2011-06-02T17:43:10Z"},{"body":" <p>I think I gave myself clinical depression after looking at PowerAuras' code for about 5 minutes.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"06 4 2011 15:04:06 (CST) (UTC-5:00)\" data-epoch=\"1307217846\">Jun 4, 2011</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-06-04T20:04:06Z"}]}