{"issue":{"title":"[CF 239] Blood in the Water - rip refresh couter icon type ","body":" <p>&lt;snip&gt;<br>The first and less important of the 2 is that im trying to monitor the number of extensions i have made to rip wen using the shred glyph, each shred extends the duration by 2 secs up to a total of 6 secs. I was wondering if it is possible to do this similar to how lifebloom works, by showing the timer in the centre with the number of extensions in the bottom corner.<br>&lt;snip&gt;</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/tomthumb112\">tomthumb112</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/239\">#239</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/239.html\">Raw</a>","closed":true,"closed_at":"2011-08-11T21:20:58Z","created_at":"2011-06-28T11:05:37Z","updated_at":"2011-08-11T21:20:58Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>This first one isnt currently possible, although i could add something like this in the future maybe.</p>\r\n<p>The second one should be pretty easy - make a cooldown icon for FB. and add conditions for 25% health and debuff rip present on target</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-06-28T18:41:11Z"},{"body":" <p>Thanks for the reply, good to know that it wasnt just me doing something wrong with the first one.\r\nAs for the second had previously tried using the cooldown FB with conditions for health, this works fine. But i cannot find a condition for debuff present. There is only the option to make conditions for Debuff - Stack , Debuff - Duration and Debuff number of. There is no option for simply Debuff present.\r\nI tried with the previous 3 debuff options and none of them worked.\r\nI would experiment more but its quite hard to find something to happily sit at &gt;25% for me to do so</p>\r\n<p>Edit : Think i have it working, used debuff - duration and set to greater than or equal to as low as i could and it appears to be working.\r\nThanks for pointing me in the right direction although having just a simple \"Debuff Present\" option might be nice too ( providing it isn't already there and i missed it)</p>\r\n<p>Also in relation to the rip extensions, this would be amazing if you could somehow work this in. Its not overly hard to remember myself how many times of shred but there is times i forget <span>:)</span></p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"06 28 2011 14:09:41 (CST) (UTC-5:00)\" data-epoch=\"1309288181\">Jun 28, 2011</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/tomthumb112\">tomthumb112</a>","created_at":"2011-06-28T18:57:32Z"},{"body":" <p>The debuff duration and debuff stacks are the debuff present conditions. If the time is greater than 0:00, then it must be present. If the stacks are greater than 0, it must be present.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-06-29T00:14:06Z"},{"body":" <p>I honestly don't feel like making this. There isn't going to be enough usage, it is something that can be easily tracked in your head, I don't have enough gold on my old server to respec my druid to feral to develop this, and it is going to be difficult to distinguish between an auto refresh and a manual refresh. And I'm tired.</p>\r\n<p>I'll leave it here, though, because I will probably get bored sometime and get the urge to implement it. Just not any time soon.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"07 4 2011 01:39:06 (CST) (UTC-5:00)\" data-epoch=\"1309761546\">Jul 4, 2011</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-07-04T06:37:24Z"},{"body":" <p>Now that the PTR is up, I had the time to test this. It turns out that neither the refresh from GoS nor BitW shows an event in the combat log, so there isn't really a way to track this.</p>\r\n<p>Sorry for the disappointment and the wait.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-08-11T21:20:47Z"}]}