{"issue":{"title":"[CF 256] Unable to get shadow protection to act as a buff ","body":" <p>IMPORTANT: If your issue is only occurring with a specific icon, include an export string of the icon in this ticket. You can generate an export string by clicking the arrow next to the editbox at the bottom of the icon editor, and then select the \"export to string\" option.</p><p>If you are experiencing Lua errors that seem to be affecting many icons or are unrelated to icons, attaching a saved variables file (or screenshot if applicable) will increase the likelihood of your problem being solved. Saved variables can be found in: \"World of Warcraft/WTF/Account/&lt;Account Name&gt;/SavedVariables/TellMeWhen. lua\"</p><p>What steps will reproduce the problem?<br>1.<br>2.<br>3.</p><p>What do you expect to happen? What happens instead?<br>when I drag shadow protection into a box and set as buff, only appear when not present, it ought to disappear when buff is on and appear when buff wears off.&nbsp; Instead it always stays on</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>4.4.3</p><p>Do you have an error log of what happened?</p><p>no<br>Please provide any additional information below (including the export string of the icon if applicable; see above.</p><p>^1^T^SOnlyMine^B ^SType^Sbuff ^SShowWhen^Sunalpha ^SName^S27683 ^SEnabled^B ^t^N44312^^</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/leeav3\">leeav3</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/256\">#256</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/256.html\">Raw</a>","closed":true,"closed_at":"2011-07-10T01:43:10Z","created_at":"2011-07-08T14:30:59Z","updated_at":"2011-07-10T01:43:10Z","labels":["defect","invalid"]},"comments":[{"body":" <p>You are using the wrong spellID. In this case, I would just use the actual spell name instead of the ID, because there are 2 different spellIDs that have valid buffs (79106, 79107)</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-07-08T17:25:53Z"},{"body":" <p>That did it. I typed Shadow Protection and about 9 entries showed up. I just used what was default and it worked. Thanks for the help.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/leeav3\">leeav3</a>","created_at":"2011-07-09T10:39:28Z"}]}