{"issue":{"title":"[CF 260] Count down instead of clock animation? ","body":" <p>IMPORTANT: If your issue is only occurring with a specific icon, include an export string of the icon in this ticket. You can generate an export string by clicking the arrow next to the editbox at the bottom of the icon editor, and then select the \"export to string\" option.</p><p>If you are experiencing Lua errors that seem to be affecting many icons or are unrelated to icons, attaching a saved variables file (or screenshot if applicable) will increase the likelihood of your problem being solved. Saved variables can be found in: \"World of Warcraft/WTF/Account/&lt;Account Name&gt;/SavedVariables/TellMeWhen. lua\"</p><p>What steps will reproduce the problem?<br>1. Create a Cooldown for a spell/ability<br>2. Put on Clock Timer (or what it's called) and no Time Bar. Show when not usable.<br>3. Create a condition where spell/ability is \"NOT EQUAL TO USABLE\" and is only watching your own spell.</p><p>What do you expect to happen? What happens instead?<br>It does pretty much what it should, though I thought it would always show a count down in numbers (intergers) like&nbsp; 3, 2, 1.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>4.4.6</p><p>Do you have an error log of what happened?<br>No I haven't</p><p>Please provide any additional information below (including the export string of the icon if applicable; see above.<br>I do not have OmniCC but I do have ButtonFacade.<br>I haven't tried all the different possibilities there are. If this already do work, then I'm really sorry to have bothered you!<br>One last thing.... BRILLIANT FU..... WORK!!! This is the only addon I have ever seen in my 7 years of WoW, that actually have a helping tooltip for everything. I was able to create something rather fast because of it. Sorry had to say that:D</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/magicsimon\">magicsimon</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/260\">#260</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/260.html\">Raw</a>","closed":true,"closed_at":"2011-07-24T09:23:53Z","created_at":"2011-07-17T14:51:57Z","updated_at":"2011-07-24T09:23:53Z","labels":["invalid"]},"comments":[{"body":" <p>\"I do not have OmniCC\"</p>\r\n<p>Problem found. OmniCC is required to display the numeric cooldown count on icons.</p>\r\n<p>Also, it is pointless to add a condition checking the cooldown of a spell to a cooldown icon that is checking the same spell. Not sure if this is what you are doing, but from your description, it sounds like it.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"07 17 2011 18:35:26 (CST) (UTC-5:00)\" data-epoch=\"1310945726\">Jul 17, 2011</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-07-17T18:40:20Z"}]}