{"issue":{"title":"[CF 262] Feature request - Mana condition as absolute value ","body":" <p>Hello! I am absolutely in love with this add-on. It's definitely miles ahead of any of its \"competitors\". There's just one thing that I'd like to request. When setting up Mana as a condition, there's only the option to select a percentage of maximum mana as a condition. With all of the temporary intellect-boosting procs that exist in the game these days, using percentage of maximum mana as a condition just isn't as useful as it used to be, as maximum mana is constantly fluctuating. Could you please implement an additional feature that would allow selecting an absolute value of mana as a condition instead of being restricted to a percentage value?</p><p>I'm guessing that this can probably be accomplished with an LUA condition in the add-on's current state, but I'm having trouble figuring out the LUA code to pull this off. I'd like to set up a condition that says \"current mana is less than or equal to absolute-value-X.\" Can you maybe suggest a way for me to do this in the current version of the add-on? I'd totally appreciate it. Thank you very much! :)</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Raymeo\">Raymeo</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/262\">#262</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/262.html\">Raw</a>","closed":true,"closed_at":"2011-07-24T09:24:10Z","created_at":"2011-07-18T21:19:32Z","updated_at":"2011-07-24T09:24:10Z","labels":["enhancement","resolved"]},"comments":[{"body":" <p>The following should work as a Lua condition:</p>\r\n<p>UnitPower(\"player\", 0) &lt;= 12345</p>\r\n<p>Just replace 12345 with whatever value you want.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-07-18T22:12:38Z"}]}