{"issue":{"title":"[CF 282] Unreliable Tricks of the Trade cooldown tracking ","body":" <h2>What steps will reproduce the problem?</h2>\r\n<p>Simply using tricks of the trade occasionaly fails.</p>\r\n<h2>What do you expect to happen? What happens instead?</h2>\r\n<p>It occasionally (but quite consistently) fails to show the cooldown, instead telling me that it's not on cooldown.\r\nThis seems to mostly happen in raids. It might not fail every single fight, but it will fail to show the cooldown multiple times during the raid.</p>\r\n<h2>What version of TellMeWhen are you using? (\"The latest\" is not a version)</h2>\r\n<p>I'm currently using 4.5.2, but it has been like this for a long time now, and I didn't see any changes in the 4.5.3 changelog that might've potentiallty fixed the issue. I will update to 4.5.3 and try it next raid.</p>\r\n<h2>Please provide any additional information below (including the export string of the icon if applicable; see above.</h2>\r\n<p>I've tried to see if there's something specific that I'm doing that breaks it, but I haven't noticed anything.</p>\r\n<p>Just tried attacking a target dummy for 15mins or so while chain-tricking a single party member but I couldn't get it to break. I can't say if it only happens in raids or if it just happens more rarely when not in raids. I think I recall seeing it happen in 5man runs too.\r\nI'm guessing it's some kind of weird event or event ordering issue.</p>\r\n<p>Here's the export string for the button, it's not really anything special. I've also tried it with the spell name but that didn't make a difference:</p>\r\n<p>^1^T^SShowTimer^B ^SType^Scooldown ^SShowWhen^Salways ^SRangeCheck^B ^SName^S57934 ^SEnabled^B ^t^N45209^^</p>\r\n<p>Let me know if there's anything else I can do to help track down this issue, and thanks for the great addon! <span>:)</span></p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/WoW_user40657\">WoW_user40657</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/282\">#282</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/282.html\">Raw</a>","closed":true,"closed_at":"2011-09-11T05:28:00Z","created_at":"2011-08-23T17:08:42Z","updated_at":"2011-09-11T05:28:00Z","labels":["defect","resolved"]},"comments":[{"body":" <p>A guildie had the same problem once, but unfortunately, I do not have a rogue to test with. Try tracking it as a Multi-state cooldown - it may or may not work better. Just make sure that the ability is on your action bars. (Multi-state cooldown pull their information directly from your action bars. What you see on your action bar is exactly what you will get.)</p>\r\n<p>I did find one bug with tricks: before you actually trigger the 6 second buff. the duration of the cooldown is reported by the API as being 0.001 seconds, which was causing an epileptic level of flashing the icon between usable and unusable). This seems like some kind of hard-coded, crappy fix on blizzard's part (probably an intern or something, because there already is support in the API for spells whose cooldown does not trigger until used (Misdirection, elemental mastery, pre-cata mage combustion, tricks, etc) which leads me to believe that crappy coding on blizzard's part is also why it sometimes breaks. If the problem is on Blizzard's end, there is most likely nothing that I can do to fix the problem.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"08 23 2011 16:06:58 (CST) (UTC-5:00)\" data-epoch=\"1314133618\">Aug 23, 2011</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-08-23T21:06:29Z"},{"body":" <p>I'll try multi-state to see if it helps, but yeah I've noticed the icon flashing and all that. Tricks seems to work quite differently from most other abilities. It's a bit weird.</p>\r\n<p>But let me know if I can help in any way to further debug it. <span>:)</span></p>\r\n<p>And well, I've done some addon work myself, so would you maybe give some pointers on what parts of the code I should start looking at first in case I'd want to go about debugging/fixing this myself?</p>\r\n<p>Thanks for the prompt reply!</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/WoW_user40657\">WoW_user40657</a>","created_at":"2011-08-24T17:37:52Z"},{"body":" <p>SpellCooldown_OnUpdate in Types/cooldown.lua is going to be the main place to look.\r\nIconBase.SetInfo in TellMeWhen.lua is the only other function that might be involved. (The fix for the flashing is in there, as is the processing for GCDs and all other data that an icon displays.)</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-08-25T01:16:18Z"},{"body":" <p>Going to mark this as fixed for now, since I did fix the flickering problem. Open a new ticket if you find a solution to the original problem.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-09-11T05:27:52Z"}]}