{"issue":{"title":"[CF 289] Edgecounter refreshes, duration does not. ","body":" <p>What steps will reproduce the problem?</p><p>1.&nbsp; Make Inquisition as a shown Buff for TellMeWhen<br>2.&nbsp; Enable Timer<br>I suppose it to happen with any playerside refreshable Buff</p><p>What do you expect to happen? What happens instead?</p><p>When I hit Inquisition it shows the remaining Duration and a clockwise running edgecounter.<br>When I hit Inq. again before the duration is over only the edgecounter refreshes but the duration does not.<br>The duration only refrehes after the timer has run out.<br>I guess it's some kind of problem with a refreshing buff.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>4.5.5</p><p>Do you have an error log of what happened?<br>Sorry got no Error as there is no real error because things happen but not as expected.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Ashtara\">Ashtara</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/289\">#289</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/289.html\">Raw</a>","closed":true,"closed_at":"2011-09-14T03:46:22Z","created_at":"2011-09-14T02:48:09Z","updated_at":"2011-09-14T03:46:22Z","labels":["defect","invalid"]},"comments":[{"body":" <ol><li>Please do not ignore the instructions at the top of the defect ticket template.\r\n</li><li>The textual countdowns on top of icons are not provided by TMW. They are provided by OmniCC/tullacc. If the actual cooldown sweep animation is refreshing, then TMW has done its job, and it is up to these addons to properly update the text.\r\n</li><li>I guess it goes without saying, but I am unable to reproduce this.</li></ol> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-09-14T03:46:15Z"}]}