{"issue":{"title":"[CF 29] Glyph of Hemorrhage bleed tracking ","body":" <p>What steps will reproduce the problem?<br>1. Spec a rogue into Subtlety and get the Hemorrhage ability. (Requires level 29)<br>2. Equip the Glyph of Hemorrhage. (Requires level 25, but you need 29 to get Hemorrhage anyway)<br>3. Configure TellMeWhen to track debuffs on the target in three separate buttons with a) the name Hemorrhage, b) the spellid 89775, which is the Glyph of Hemorrhage debuff, and c) the spellid 16511, which is the unmodified Hemorrhage debuff.<br>4. Attack a target dummy with Hemorrhage.</p><p>What is the expected output? What do you see instead?<br>Expected output: Spellid 89775 should show the time ticking down on the bleed effect, spellid 16511 should show the time ticking down on the longer-lasting 30% extra bleed damage debuff, and the name Hemorrhage should track either since both debuffs share the name.</p><p>Seen instead: While all versions of the button show the correct ICON once \"buff or debuff\" is chosen in the button configuration, only the Hemorrhage name shows any notice of the debuff being on the target--the other two behave as if nothing is happening when the debuffs are applied. The Hemorrhage name always shows the longer-lasting original Hemorrhage effect, never the bleed effect.</p><p>The only time the Hemorrhage name button shows the bleed effect's duration is when a 30% bleed debuff applied by another player, such as Mangle, overwrites the 1-minute Hemorrhage debuff before the bleed effect runs out.</p><p>What version of the product are you using?<br>1.5.1</p><p>Do you have an error log of what happened?<br>No, it didn't throw an error, but is rather a case of \"doesn't seem to be working as intended\".</p><p>Please provide any additional information below.<br>Rogue used for testing: Korrupt (Horde) of Feathermoon (US, RP).</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Alfadorfox\">Alfadorfox</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/29\">#29</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/29.html\">Raw</a>","closed":true,"closed_at":"2010-11-04T03:28:24Z","created_at":"2010-11-02T22:01:15Z","updated_at":"2010-11-04T03:28:24Z","labels":["defect","resolved"]},"comments":[{"body":" <p>This is Blizzard using things with the same names. I enjoy when they do this because it breaks stuff. The only way to make this work would be to iterate over every single debuff on the target and match the spellid, but I hate using CPU heavy workarounds like this because of Blizard's problem.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2010-11-03T22:54:24Z"},{"body":" <p>Fix is coming in the next version</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2010-11-04T03:23:45Z"}]}