{"issue":{"title":"[CF 304] Rating vs Percentage tracking (with video) ","body":" <p>Note: this is a cut-and-paste of the ticket #303 which was marked as invalid.&nbsp; I include a YouTube link that demonstrates that the talent mentioned changes haste percentage *without* touching rating. (I apologize for the fidelity; it's the best I can capture.&nbsp; I feel it still to be legible.)<br>It was asserted that the ticket was invalid because the talent only changes casting speed, which is not the case, or else it would not result in Lifebloom receiving an extra tick.<br>Additionally, the talent states that it increases haste, not casting speed.</p><p>If needed, I can generate and attach a YouTube link demonstrating TMW v4.6 not picking up the change in haste percentage, only rating.</p><p>Set up a \"Condition\" on a resto druid to pop an indicator up when Spell Haste is above some percentage.</p><p>Casting Regrowth, which activates Nature's Grace takes me above the threshold, but the indicator does not activate.</p><p>Messing with the Spell Haste slider reveals that it doesn't look at the Spell Haste percentage, but rather then combat rating.</p><p>Comparing this with a petrified pickled egg trinket (procs a haste *rating* buff) the indicator is activated.</p><p>This could be resolved by simply stating that the addon tracks combat ratings.</p><p>A better solution (imo) would be to track the actual percentage, rather than the combat rating.</p><p>Sources:</p><p><a href=\"http://www.youtube.com/watch?v=5aygXLDfzJc\" rel=\"nofollow\">http://www.youtube.com/watch?v=5aygXLDfzJc</a><br><a href=\"http://www.wowhead.com/spell=61346\" rel=\"nofollow\">http://www.wowhead.com/spell=61346</a></p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/theondry\">theondry</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/304\">#304</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/304.html\">Raw</a>","closed":true,"closed_at":"2011-10-10T21:53:16Z","created_at":"2011-10-10T21:22:53Z","updated_at":"2011-10-10T21:53:16Z","labels":["defect","resolved"]},"comments":[{"body":" <p>I guess that's what happens when i look at the melee section of the character sheet for changes in spell haste.</p>\r\n<p>The problem was that COMBAT_RATING_UPDATE doesn't fire for a straight change in haste percentage, while UNIT_SPELL_HASTE does.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-10-10T21:52:10Z"}]}