{"issue":{"title":"[CF 305] Strata/framelevel ","body":" <p>Strata and or some sort of framelevel/sublevel.</p><p>Im in sort of a bad situation, piecing together art and animations and stuff from different addons and it would really help if i could give the groups in tmw a strata and sublevel, to get it to the right spot.</p><p><a href=\"http://www.youtube.com/rhozac\" rel=\"nofollow\">www.youtube.com/rhozac</a></p><p>iv got my cooldowns as single groups with tmw, but id like them to go under the frosty circle. Problem is the orbs and its contents are on different stratas and sublevels so setting them up to work with tmw default strata is a pain. This anything you have considered and or is there a simplish way to set strata in tmw perhaps a script?. thanks.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/rhozac\">rhozac</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/305\">#305</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/305.html\">Raw</a>","closed":true,"closed_at":"2011-10-14T06:03:47Z","created_at":"2011-10-11T07:58:57Z","updated_at":"2011-10-14T06:03:47Z","labels":["enhancement","resolved"]},"comments":[{"body":" <p>You can already adjust frame levels (within each strata) in the group options. I will add strata options in soon, but for now you can do \"/run TellMeWhen_Group#:SetFrameStrata(\"strata\")\", where strata is a frame strata.</p>\r\n<p>Frame stratas include:</p>\r\n<ul><li>BACKGROUND - Used by default for static UI elements such as the PlayerFrame and Minimap\r\n</li><li>LOW - Used by default for lower-priority UI elements such as the party member and target frames\r\n</li><li>MEDIUM - Default frame strata for general usage\r\n</li><li>HIGH - Used by default for higher-priority UI elements such as the Calendar and Loot frames\r\n</li><li>DIALOG - Used by default for alerts and other dialog boxes which should appear over nearly all other UI elements\r\n</li><li>FULLSCREEN - Used by default for full-screen windows such as the World Map\r\n</li><li>FULLSCREEN_DIALOG - Used by default for alerts or dialog boxes which should appear even when a full-screen window is visible\r\n</li><li>TOOLTIP - Used for mouse cursor tooltips, ensuring they appear over all other UI elements\r\n</li></ul>\r\n<p>For example, </p>\r\n<p>/run TellMeWhen_Group7:SetFrameStrata(\"HIGH\")</p>\r\n<p>If you want to automate this, add the following line at line 2328 in TellMeWhen.lua (after \"local group = CreateFrame(\"Frame\", \"TellMeWhen_Group\" .. groupID, UIParent, \"TellMeWhen_GroupTemplate\", groupID)\"):</p>\r\n<p>group:SetFrameStrata(\"HIGH\")</p>\r\n<p>This will create all groups in the HIGH strata. Be aware that modifying TMW's file will cause the Curse Client to stop updating it automatically until you re-update TMW.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-10-11T21:37:11Z"}]}