{"issue":{"title":"[CF 342] Colors are not implemented fuly. ","body":" <blockquote class=\"source-quote\"><div class=\"quote-content\"><div class=\"quote-body\"><div class=\"quote-source\">Quote from <span class=\"quote-author\">Mark617 &raquo;</span></div>I used to use an addon called dimmed actions, but it no longer seems to work. I came upon your addon by referral and had a question.<br><br>I seem to be able to turn the icons black (I dont want the opacity zero I like the icon blacked out) when the cooldown is up, under the present and absent color sections. Yet, when I turn the absent color black it doesnt work. I seem to only be able to turn the icon black when the ability is useable using the present color choice.<br><br>What am I doing wrong? I would like the icon to black out when on cooldown and look normal when ready to use (with no other parameters being monitored - only the ability CD).Also, assuming I can get the black aspect right, is it possible to then show the timer over the black (omni CC timer) like it is over the normal icon.Your addon is as close as I seem to be able to find to what I want. Even if I need to do some .lua file editing etc. I am willing to do so.<br><br>Thanks for your time and effort. I appreciate all the time you guys put in.</div></div></blockquote>Sorry for any confusion/frustration this may have caused you. This issue is most certainly being caused by my poor and incomplete implementation of the coloring system - colors are not used in all cases where they should be. I will fix this ASAP.Also, I thought I replied to you yesterday, but apparently I forgot to hit post, so here is the message that I meant to send to you. I will be pretty busy all this week, but I should be able to get a full update to the color system this weekend.In the meantime, you can modify the .lua files to suit your needs. In TellMeWhen/Types/cooldown.lua, on lines 180 to 185, there are three numbers. These numbers control the color of the icon. If you wish for the icon to use the colors you have set for unusable/absent, replace the numbers with \"ab\" (without quotes), or change the numbers (0 is solid black, 1 is white/normal, 0.5 is dimmed, etc.)<br>The number on line 180 determines the color if the icon is set to always show and you do not have a timer shown, the number on 182 determines the color if the icon is set to always show and you do have a timer shown, and the number on 185 determines the color if the icon is set to only show when unusable. \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/342\">#342</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/342.html\">Raw</a>","closed":true,"closed_at":"2011-11-27T23:01:34Z","created_at":"2011-11-14T22:38:56Z","updated_at":"2011-11-27T23:01:34Z","labels":["defect","resolved"]},"comments":[{"body":" <p>Now they are.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-11-27T23:01:23Z"}]}