{"issue":{"title":"[CF 345] Tracking Dark Intent procs as a target of Dark Intent ","body":" <p>Hey there,</p><p>Fist of all I would like to say that I love your add on very very much, I cant imagine somebody trying to perform as close to 100% of their class without having this add on (or something that works the same) installed.</p><p>The suggestion I want to make concerns the moment a Warlock cast Dark Intent on you. This can be tracked easily, but when you try to track the proc's of Dark Intent, the +1% haste that stacks 3 times with a duration of 7 sec, its pretty much impossible.<br>The way I tried to grab this buff was buy checking as a buff on player all the Dark Intent ID's I could find... all the time i get tracked the main buff you get when the warlock initially casts Dark Intent on you, the one with 30 min duration.</p><p>It will be very very nice to be able to track the actual proc's and stacks of Dark Intent especially as a priest.</p><p>In case there is already a way to track the actual proc of Dark Intent I am sorry I posted here.<br>Thank you very much.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/MareleADI\">MareleADI</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/345\">#345</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/345.html\">Raw</a>","closed":true,"closed_at":"2011-12-01T01:15:39Z","created_at":"2011-11-23T06:22:58Z","updated_at":"2011-12-02T15:04:36Z","labels":["enhancement","invalid"]},"comments":[{"body":" <p>Hmmm. If they use the same spellID, then that does pose an interesting problem.</p>\r\n<p>What might work is if you sort the icon by low duration, and set a maximum duration of 7 seconds. That way, it will always send the proc to the display engine unless the 30 min buff is about to expire, and it won't show the 30 min buff because of the maximum duration.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-11-23T20:06:27Z"},{"body":" <p>Hey there , thank you for the replay.</p>\r\n<p>I have tryed your work around but sadly its not showing at all... its like none of the Dark Intent ID's from your addon and also from Wowhead ID's are not nailing that specific buff.</p>\r\n<p>In case its possible please have a look at it and perhaps you guys could solve that.\r\nThank you very much, and I love your work <span>:)</span></p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/MareleADI\">MareleADI</a>","created_at":"2011-11-24T10:11:55Z"},{"body":" <p>Hopped on my lock, and this is what I found out:</p>\r\n<p>80398 - the spell that is on the warlock's action bars. Does not have a buff associated.</p>\r\n<p>85767 - the 30 min buff on whoever dark intent was cast on (not the warlock who casted it)</p>\r\n<p>85768 - the 30 min buff on whoever casted dark intent (the warlock)</p>\r\n<p>94319; 94318; 94320; 94323; 94324; 94313; 94312; 94310; 94311; 85759 - the 7 second buff. From what I can tell, each class has their own spellID </p>\r\n<p>Ive seen 94313 on warriors and hunter pets, 94320 on hunters, and 85795 on my Imp pet</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"11 24 2011 13:51:32 (CST) (UTC-6:00)\" data-epoch=\"1322164292\">Nov 24, 2011</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-11-24T19:42:03Z"},{"body":" <p>Thank you very much, it works perfectly, perhaps we should have something like a manual for the addon were to speake about this type of tips <span>:)</span></p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/MareleADI\">MareleADI</a>","created_at":"2011-12-02T15:04:36Z"}]}