{"issue":{"title":"[CF 381] Tint changes for target hostiles only ","body":" <p>Cyb, could you make it so that the tinting changes for offensive attack spells only apply when hostiles are targeted?&nbsp;&nbsp; For example, if as a warrior, I don't need Shield Slam (offensive spell) icon giving me the out-of-power tint when I have myself, an NPC or a friend targetted.&nbsp; Thanks.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/oxboy555\">oxboy555</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/381\">#381</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/381.html\">Raw</a>","closed":true,"closed_at":"2011-12-17T03:47:44Z","created_at":"2011-12-14T07:34:53Z","updated_at":"2011-12-17T03:47:44Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>Probably not, meaning that I can, but I don't want to. Range checking acts this way because of the way that the API works - Blizzard does not tell us if a target is or isn't in range of a spell that can't be used on the unit; it only tells us that the spell cannot be used on the unit.</p>\r\n<p>Mana checking is a bit different. For example, a mage might have a polymorph icon setup, but he only ever casts polymorph on his focus target. TMW would, unless I add unit config to cooldowns icons which I don't want to do, check if the spell is usable on his target instead of his focus, which isn't going to do any good if the target is friendly and the focus is hostile.</p>\r\n<p>Another example is that a priest may have some cooldown icons for healing spells, and some icons for shadow spells/smite/holy fire. If the priest has the boss targeted and is smiting, she will still want to know if she has enough mana to cast regular healing spells in case she needs to start using them to respond to some raid damage.</p>\r\n<p>So, in order for this to be effectively implemented, there would need to be two new options for cooldown icons (and reactive icons) - Unit to Check, and an option to actually enable such functionality, since in many cases, it would be undesired. This would add much confusion, especially in realizing that the Unit to Check option only affects the unit reaction for mana checking setting, as opposed to the main functionality as it does for all other icon types that check units.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"12 14 2011 18:01:09 (CST) (UTC-6:00)\" data-epoch=\"1323907269\">Dec 14, 2011</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-12-14T23:59:39Z"}]}