{"issue":{"title":"[CF 386] Metaicons sortable by time remaining ","body":" <p>Related to the bug I just reported I also want to ask if you could possibly add an enhancement to the addon. I want an icon to check the shortest remaining cooldown out of the internal cooldown of Taste for Blood, Mortal Strike and Colossus Smash. You might point out that the icon I posted already does that via a unit cooldown icon. However there is something else to Colossus Smash, that I cannot properly check for with a unit cooldown icon. Colossus Smash can proc and be ready instantly. When that happens I don't want to know the cooldown of Colossus Smash anymore, I know want to know the remaining duration of the Colossus Smash debuff on the target. Otherwise I might end up overriding an already existing Colossus Smash debuff. So I want to choose the longer one out of the Colossus Smash cooldown and debuff, and then I want to choose the shortest one out of Colossus Smash, Mortal Strike and Thirst for Blood. The easiest way I can imagine doing that is with a metaicon that sorts its subicons by time remaining (ascending/descending). One for Colossus Smash (descending), and then that plus Mortal Strike and Thirst for Blood (ascending).</p><p>Could you make this happen? I'm sure this is also going to come in handy elsewhere eventually.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/AmeroGer\">AmeroGer</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/386\">#386</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/386.html\">Raw</a>","closed":true,"closed_at":"2011-12-19T08:05:43Z","created_at":"2011-12-18T20:31:40Z","updated_at":"2011-12-19T08:05:43Z","labels":["enhancement","resolved"]},"comments":[{"body":" <p>This would definitely be possible, and is something that I have considered doing for a long time.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-12-19T07:08:05Z"},{"body":" <p>Done. Open a new ticket if something seems awry.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2011-12-19T08:05:37Z"}]}