{"issue":{"title":"[CF 411] Missing group bar, not able to edit TellMeWhen ","body":" <p>I installed TellMeWhen and wanted to import a profile from one character to another and clicked \"Overwrite\" Group and somehow accidentally erased the group bar.</p><p>(I did the same thing with another character and it worked fine however.)</p><p>Heres the problem: With the \"Group\" bar missing I have no way of opening the \"edit\" window, and thus cannot correct the problem or create a new group.<br>(I tried importing from another player but same problem- with no edit window - no way to \"accept\" a imported group.)</p><p>Is there some way of entering a text in the \"chat\" window (like one does with \"/tmw\" that would open the edit window ?</p><p>Also, I tried erasing the folders \"TellMeWhen\" &amp; \"TellMeWhen_Options\" in the \"interface/addons\" folder and then re-installing TelleWhen with a freshly downloaded version but the problem was still there! Along with the other characters having their old profiles available.</p><p>Is there a way to COMPLETELY remove all data in order to re-install TellMeWhen ? (this solution would be ok for me)</p><p>My current version is TellMeWhen-4.7.3, the previous version I'm not sure of however (if this helps) was downloaded in mid November 2011.</p><p>Thanks for any help you could provide- I love the addon and will definitely donate!</p><p>Frogmerc</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/frogmerc\">frogmerc</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/411\">#411</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/411.html\">Raw</a>","closed":true,"closed_at":"2012-01-09T22:34:57Z","created_at":"2012-01-06T10:39:29Z","updated_at":"2012-01-09T22:36:38Z","labels":["defect","resolved"]},"comments":[{"body":" <p>You should be able to access options by pressing escape and then going to Interface, clicking Addons at the top and then navigating to TellMeWhen. Also you can reset Addons by deleting their corresponding saved variables in the WTF folder.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/AmeroGer\">AmeroGer</a>","created_at":"2012-01-06T20:57:23Z"},{"body":" <p>Typing '/tmw options' will also display TMW's main options (with the group settings), allowing you to correct the problem.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-01-06T22:53:17Z"},{"body":" <p>Also, as to why the groups disappeared - it is possible that they have talent tree/talent specialization settings that do not match the character that you imported them to, which would cause incompatibilities. Check these settings for the groups that you imported, and if you cannot figure out the problem, post the export string of the entire profile here and I will be glad to help you.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"01 6 2012 16:56:28 (CST) (UTC-6:00)\" data-epoch=\"1325890588\">Jan 6, 2012</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-01-06T22:56:16Z"},{"body":" <p>Hi!</p>\r\n<p>Thanks for the help!</p>\r\n<p>As is is, I accidentally figured it out myself- by tipping in \"/omnicc\", which is the \"code\" for Onmi CC (also an addon), there appeared the \"Interface/Addon\" panel where I was also able to access my \"TellMeWhen\".</p>\r\n<p>It is also possible to access the TellMeWhen interface by going to \"Interface\" and then \"Adddons\".</p>\r\n<p>Thought I'd let everyone know what I've learned because the Addon is probably the best one there is for PVP and every effort should be made to keep people using it. (for awhile I was worried because by tipping \"/tmw\" there was absolutely no way to do anything)</p>\r\n<p>Keep up the great work and thanks again for your replies !!!</p>\r\n<p>Frogmerc</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/frogmerc\">frogmerc</a>","created_at":"2012-01-09T17:42:53Z"},{"body":" <p>Thanks for the tipp on the <em>tmw options\" and \"WTF\" folder, I looked at that after reading your posts- nice! </em></p>\r\n<p>Thanks guys !!!</p>\r\n<p>Frogmerc</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/frogmerc\">frogmerc</a>","created_at":"2012-01-09T17:47:15Z"},{"body":" <p>Glad to hear everything got worked out, and thank you for your offer to donate! I really appreciate it!</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"01 9 2012 16:36:38 (CST) (UTC-6:00)\" data-epoch=\"1326148598\">Jan 9, 2012</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-01-09T22:34:48Z"}]}