{"issue":{"title":"[CF 43] Appear when on CD also appears when GCD invoked ","body":" <p>ATTATCHING A SAVED VARIABLE FILE WILL GET YOUR TICKET ANSWERED 200 TIMES FASTER</p><p>SAVED VARIABLE FILES CAN BE FOUND IN \"World of Warcraft/WTF/Account/&lt;ACOOUNTNAME&gt;/&lt;REALMNAME&gt;/&lt;CHARNAME&gt;/SavedVariables/TellMeWhen. lua\"</p><p>What steps will reproduce the problem?<br>1. Set up a couple of cooldown monitors for spells or abilities which are GCD-bound. I'm using Crusader Strike and Judgement. Set them to show only when unusable and set the timer to show the remaining CD time. We want an icon that appears when we our ability is on cooldown, to let us know how long until we can use it again, and to be invisible otherwise.</p><p>2. Activate one of the abilities above; note that the other ability briefly appears, with the CD timer displayed. Activate any other ability which invokes the GCD. Note that our monitored abilities appear briefly, without the CD timer displayed.</p><p>What is the expected output? What do you see instead?</p><p>What I expect is for the icons to appear only while the respective ability is on cooldown. What I see instead is that they ALSO appear when they are not usable because they are GCD locked.</p><p>What version of the product are you using?</p><p>1.5.4</p><p>Do you have an error log of what happened?</p><p>N/A</p><p>Please provide any additional information below.</p><p>I don't know if this is a bug or intentional, but it results in icons popping up when I don't want to see them. If this is intentional, it would be nice to have the option of telling TMW to monitor either CD or GCD or both.</p><p>Thanks again for the work on this addon. I use it on every character I have.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Furiant\">Furiant</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/43\">#43</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/43.html\">Raw</a>","closed":true,"closed_at":"2010-11-14T13:06:12Z","created_at":"2010-11-14T12:38:18Z","updated_at":"2010-11-14T13:06:12Z","labels":["defect","invalid"]},"comments":[]}