{"issue":{"title":"[CF 445] button/animation skinning ","body":" <p>when playing around a little with zorks ractionbuttonstyler i realized that he uses several different textures to overlay the button on specific events, like mouseover/equipped/etc. would it be possible for tmw to skin buttons in a similar way using a media file (no masque) like rabs does with actionbuttons, and fruthermore maybe use the corresponding overlay textures as animations?</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/yeahno\">yeahno</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/445\">#445</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/445.html\">Raw</a>","closed":true,"closed_at":"2012-02-28T03:56:47Z","created_at":"2012-02-21T15:53:18Z","updated_at":"2012-02-28T03:56:47Z","labels":["declined"]},"comments":[{"body":" <p>Some screenshots would help here. If what you are asking is for me to add support for rABS, then the answer is probably no. I already go out of my way to support Masque; I don't want to have to deal with all of the little tweaks and hacks needed to make another addon work with TMW too.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-02-21T23:45:15Z"},{"body":" <p>well, supporting rABS probably doesn't exactly describe what i was thinking of, but i surely understand the problems that come up, when having to adapt tmw to more \"third party\" addons.</p>\r\n<p>can't post screenshots right now but i'll try to explain: every skin defines a normal texture (taking UI-Quickslot.blp's place for standard actionbar buttonskin) and, say 6 different overlay textures, which in rabs' case are called like gloss/flash/hover/pushed/checked. i just thought about making it possible for tmw to somehow adapt these .tga overlays and use them as animations.</p>\r\n<p>i honestly can't make a good guess how hard that would be to accomplish codingwise, so i perfectly understand if you're saying it's not worth it. i thought maybe zork's solution of using real textures compared to buttonfacade's code intensive skinning method might be easier to implement und less maintenance dependant.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/yeahno\">yeahno</a>","created_at":"2012-02-22T09:00:18Z"},{"body":" <p>Well, this is possible with the new Image Overlay animation I added a few revisions back. Its not very direct, as you still have to know the path of the texture that you would like to use, and you have to play around with the size until you get it right, but it is possible.</p>\r\n<p>I still may implement these as animations, but they would be dependent on the Masque skin currently being used (at least for the Checked texture. Gloss is a Masque setting that is completely handled by Masque, so I would leave that one alone. Hover (Highlight) is currently used when mousing over the icon in config mode, and Pushed is used when you press your mouse down on an icon in config mode.</p>\r\n<p>Out of all of those, Checked is the only one that could be implemented without it feeling awkward, but this would still require that I change the frame type that icons are based on (which isn't hard, but still might need a little work).</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-02-23T05:53:59Z"}]}