{"issue":{"title":"[CF 452] Balance Druid Get Eclipse Direction Error. ","body":" <p>IMPORTANT: If your issue is only occurring with a specific icon, include an export string of the icon in this ticket. Subsequently, if the issue involves an entire group or an entire profile, include the entire export string of the group or profile.</p><p>To get an export string, open the icon editor, and click on the arrow next to the editbox labeled \"Import/Export/Backup\". Select the \"To string\" option for the appropriate export type (icon, group, or profile), and then press CTRL+C to copy it to your clipboard.</p><p>If you are experiencing errors that seem to be unrelated to icons, attaching a saved variables file will increase the likelihood of your problem being solved. Saved variables can be found in: \"World of Warcraft/WTF/Account/&lt;Account Name&gt;/SavedVariables/TellMeWhen. lua\". Screenshots can be especially helpful if your issue is hard to describe in words.</p><p>FAILURE TO COMPLY WITH THE ABOVE INSTRUCTIONS WILL RESULT IN YOUR TICKET BEING INVALIDATED.<br>The getelcipsedirection procs error.</p><p>What steps will reproduce the problem?<br>1.<br>2.<br>3.</p><p>What do you expect to happen? What happens instead?</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)</p><p>Do you have an error log of what happened?</p><p>Please provide any additional information below (including any export strings if applicable; see above.)</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/yezm\">yezm</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/452\">#452</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/452.html\">Raw</a>","closed":true,"closed_at":"2012-03-01T02:58:25Z","created_at":"2012-03-01T00:52:51Z","updated_at":"2012-03-01T02:58:25Z","labels":["defect","invalid"]},"comments":[{"body":" <p>The ticket template exists for a reason. Don't ignore it.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-03-01T02:57:42Z"}]}