{"issue":{"title":"[CF 462] Possible performance regression with 5.0 ","body":" <p>On my old machine (c2duo 2.4GHz, HD4670 GPU, running wow on GNU/Linux with WINE), my fps always sucked in 25man, but it seemed to suck even more in a couple LFR runs I did after upgrading from TMW 4.8.1 to 5.0.2.&nbsp; Also FPS seemed lower than I remembered in the main raid working on H gunship.&nbsp; I have to stress that I didn't test this carefully by downgrading TWM since I had already ordered parts for a new machine, so this is a really poorly controlled experiment, but it seemed worse than normal on a couple toons that each only have maybe 5 or 6 icons in two groups.&nbsp; The icons are just spell cooldown icons, and a couple buffs on my spriest, with timers from omniCC.</p><p> So maybe the event-driven code still needs some optimization, or maybe with low numbers of simple icons the old code did little enough work that it was actually more efficient.&nbsp; (IDK, haven't looked at the code, sorry).&nbsp; Maybe WINE makes some LUA functions a lot more expensive than they are on native Windows, if they happen to call something that WINE's windows libraries do slowly.</p><p> The main point of this report is just to say that with a slow machine where one can actually notice a performance difference when mods are slow, TMW might be using more CPU than it was before, contrary to the design goal of the new event driven framework :(.&nbsp; If anyone wants to take time to investigate this, I can provide my TWM icons.</p><p> I just built a new machine for WoW, running Windows, so I no longer have any performance issues, but I can still test on my old slow system with WINE until software updates break WINE+WoW, or make it unstable.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Karsteck\">Karsteck</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/462\">#462</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/462.html\">Raw</a>","closed":true,"closed_at":"2012-04-08T03:07:10Z","created_at":"2012-03-12T19:48:29Z","updated_at":"2012-04-08T03:07:10Z","labels":["defect","invalid"]},"comments":[{"body":" <p>Tried to test this, but I was getting an error after selecting an install directory installing WoW via WINE on my Ubuntu VirtualBox machine. If you could narrow the issue down to a specific revision of TMW, that would be great. Just one question: Does the performance hit continue when TMW is in config mode? Or does it only occur when TMW is locked?</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-03-12T23:46:22Z"},{"body":" <p>Got past the error (formatted the drive I was installing to as ext4 instead of ntfs) - I will see what I can figure out as far as the performance issue goes.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-03-13T00:40:39Z"},{"body":" <p>Now I'm hitting a wall on getting DirectX installed. All the files are there, libraries are set up in WINE configuration, but running dxdiag yields absolutely nothing.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-03-13T02:48:23Z"},{"body":" <p>Don't intall DirectX for Wine.,.. Just modify the shortcut to use opengl or put it in the config.wtf file. </p>\r\n<p><a href=\"http://www.wowwiki.com/World_of_Warcraft_functionality_on_Wine#Playing\" rel=\"nofollow\">http://www.wowwiki.com/World_of_Warcraft_functionality_on_Wine#Playing</a></p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/InfernalAura\">InfernalAura</a>","created_at":"2012-03-15T23:20:47Z"},{"body":" <p>Its still bugging me about it even after editing config.wtf and the shortcut to use OpenGL, though. That's the source of half of my confusion.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-03-15T23:30:52Z"},{"body":" <p>Got it to attempt to start in OpenGL mode, but now its yelling that there is no suitable display device... Maybe I should stop trying to do this inside a virtual machine and actually boot into Linux... too many display quirks</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-03-15T23:54:47Z"},{"body":" <p>Booting into Linux didn't change anything... same error I was getting in VirtualBox. I'm just going to leave this issue alone until you are able to narrow it down to a specific version of TMW.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-03-16T00:37:48Z"},{"body":" <p>Oh. Did you get WoW to work on Windows through Virtualisation and if so I ugess it might require quite powerful GPU to actually be able to virtualise one good enough for it to actually work. But on a regular nix box you should get away with just a copy of your game on an external drive and just make it start in opengl and it should work out of the box. Or close to it</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/InfernalAura\">InfernalAura</a>","created_at":"2012-03-16T00:38:22Z"},{"body":" <p>That's exactly what I'm doing. I coped my WoW folder to another HDD and changed config.wtf to use OpenGL instead of d3d9, but it still isn't working. Doesn't work when using a command line switch to opengl either.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-03-16T00:50:16Z"},{"body":" <p>did you try this command and see if the Direct Rendering is set to yes </p>\r\n<p>glxinfo | grep rendering</p>\r\n<p>If it says No. You may have to install your graphic card driver depending on your distro. Debian, Ubuntu or Fedora. you should be able to find a guide somewhere to set that up.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"03 15 2012 20:22:52 (CST) (UTC-5:00)\" data-epoch=\"1331860972\">Mar 15, 2012</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/InfernalAura\">InfernalAura</a>","created_at":"2012-03-16T01:13:03Z"},{"body":" <p>glxinfo is just returning a segmentation fault.... hmmm</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-03-16T01:45:35Z"},{"body":" <p>hmmm well from there I can't help you out. I am not sure where to go from there since it can range from the driver to the kernel you're using. hehe I guess I will let the op take the flag and give you a head up on the issue.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/InfernalAura\">InfernalAura</a>","created_at":"2012-03-16T02:00:50Z"},{"body":" <p>I never had TMW in config mode during raid combat, so IDK. I didn't test that. If you're interested in seeing if there's anything to my initial report, I could try to see if I can find a measurable difference during LFR ultraxion or something. That's the easiest semi-repeatable test, probably, esp. if I enable/disable stuff during the same pull.</p>\r\n<p> I keep my Interface/Addons and WTF in git, so I can pull my current mods / UI back to my old machine.</p>\r\n<p> As far as testing this yourself with WINE, I'd be shocked if playing WoW in a VM was viable. I think the overhead of virtualized 3D would swamp any other signals, unless you have a VM with a video card dedicated to it, hidden from the host OS, driven by the guest OS's drivers (with VT-d, supported on recent CPUs, except for the i5-2500k, grr). WoW in WINE on Linux is already slow enough, running with wine Wow.exe -opengl of course. Since as Infernal says, using WoW's OpenGL rendering engine is better than having WINE translate the d3d calls into openGL.</p>\r\n<p> also, sorry i didn't get back to this bug report sooner, my normal email address broke soon after submitting this, and my domain registrar isn't responding...</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Karsteck\">Karsteck</a>","created_at":"2012-04-04T11:53:00Z"},{"body":" <p>I suppose a fresh look at this was all I needed. Booted up in linux, updated my displays drivers (why didn't that occur to me before?) and now Wow runs just fine in WINE.</p>\r\n<p>I haven't noticed any difference in CPU usage, though. MY setup (probably around 30 icons) is using almost the exact same amount of CPU as it does on Windows. At least on my machine (i7-2600k), there doesn't seem to be any problem.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-04-04T20:46:18Z"},{"body":" <p>Ok, then I was probably imagining things. Or else I changed something else on my old machine. Thanks for taking a look. As I said in the initial report, I didn't have any hard data, and I'm not having any trouble on my new i5 machine running Windows.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Karsteck\">Karsteck</a>","created_at":"2012-04-06T11:49:17Z"}]}