{"issue":{"title":"[CF 469] Allow icons to have default BG / Border color ","body":" <p>It would be really helpful visually if icons could have a default Background Panel&nbsp; or&nbsp; Border color assigned to them. Icons alone can fail to stand out properly against certain busy game scenes, or when layered over other UI elements.</p><p>This would also make the event animations which change BG / Border color more useful, since a preexisting default border (for example, black) could become highlighted bright yellow, etc.</p><p>Also, on the topic of the new Border animation, it's very difficult to set this in a consistent/satisfactory way with the Slider method of input. An entry box which allowed the user to enter a specific number (for example, 10 pixels larger than the icon size) would be very helpful.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Lov3star\">Lov3star</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/469\">#469</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/469.html\">Raw</a>","closed":true,"closed_at":"2013-04-21T03:12:14Z","created_at":"2012-03-16T02:50:36Z","updated_at":"2013-04-21T03:12:14Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>It has precision to 0.1 pixels. What more could you want? Use the scroll wheel or scale up the icon editor if you need to fine-tune it.</p>\r\n<p>As far as your main request goes, I will think about it. But, chances are I won't implement this - at least not any time in the foreseeable future. There are many things that I would like to implement before this.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"03 15 2012 22:20:20 (CST) (UTC-5:00)\" data-epoch=\"1331868020\">Mar 15, 2012</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-03-16T03:12:38Z"},{"body":" <p>How about just using masque with the right skin?</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/AmeroGer\">AmeroGer</a>","created_at":"2012-03-16T16:31:45Z"},{"body":" <p>Precise perhaps, but it's not at all efficient. If I know exactly how large the icons are, I'd rather just type \"44\" than have to meticulously scroll up from 0 to 44 in itty bitty increments — especially over and over again, if a border should change color in multiple ways.</p>\r\n<p>Scrollbars in general seem like a very messy way of entering information, but perhaps it's just a difference in personalities/preferences.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Lov3star\">Lov3star</a>","created_at":"2012-03-26T02:21:35Z"},{"body":" <p>As far as Masque, well, there's a few things that come to mind. One, I find AddOns are generally more reliable when self-contained. Two, it reduces flexibility to change colors or details on a per-icon basis. Three, a system built into TMW would also (hypothetically) integrate more smoothly with Conditions/Events changing the colors.</p>\r\n<p>Please don't misinterpret my tone; TellMeWhen is extremely powerful, and I appreciate the hard (volunteer) work you've put into it.</p>\r\n<p>I just find borders/backgrounds/color changes to be an extremely effective method for compacting even more information into a small, simple space. I'm excited to try to add that versatility into TMW precisely because the addon is so strong already.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Lov3star\">Lov3star</a>","created_at":"2012-03-26T02:24:26Z"},{"body":" <p>Not sure if this is the right issue/feature to comment on, but I too would like the ability to change the color of icons and/or the custom textures. </p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Stanoslav\">Stanoslav</a>","created_at":"2012-08-31T19:54:47Z"},{"body":" <p>I feel it would also be extremely useful to be able to change the icon colour based on conditions. Currently we can change the opacity which is great, but I actually find that I check my timers using OmniCC and can't always see them with the opacity lowered. At the same time I want to differentiate between icons that are immediately important and those that are not. Opacity is currently the only option I have. I am aware that I can use events, to go some way to address this, but these I presonally used for procs and showing when long cooldowns are available. I absolutely love this addon though. So powerful. Truely brilliant!</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Th4n45\">Th4n45</a>","created_at":"2012-11-27T14:53:30Z"}]}