{"issue":{"title":"[CF 478] Colors don't support usable/unusable ","body":" <p>pkuz<br>pkuz's avatar</p><p>&nbsp; &nbsp; Posts: 16</p><p>Maybe \"graying out\" is not proper description, the icon is at 100% opacity but the colors are somewhat dim. Exactly like default blizzard bar has it when reactive ability is not available.</p><p>Here is the screenshot showing the problem along with some description:<br><a href=\"http://i39.tinypic.com/351uwza.jpg\" rel=\"nofollow\">http://i39.tinypic.com/351uwza.jpg</a></p><p>Cyb's rambling:<br>If new color options were added to also allow coloring based on usable/present/unusable/absent, then it would increase the number of color settings that need to be configured for each icon type from 4 to 8, which is a little bit out of hand. Not to mention that it overlaps heavily with the \"Counting\" color settings - reactive icons are one of the only icon types where the icon can be considered unusable and not counting at the same time. What I propose is this: (and it would fit in nicely with my new plans for separating out data handlers, removing the old :SetInfo method)</p><p>Have a data handler that takes everything that can affect appearance (alpha, usability/presence, duration (maybe?), out of mana, out of range) and deduce a color from that. Rewrite color settings to be more configurable - more like conditions where you can select your own requirements and set a color for those requirements. The color-getting function will go down the list in order, testing until it obtains a color.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/478\">#478</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/478.html\">Raw</a>","closed":true,"closed_at":"2012-08-26T11:39:52Z","created_at":"2012-04-01T01:40:33Z","updated_at":"2012-08-26T11:39:52Z","labels":["defect","declined"]},"comments":[{"body":" <p>I hate this now.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-08-26T11:39:14Z"},{"body":" <p>Colors still need to be rewritten though. Ugh. I really hate colors in TMW.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-08-26T11:39:43Z"}]}