{"issue":{"title":"[CF 485] School lockout icon ","body":" <p>This addon needs a proper icon for school lockouts.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/AmeroGer\">AmeroGer</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/485\">#485</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/485.html\">Raw</a>","closed":true,"closed_at":"2012-05-02T02:28:58Z","created_at":"2012-04-17T01:59:21Z","updated_at":"2012-05-02T02:28:58Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>this is already perfectly doable. i can't post my event cause i can't logon until friday but what you basically have to do is just create a filter watchlist for the spells of the particular school you wanna track in a combat log interrupt event icon, and have it take into account what interrupt spell has been used to determine lockout duration. (not sure if i did the second part using another interrupt track icon together with \"is icon shown\")</p>\r\n<p>reading again i'm not sure if your point here is just the cosmetics auf the icon that is displayed upon school lockout though? i'm just using signature spell icons for the given school, say fireball/healing touch/flash heal... whatever.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"04 23 2012 03:43:13 (CDT) (UTC-5:00)\" data-epoch=\"1335170593\">Apr 23, 2012</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/yeahno\">yeahno</a>","created_at":"2012-04-23T08:41:42Z"},{"body":" <p>The problem with school lockouts is that there is no API to detect them. The only way is to run through your entire spellbook and check if the cooldowns of your spells match a known lockout duration, but this becomes really weird with things that reduce the duration of spell lockouts and things like that, not to mention that some short cooldowns might be wrongly detected as cooldowns, and some classes have just a few spells from a certain spell school that can be checked for a lockout, and I would have to maintain a list of all spells from each spell school for each class.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-05-02T02:27:23Z"},{"body":" <p>If you can do what you want with yeahno's suggestion, then fantastic. If I completely misunderstood what you are asking about, then I will open this back up and see what I can do. Otherwise, I'm going to mark this as declined.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-05-02T02:28:53Z"}]}