{"issue":{"title":"[CF 495] hook actionbar button activation overlay ","body":" <p>i think a lot of tmw icons are solely created for the player to react to certain circumstances - this reaction, in the majority of cases, involves casting spell xy. so creating activation buttonborder overlay animations upon events via tmw's condition system would actually (imo, at least) be a nice addition for everyone who tries to keep it clean and simple, and doesn't want a lot of icons to clutter their screen.</p><p>i know this might be a hassle with all the actionbar mods around nowadays, but an implementation for stock ui actionbars would be sufficient. this was actually one of the few aspects i really like about weak auras before switching to tmw.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/yeahno\">yeahno</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/495\">#495</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/495.html\">Raw</a>","closed":true,"closed_at":"2012-11-05T05:32:09Z","created_at":"2012-05-06T23:07:45Z","updated_at":"2012-11-05T05:32:09Z","labels":["enhancement","resolved"]},"comments":[{"body":" <p>You actually just gave me a brilliant idea. What if all events were actually based on conditions passing/failing? You would be able to create a custom set of conditions to create an event, and then have that ever trigger whatever you want it to. There would be preset condition sets that would replicate the existing events so that setup would be nice and easy. This would also make the On Icon Show/Hide events much less awkward than they are right now since they would essentially be the same as the On Show and On Hide events, just checking a different icon.</p>\r\n<p>While I am rambling away ideas on your ticket, I might as well post this (unrelated) one here too: I want to try to make the icon editor resizable vertically if I can. The Text, Condition, Group Settings, and Group Conditions definitely already support that. Only the Events and Main tabs would need some work. But, I am considering splitting the Main tab into two parts: Data and Display. Data would affect what information that icon displays, and would have settings such as Name, Unit, icon specific settings, and Show When settings. Display would have things like Opacity sliders and Show Timer/Show Timer Text settings, as well as the existing text settings. This would also allow settings to be completely dynamic, making it much easier for 3rd parties to expand upon TMW's framework, which has been my ultimate goal with all of the recent overhauling.</p>\r\n<p>Sorry for the wall of text, but I wanted to get some of these ideas that have been brewing in my head down in writing before I forget all of them.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-05-08T03:14:02Z"},{"body":" <p>this sounds really good imo, looking forward to the changes.</p>\r\n<p>i don't wanna make another ticket but there is one more suggestion on my mind. do you think tmw will at some point allow icon anchoring to nameplates (with LibNameplate compatibility)</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/yeahno\">yeahno</a>","created_at":"2012-05-08T07:23:11Z"},{"body":" <p>That is something that I hope to make possible with different display types. It might not be me who develops this, but I hope to make the framework extensible enough to support the development of something like that. Similar ideas include anchoring icons to Grid frames (or other unit frames).</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-05-08T21:36:38Z"},{"body":" <p>Well, my idea sounded really good at the time, but now I'm not sure if it is very feasible because some events absolutely depend on being event based.</p>\r\n<p>The only events that could be detected through conditions are:</p>\r\n<ul><li>On Show\r\n</li><li>On Hide\r\n</li><li>On Start\r\n</li><li>On Finish\r\n</li><li>On Other Icon Show\r\n</li><li>On Other Icon Hide\r\n</li><li>On Duration Changed\r\n</li></ul>\r\n<p>But the rest all completely depend on actual events being triggered:</p>\r\n<ul><li>On Spell Changed\r\n</li><li>On Unit Changed\r\n</li><li>On Stacks Changed\r\n</li><li>On Combat Event\r\n</li><li>On Left Click\r\n</li><li>On Right Click\r\n</li></ul>\r\n<p>A half-and-half solution isn't very interesting or intuitive. What I might still do is add a new event that can be triggered by condition state change (what you proposed originally).</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-05-11T02:26:39Z"},{"body":" <p>Well, three months later and it looks like the condition system has evolved itself into something that would make this possible. I can't make any guarantees or give any timelines right now, since there is still a bit of work to be done, but events based on conditions passing/failing looks like a definite possibility.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-08-11T03:51:06Z"},{"body":" <p>Events based on conditions are still very much possible. Not a top priority, but they would not be hard to implement once I get around to it.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-08-26T11:37:31Z"},{"body":" <p>Well, it took 6 months, but I added events that are triggered by conditions in r647</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-11-05T05:32:00Z"}]}