{"issue":{"title":"[CF 505] Interrupts ","body":" <p>&nbsp; &nbsp; Emophia</p><p>&nbsp; &nbsp; Is it possible to use this addon to tell when you are interrupted?</p><p>&nbsp; &nbsp; It has it for when youre stunned, silenced, rooted, slowed, but I couldn't find anything for interrupted.</p><p>&nbsp; &nbsp; Is there a keyword I'm missing or does it not keep track of it?</p><p>&nbsp; &nbsp; Thanks.</p><p>&nbsp; &nbsp; Cybeloras</p><p>&nbsp; &nbsp; Blizzard doesn't provide any reliable way to determine when you are interrupted (as far as I know, anyway) aside from just looking at all of your cooldowns and seeing if there are many of them with the same, long cooldown, but this method of checking for interrupts can lead to many false positives, which is why I have chosen not to implement such a feature.</p><p>&nbsp; &nbsp; If there is another addon that you know of that is able to track interrupts, let me know and I will see if I can get any ideas from it on how to best implement such a feature into TMW.</p><p>&nbsp; &nbsp; IcewolfDK</p><p>&nbsp; &nbsp; The quartz castbar will list on the cast if you are interupted when casting it.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/505\">#505</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/505.html\">Raw</a>","closed":true,"closed_at":"2012-11-23T23:13:32Z","created_at":"2012-06-10T17:24:05Z","updated_at":"2012-11-23T23:13:32Z","labels":["resolved"]},"comments":[{"body":" <p>This will be possible with the release of WoW patch 5.1.0 and the new loss of control UI. A new icon type was included in TMW v6.1.0 that will appear when WoW 5.1.0 goes live.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-11-23T23:13:23Z"}]}