{"issue":{"title":"[CF 506] Rotation helper addon built on top of TMW ","body":" <p>I have posted some of my thoughts on <a href=\"http://forums.wowace.com/showthread.php?t=20059\" rel=\"nofollow\">http://forums.wowace.com/showthread.php?t=20059</a>.<br>Hope you might be interested in implementing such features.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/CuteBunny\">CuteBunny</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/506\">#506</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/506.html\">Raw</a>","closed":true,"closed_at":"2012-11-03T05:20:36Z","created_at":"2012-06-26T08:46:23Z","updated_at":"2012-11-03T05:20:36Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>I'm not sure if this would be something that I would be wanting to implement myself, but I will tell you that the reason for the lack of updates for such a long time is that I am currently in the process of writing an entire framework to allow things like this (among many other things, like different display methods) to be build very easily.</p>\r\n<p>Currently, the only real extensibility that exists is in icon types, but even still, there is no support for adding configuration for a custom icon type. Under the new TMW, icon types and their configuration are 100% self-contained, which would make this much more easy to be implemented.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-06-27T02:50:36Z"},{"body":" <p>I have quite solid programming experience in JavaScript, its design is quite similar to Lua (prototype/metatable-oriented programming). But I have no experience in making addons in WoW at all. So if you will to be my mentor I would like to join your work. I have an idea to implement something like Ext JS (JavaScript framework) - start from the ground and implement custom class system with support of constructors, inheritance, mixins, statics, getters and setters; create widget system with support of rapid creation based on config object and identifying alias; implement MVC pattern to make all addons be real projects. That are my thoughts which may be far away from yours but I would like to be helpful anyway.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/CuteBunny\">CuteBunny</a>","created_at":"2012-06-27T10:18:51Z"},{"body":" <p>TMW already has its own class library that I wrote. It isn't necessarily the best or the most feature-complete, but it does everything that I have needed it to do so far, and since it is unique to TMW, I can add features to it whenever I want.</p>\r\n<p>Right now I am starting to regret the massive rewrite that I started because I'm at the point where every solution to a problem turns into 2 new problems. I suppose I will get through it though. i am trying to work on it as hard as I can before addons become available in beta and I have to focus my attention on updating for gameplay changes instead of framework changes within TMW.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-06-29T01:59:41Z"},{"body":" <p>Going to close this one. I just don't have enough time anymore to be able to devote to TMW and/or to helping you learn TMW's systems so that you can develop for it.</p>\r\n<p>If you are still interested, though, then let me know and maybe we can work something out.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-11-03T05:19:33Z"}]}