{"issue":{"title":"[CF 507] 6.0.0 is here! (READ ME) ","body":" <p>TMW v6.0.0 is finally here! Please do not post tickets about the following known issues:</p>\r\n<ul><li>The developer framework for TMW is not complete. Don't waste your time trying to use it (and good luck, because it isn't even documented yet), because it will probably change.\r\n</li><li>The main tab of the icon editor looks like crap. I plan on redoing all of the config panels so that every single one takes up the full width of the icon editor. It isn't what you are going to be used to, but it sure will make layout a million times easier.\r\n</li><li>The icon editor is really tall now. I know, I just wanted to make sure all config panels will fit without a scrollbar (scrollbar makes it irritating to test). A scrollbar will be added sometime soon, though, and the icon editor will return to a more normal height. The only real issue with the current height is that the events tab is not designed around a variable height - everything else should look fine.\r\n</li></ul>\r\n<p>Please DO post tickets about any other issues you are having, though! Lets squash those bugs!</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/507\">#507</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/507.html\">Raw</a>","closed":true,"closed_at":"2012-08-11T03:53:20Z","created_at":"2012-07-02T01:44:27Z","updated_at":"2012-08-11T03:53:20Z","labels":["invalid"]},"comments":[{"body":" <p>Some notes for myself so I don't forget them:\r\nThese things still need a class-based implementation to allow extensibility (especially for third-party extensibility):</p>\r\n<ul><li>Conditions\r\n</li><li>Events</li></ul> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-07-02T04:52:05Z"},{"body":" <p>Marking as invalid as none of this information is applicable anymore.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-08-11T03:53:11Z"}]}