{"issue":{"title":"[CF 51] Suggestion: highlight DoT icons when only 1 tick remains. ","body":" <p>Hey, wanted to suggest the following feature that would greatly benefit DoT classes: add an option for DoT icons to show(for example change the color of timer/ButtonFacade \"highlighted\" cloror) when the second to last tick has occurred. As of 4.0 it's optimal to refresh dots between the last 2 ticks but with the varying haste levels it can be quite difficult to know if there are 1 or more ticks left by just looking at the timer. So it would be neccessary to check the combat log for dot damage intervals every time it's refreshed not just use default ones that are only true for 0% haste.</p><p>To go even further, it would be helpful that in the case of DoT's with casting time(Vampiric Touch, Immolate, Unstable Affliction) the icon would light up when there is 1 full tick interval + cast time of that DoT left on timer to make it easier to refresh on time. For example, a Vampiric Touch that deals damage every 2 sec and has a cast time of 1 sec would have it's icon change 3 sec before it falls off.</p><p>I really hope that something like that can be implemented into TMW at some point, would make the addon very popular amongst Shadow Priests and Affliction Warlocks.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Entitulus\">Entitulus</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/51\">#51</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/51.html\">Raw</a>","closed":true,"closed_at":"2010-11-24T19:08:05Z","created_at":"2010-11-24T11:50:43Z","updated_at":"2010-11-24T19:08:05Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>With all due respect, this sounds like a learn to play issue. Show the timers and the timer text on icons and know at what time the appropriate dot ticks occur at. This would require a significantly greater amount of complexity and CPU usage that I really don't want to bog people down with (registering COMBAT_LOG_EVENT_UNFILTERED sucks).</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2010-11-24T19:07:56Z"}]}