{"issue":{"title":"[CF 518] No icon groups in config mode for Resto Druids (MoP Beta) ","body":" <h4>Submitted Via</h4>\r\n<p>Curse Client 5.1.1.410, Microsoft Windows NT 6.1.7601 Service Pack 1</p>\r\n<h4>Installed Version</h4>\r\n<p>r529-nolib</p>\r\n<h4>Description</h4>\r\n<p>Command \"/tmw\" does not open the config mode correctly. There's the message \"You are in config mode\" but there are no panels (icon groups) visible.</p>\r\n<h4>Steps to Reproduce</h4>\r\n<p>Type \"/tmw\" or open config via interface menu.\r\nInstalled addons (incl. their requ. libs):\r\n- Clique\r\n- Dominos\r\n- Quartz\r\n- TellMeQhen\r\n- VuhDo\r\nTried also to install requ. libraries for all installed addons separately but same behaviour.\r\nKind regards,\r\nWytheron@Zuluhed</p>\r\n<h4>Installed Addons</h4>\r\n<p>Ace3 - Release-r1041\r\nAceGUI-3.0-SharedMediaWidgets - v3.4.1\r\nCallbackHandler-1.0 - 1.0.7\r\nClique - v40300-1.5.2\r\nDominos - 4.3.4\r\nDRData-1.0 - v2.7-1-g1608067\r\nLibDogTag-3.0 - r250\r\nLibDogTag-Unit-3.0 - r232\r\nLibSharedMedia-3.0 - 6\r\nLibStub - 1.0.2-40200\r\nQuartz - 3.0.8-nolib\r\nSharedMedia - r182\r\nTellMeWhen - r529-nolib\r\nVuhDo - VuhDo 2.138</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/wytheron\">wytheron</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/518\">#518</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/518.html\">Raw</a>","closed":true,"closed_at":"2012-08-15T09:44:24Z","created_at":"2012-08-06T01:00:44Z","updated_at":"2012-08-15T09:44:24Z","labels":["defect","resolved"]},"comments":[{"body":" <p>Seeing as you are using an alpha version, your probably not a new user of TellMeWhen, but I will offer these basic suggestions anyway, just in case: If there are no groups shown in config mode, this could indicate a few things:</p>\r\n<ol><li>None of your groups are set to show for your current talent tree (Balance, Feral, Restoration)\r\n</li><li>None of your groups are set to show for your current talent specialization (Primary/Secondary)\r\n</li><li>Your groups have been moved off your screen (unlikely, but possible.)\r\n</li></ol>\r\n<p>All of the above issues can be solved by typing '/tmw options' and changing these settings for your current groups, or by adding new groups.</p>\r\n<p>What is the much more likely cause of the error, however is that there is a Lua error occurring that is preventing the proper execution of the code that handles TMW's configuration mode. Make sure Lua errors are enabled in Blizzard's interface options (under the Help sub-category) and post any errors that pop up that pertain to TellMeWhen.</p>\r\n<p>If you already have Lua errors enabled, however, and no errors are occurring, then the best way for me to diagnose this issue would be to have you upload your SavedVariables file. Saved variables can be found in: \"<code>World of Warcraft/WTF/Account/&lt;Account Name&gt;/SavedVariables/TellMeWhen.lua</code>\". You can paste the contents of the file to <a href=\"http://wow.curseforge.com/paste/\" rel=\"nofollow\">http://wow.curseforge.com/paste/</a> and link to it here, or user another method to provide me with the file.</p>\r\n<p>Looking forward to getting your issue resolved! Thank you for using TellMeWhen!</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-08-06T01:46:45Z"},{"body":" <p>Hi Cybeloras!</p>\r\n<p>Thanks for the quick reply.\r\nI've already checked the points you suggested (talent spec, primary/secondary spec).</p>\r\n<p>What I did:\r\nI took the config file from the live cata client and searched/replaced all occurences of character and realm name to the ones of my toon on the beta server.\r\nAfter the first start (having no other addons installed/active at this point of time) all my groups where there, but some of the displayed icons had a fency lime color, so I adjusted the Custom Icon value to use the proper icon/spell IDs.\r\nAfter that maybe I became a little too brave and installed the other addons mentioned in my initial posting.\r\nFrom this moment on I was not able to get the groups back to be displayed.\r\nI also reset the whole TMW configuration (deleted config file) and installed libs separately for each addon but it didn't work out.</p>\r\n<p>I will try to enable LUA error output when I'm back at home tonight and provide the information for you.</p>\r\n<p>What would be the best way to reset the groups to the screen center in case they dropped off the screen or is there any way at all besides deleting the config file? (^-^)</p>\r\n<p>Kind regards,\r\nWytheron</p>\r\n<p>BTW: I <span>&lt;3</span> TMW and I missed it very much when I did my first serious Beta gaming yesterday. <span>;)</span></p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/wytheron\">wytheron</a>","created_at":"2012-08-06T14:47:45Z"},{"body":" <p>To reset group position, go into the group settings, click the position tab, and click 'reset position'.</p>\r\n<p>Try disabling all addons except TMW and see if it comes back. If it does, slowly enable your addons a few at a time until you find the one that is causing the issue. Let me know what addon it is so that I can look into a fix.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-08-06T22:01:57Z"},{"body":" <p>Hi!</p>\r\n<p>Sorry for the late reply...didn't have the time to, sorry. (-_-)</p>\r\n<p>OK, so I deleted the WTF and Interface folders and reinstalled every addon from scratch.\r\nSince then all of my addons are working.\r\nI dont' know what messed up the config but now it is OK.\r\nSorry for bugging you! (<sup>)</sup></p>\r\n<p>Thanks for your patience, I really appreciate what you're doing here!\r\n-Wytheron-</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/wytheron\">wytheron</a>","created_at":"2012-08-09T21:17:13Z"},{"body":" <p>I would much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much much rather have you post your saved variable so that I can figure out what the cause of the issue so that I don't have to make 200,000 other users delete their saved variables as well.</p>\r\n<p>But, I'm still glad to hear that you managed to get yours working again. The fact that a saved variables reset fixed the problem does help a little bit in diagnosing the issue.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-08-09T22:42:09Z"},{"body":" <p>Hey again,</p>\r\n<p>as I'm a very cautious kid, I did save my previous (not working) account settings in the WTF folder.\r\nWhat exactly do you need?</p>\r\n<p>Kind regards,\r\n-Wytheron-</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/wytheron\">wytheron</a>","created_at":"2012-08-13T20:27:24Z"},{"body":" <p>And again it's me,</p>\r\n<p>and I've got to tell you something very.....very very very embarassing. (-.-)\r\nI just tried my old configuration from my saved stuff and again...no groups where showing....\r\nthen as I typed \"/tmw options\" into the chat box and selected the groups....it dawned on me......ALL spec check boxes are checked by default except.....yes....except the \"Restoration\".\r\nGuess what my primary spec was (and still is) when I tried to configure TMW? YES! Restoration!</p>\r\n<p>Why is it the only spec not checked by default for a group? Don't get me wrong, I do in fact blame myself for being so blind, but you have to admit that it is a little mean for Restos. <span>;)</span></p>\r\n<p>Kind regards,\r\n-Wytheron-</p>\r\n<p>PS: I'm really sorry for having wasted a little of your time. (-.-)'</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"08 13 2012 15:43:01 (CST) (UTC-5:00)\" data-epoch=\"1344890581\">Aug 13, 2012</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/wytheron\">wytheron</a>","created_at":"2012-08-13T20:40:56Z"},{"body":" <p>That is very, very strange. They should all three be checked by default. I will go investigate right now.</p>\r\n<p>For the saved variables, I need <code>World of Warcraft/WTF/Account/&lt;ACCOUNT NAME&gt;/SavedVariables/TellMeWhen.lua</code>. Having this might help me figure out why resto was unchecked.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-08-13T21:52:30Z"},{"body":" <p>And it gets even stranger.....because in all my desparation (before I got it to work) I deleted the TMW lua files. So in my SavedVariables folder there are only lua files for:\r\n- Blizzard_CombatLog\r\n- Clique\r\n- Dominos\r\n- Quartz\r\n- Recount\r\n- Vuhdo\r\nand\r\n- VuhdoOptions</p>\r\n<p>When I start WoW (Beta Client) without a TellMeWhen.lua in &lt;wow_folder&gt;\\WTF\\Account\\&lt;my_account&gt;\\SavedVariables\\ (as it would be when freshly installed, right?) the \"Restoration\" check box is not checked.</p>\r\n<p>What confuses me a little is that you said \"they should all three be checked by default\" but keep in mind that druids now have not only 3 but 4(!) talent specs (Guardian, Feral (DPS), Balance and Restoration).\r\nMaybe this is where the trouble lies. Are the check boxes iterated over (array style) and the index variable used only counts to 3 instead of 4 when initializing the checked state?</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/wytheron\">wytheron</a>","created_at":"2012-08-13T22:32:37Z"},{"body":" <p>Oh, crap. I forgot about that. The number of specs is hardcoded as 3 (In the default settings. The checkboxes in the group options are generated dynamically), which would be the problem. Should get fixed in the next revision.</p>\r\n<p>No need for you to upload your saved variables now, since that is definitely the problem.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"08 13 2012 17:36:50 (CST) (UTC-5:00)\" data-epoch=\"1344897410\">Aug 13, 2012</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-08-13T22:35:56Z"},{"body":" <p>Yaaaaaayyyy!!!! Great!</p>\r\n<p>And I finally was able to add some kind of contribution. (<sup>)</sup></p>\r\n<p>Thank you!\r\nSee ya!\r\n-Wytheron-</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/wytheron\">wytheron</a>","created_at":"2012-08-13T22:40:17Z"}]}