{"issue":{"title":"[CF 519] \"Unit(s) to watch\" is not updated by dropdown selection alone. Needs dropdown + semicolon or typed in manually. ","body":" <p>When changing the Field: \"Unit(s) to watch:\" for Buffs/Debuffs from the default of Player to anything, the change is only recorded if I add a trailing semicolon after using the drop down menu or if I type in \"target\". The act of selecting the drop down menu \"Target\" or \"Focus\" does not in and of itself save the change.</p><p>What steps will reproduce the problem?<br>1.&nbsp; See above.<br>2.<br>3.</p><p>What do you expect to happen? What happens instead?<br>Expected drop down selection to effect a change in the status of the field.&nbsp; No change in the status of the field is recorded.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>r528 (beta for MoP)&nbsp; This is something that has happened in prior versions as well.</p><p>Do you have an error log of what happened?<br>No errors, just no change in the configuration.</p><p>Please provide any additional information below (including any export strings if applicable; see above.)<br>I'd be happy to provide any additional information you may deem useful.&nbsp; If absolutely necessary, I could fraps the issue as I come across it.&nbsp; It has occurred for every debuff I've attempted to configure to track target debuffs.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/sideburnz\">sideburnz</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/519\">#519</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/519.html\">Raw</a>","closed":true,"closed_at":"2012-08-16T06:39:07Z","created_at":"2012-08-06T03:51:51Z","updated_at":"2012-08-16T06:39:07Z","labels":["defect","resolved"]},"comments":[{"body":" <p>This seems to be one of the most error prone aspects of TMW for some reason. Thank you for reporting this; I will look into getting it fixed when I get a chance.</p>\r\n<p>In the mean time, after you change the unit using the dropdown, click on the editbox and then press enter to make sure that the setting saves correctly.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-08-06T04:03:21Z"},{"body":" <p>KILL IT WITH FIRE!</p>\r\n<p>( I just removed that dropdown. The suggestion list has taken over its functionality.)</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-08-16T06:38:37Z"}]}