{"issue":{"title":"[CF 566] Animations should reset when an buff fades. ","body":" <p>What steps will reproduce the problem?<br>1. Set an icon to appear when a buff is applied.<br>2. Set an Event to \"Animate Flash\" when a low duration is on the buff.</p><p>What do you expect to happen? What happens instead?</p><p>When the buff is refreshed (so the duration on the buff is no longer below the threshold) the animation event should stop.&nbsp; Instead it persists even if the buff falls off, and is then reapplied at full duration.</p><p>Sometimes, the icon will not disappear at all when the buff condition is not met.&nbsp; (I have only managed to reproduce this (unreliably) with the Surge of Darkness buff (Shadow Priest talent))</p><p>It may be that the event is taking \"Play Indefinitely\" more seriously than I expect.&nbsp; It would appear to me that once the event's condition is no longer satisfied, the event should no longer apply.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>r567</p><p>Do you have an error log of what happened?</p><p>Please provide any additional information below (including any export strings if applicable; see above.)</p><p>^1^T^SShowTimer^B ^SOnlyMine^B ^SType^Sbuff ^SName^Sglyph~`of~`mind~`spike ^SInvertPBar^B ^SEvents^T ^N1^T ^SPassingCndt^B ^SType^SAnimations ^SCndtJustPassed^B ^SOnlyShown^B ^SValue^N2 ^SAnimation^SICONALPHAFLASH ^SEvent^SOnDuration ^SInfinite^B ^t^Sn^N1 ^t^SEnabled^B ^t^N60302^S~`~| ^Sicon^^</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/theondry\">theondry</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/566\">#566</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/566.html\">Raw</a>","closed":true,"closed_at":"2012-08-31T20:33:57Z","created_at":"2012-08-31T16:59:36Z","updated_at":"2012-08-31T20:33:57Z","labels":["enhancement","invalid"]},"comments":[{"body":" <p>In retrospect, maybe I should have titled it \"Event settings should not apply if event conditions are not meant\"... maybe it's a bug?</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/theondry\">theondry</a>","created_at":"2012-08-31T17:00:27Z"},{"body":" <p>Events aren't handled for the whole time that their conditions are satisfied. They are handled once when their conditions become satisfied (If an event even has conditions. Most events are just in response to a specific yet basic occurrence, and no conditions are needed to refine when the event is fired).</p>\r\n<p>If this wasn't the case, then a sound or text event handler would explode your ears or get you banned for spamming because they would go off continually while the condition is satisfied.</p>\r\n<p>If you want to stop an animation, use the animation \"Icon: Stop Animations\" an attach it to an event handler that will stop the animation at the appropriate time.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"08 31 2012 15:33:46 (CST) (UTC-5:00)\" data-epoch=\"1346445226\">Aug 31, 2012</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-08-31T20:30:56Z"}]}