{"issue":{"title":"[CF 574] Icons with Absent condition set are dimming after reloadui or zoning ","body":" <p>To reproduce:</p><p>Create a group containing two icons, both set for buff on player, I use the spell Arcane Brilliance.<br>Set one icon to 100% opacity for Present and 100% opacity for Absent.<br>Set the other icon to 100% opacity for Precent, and Absent unchecked.<br>Exit TMW config mode.<br>Cast Arcane Brilliance.<br>Both icons will be at full \"brightness\" (I'm not sure opacity is involved, although it might be, it's hard to tell for me).<br>Next, reloadui or change zones.&nbsp; One icon (the one with an Absent condition set) will switch to a lower \"brightness\" level.&nbsp; The only way to fix it is to relog, or enter and exit TMW config mode.</p><p>Here's my export for the test group I was using for the above two icons:</p><p>^1^T^SPoint^T ^Sy^F-6305038404576841 ^f-48^Sx ^F-4699070155945249^f-45 ^Spoint^SRIGHT ^SrelativePoint^SRIGHT ^t^SEnabled^B ^SColumns^N2 ^SIcons^T ^N1^T ^SType^Sbuff ^SName^SArcane~`Brilliance ^SEnabled^B ^t^N2^T ^SType^Sbuff ^SName^SArcane~`Brilliance ^SShowWhen^N3 ^SEnabled^B ^t^t^SName^STest~`Group ^t^N60206^S~`~| ^Sgroup^N8 ^^</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/ywfn\">ywfn</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/574\">#574</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/574.html\">Raw</a>","closed":true,"closed_at":"2012-09-10T08:53:23Z","created_at":"2012-09-02T11:28:52Z","updated_at":"2012-09-10T08:53:23Z","labels":["defect","resolved"]},"comments":[{"body":" <p>I should mention, I'm using 6.0.2.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/ywfn\">ywfn</a>","created_at":"2012-09-02T12:36:30Z"},{"body":" <p>Tried it with r571, just in case. Same problem.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/ywfn\">ywfn</a>","created_at":"2012-09-02T12:40:06Z"},{"body":" <p>Did some more testing, the problem only happens if the relevant buff (Arcane Brilliance in the example I gave) is up when you reloadui or zone. If you remove the buff, then reloadui, then cast the buff, the icon ends up looking as it should. However, if you cast the buff, reloadui, then remove the buff, then re-cast the buff, the icon's brightness/opacity/whatever is hosed.</p>\r\n<p>Also, in order for the problem to happen, it appears that both a Present and Absent opacity has to be set on the icon in question. If only one or the other is set, then the icon looks as expected.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/ywfn\">ywfn</a>","created_at":"2012-09-04T06:58:13Z"},{"body":" <p>Also, besides zoning or reloadui, another thing that causes the icons to dim is going into the TellMeWhen colors config, buffs/debuffs page, and checking and then unchecking any box in there.</p>\r\n<p>Also, doing \"/tmw toggle #\" on the group twice.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"09 4 2012 06:45:36 (CST) (UTC-5:00)\" data-epoch=\"1346759136\">Sep 4, 2012</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/ywfn\">ywfn</a>","created_at":"2012-09-04T11:23:40Z"},{"body":" <p>I just haven't gotten around to this ticket yet. No need to start posting in two different places to try to get my attention.</p>\r\n<p>Deleting your comment on Curse.com; preserving it here:</p>\r\n<blockquote><cite>Quote from ywfn:</cite><p>I posted ticket 574 on curseforge about icon opacity not working properly when an icon has both a present and absent opacity set. To me this seems like a big problem that I'm surprised more people aren't running into. So, now I'm wondering if maybe there's a more logical way to do what I'm trying to do. But I haven't been able to find one...</p>\r\n<p>What I'm trying to do: for the new debuff/buff system, I've created a small row of icons for each buff/debuff class. Each icon is also labelled (like \"SP\" or \"AP\", etc). When the buff is up (on me) or the debuff is up (on my target), I want the corresponding icon to light up fully, but when the debuff is down, I want it very dim (25% opacity), as the icon and text need to still be readable, but just barely (so that you know what you're missing).</p>\r\n<p>Is there another way of achieving this?</p>\r\n</blockquote> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-09-06T00:03:52Z"},{"body":" <p>Sorry, wasn't trying to get your attention specifically, was really just wondering if there is a better (or at least alternate) way to do what I'm trying to do with TMW. But judging from your reply, I'm guessing there isn't <span>:)</span></p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/ywfn\">ywfn</a>","created_at":"2012-09-06T00:45:40Z"},{"body":" <p>Well, I figured out the bug with colors (the original bug in this ticket)</p>\r\n<p>As for the question in your comment, I'm not exactly sure what you are asking. You ask if there is another way of achieving the setup that you described without explaining why the existing setup doesn't work for you. It seems like a perfectly normal setup to me that would do exactly what you want it to do.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-09-06T00:49:51Z"},{"body":" <p>Try r581 and see if that fixes the original issue.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-09-06T02:02:41Z"},{"body":" <p>Hmm, r581 actually looks worse than it was before. Now the colors are always dimmed, instead of just being dimmed after a reload / zoning / toggle / etc. If you put two icons side-by-side, one with Present 100% and Absent 100%, and the other with Present 100% and Absent turned off, the former one will always be very dim compared to the latter. If you have an icon with Present 100% and Absent 100%, and the buff is up, you will also notice it become much more dim immediately after exiting config mode.</p>\r\n<p>And as far as what I was saying on my Curse post, I was basically asking if someone out there had found some kind of workaround, since what I'm doing obviously isn't working right and I figured someone else out there must be using a similar setup as well. Just forget I ever posted it, probably <span>:)</span></p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"09 5 2012 23:24:43 (CST) (UTC-5:00)\" data-epoch=\"1346905483\">Sep 5, 2012</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/ywfn\">ywfn</a>","created_at":"2012-09-06T04:20:44Z"},{"body":" <p>Its doing exactly what it is configured to do. Might I recommend going in to the color settings and changing the colors that buff/debuff icons use?</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-09-06T04:24:18Z"},{"body":" <p>I have no colors configured on any of my groups. </p>\r\n<p>The appearance of two identical icons differs vastly depending on whether I turn on the \"Absent\" checkbox or not (on a buff that is currently up). In that case, the Absent checkbox being on shouldn't even be changing anything right?</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"09 5 2012 23:29:13 (CST) (UTC-5:00)\" data-epoch=\"1346905753\">Sep 5, 2012</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/ywfn\">ywfn</a>","created_at":"2012-09-06T04:27:45Z"},{"body":" <p>It should be changing the colors used, and it does. Change the \"Counting, Timer Shown, Always Shown\" color setting. Change that setting if you are unhappy with its current value.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-09-06T04:44:57Z"},{"body":" <p>Ahh, I see now, that's the missing link that I wasn't getting. The default color for \"Counting, Timer Hidden, Always Shown\" is grey, while the default color for everything else is full white. I changed that and now it works as I'd expect in the newest version. Everything makes more sense now, I saw that you had said that colors weren't working, but I didn't realize they were related to my problem in an indirect way. (I'm going to guess that colors NOT working was what was actually making my stuff work properly, at times, since the grey wasn't applied, hah) Thanks for your patience and the great addon, I sent in a donation a couple days ago after I saw on Curse that you said you hadn't gotten any since April...</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"09 6 2012 00:40:04 (CST) (UTC-5:00)\" data-epoch=\"1346910004\">Sep 6, 2012</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/ywfn\">ywfn</a>","created_at":"2012-09-06T05:30:32Z"},{"body":" <p>Must have missed the email notification for your latest comment - thank you very much for the donation!</p>\r\n<p>Going to mark this as fixed now since it looks like we've gotten everything sorted out.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-09-10T08:53:02Z"}]}