{"issue":{"title":"[CF 577] Show an icon excluding the middle of a duration/stack ","body":" <p>There is currently a way to display an icon while a certain minimum and maximum durations are met.&nbsp; This only works if the Minimum is less than the Maximum.&nbsp; So, for a buff with a duration of 10 seconds, you could get it to display between seconds 3 through 7.</p><p>Is it possible to display during the other part of the set?&nbsp; Such that, for the same 10 second buff, it is displayed for seconds 0 through 3 and 7 through 10?&nbsp; Or simply, rather than 3 &lt; T &lt; 7, instead display during 7 &lt; T &lt; 3?</p><p>(Also, is it possible to apply this condition to stacks?&nbsp; The specific conditions I'd like to apply it to are when Metamorphosis is Above 800 or Below 300.)</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/theondry\">theondry</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/577\">#577</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/577.html\">Raw</a>","closed":true,"closed_at":"2012-09-12T04:19:03Z","created_at":"2012-09-03T01:41:20Z","updated_at":"2012-09-12T04:19:03Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>The best way to do this would be to use conditions instead of the duration/stack requirements on the main tab.</p>\r\n<p>The duration/stack requirements on the main tab were initially added as a quick and easy way to set these requirements so that you don't have to go and setup conditions just to do something so basic. What you are describing is a little more advanced, so it would best be done with conditions (Since conditions allow you to specify the operators of the requirements and the boolean logic between the two.)</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-09-03T02:18:00Z"}]}