{"issue":{"title":"[CF 578] Ability to select a specific group when groups overlap... ","body":" <p>I have a number of groups which occupy the same space on the screen (i.e. they overlap exactly), and it is difficult to select a particular group, unless I have missed that feature.&nbsp; What I do now is I select the top group, move it out of the way, etc. until I get to the right group to work on.</p><p>If I have missed how to do this, let me know.</p><p>What would be good is a way to select, or make active/focus, a particular group.&nbsp; One potential way that seems logical would be to allow a 'set focus' button from the 'Group Settings' tab.&nbsp; For my overlapping groups, I could right-click the top layer, click on the Group Settings, select the real group I want to work with and click 'set focus'.&nbsp; I am sure there are lots of other ways to do this .. just a suggestion.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Stanoslav\">Stanoslav</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/578\">#578</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/578.html\">Raw</a>","closed":true,"closed_at":"2012-09-16T19:57:52Z","created_at":"2012-09-03T04:28:29Z","updated_at":"2012-09-16T19:57:52Z","labels":["enhancement","resolved"]},"comments":[{"body":" <p>I've really wanted to do this for a long time. I just have the memory of a small insect when it comes to having free time to work on features that I've wanted to work on for a long time.</p>\r\n<p>Most likely implementation will be a dropdown menu when you right-click an icon that has other icons underneath it.</p>\r\n<p>Your set focus idea wouldn't work if the two groups are set at different frame levels or frame stratas because it would involve hackily modifying the frame level and/or frame strata only in config mode.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-09-03T04:36:14Z"},{"body":" <p>Cybeloras ... your suggested implementation sounds great. Really just anyway you think is best/easiest works for me (I obviously don't know all the 'gotchas' like you do). Looking forward to this quality of life tweak. <span>:)</span></p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Stanoslav\">Stanoslav</a>","created_at":"2012-09-03T13:13:55Z"},{"body":" <p>For now, I've always found that it's easier to temporarily disable the group that's on top, then you can get at the group below it. Easier than moving things around then having to move them back into the right place later.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/ywfn\">ywfn</a>","created_at":"2012-09-04T06:22:24Z"},{"body":" <p>Added in r615</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-09-16T19:57:41Z"}]}