{"issue":{"title":"[CF 584] Paladin Seals ? ","body":" <p>IMPORTANT: If your issue is only occurring with a specific icon, include an export string of the icon in this ticket. Subsequently, if the issue involves an entire group or an entire profile, include the entire export string of the group or profile.</p><p>To get an export string, open the icon editor, and click button labeled \"Import/Export/Backup\". Select the \"To string\" option for the appropriate export type (icon, group, or profile), and then press CTRL+C to copy it to your clipboard.</p><p>FAILURE TO COMPLY WITH THE ABOVE INSTRUCTIONS WILL RESULT IN YOUR TICKET BEING INVALIDATED.</p><p>What steps will reproduce the problem?<br>1. Can't show the Paladin Seals in Tellmewhen<br>2. or I don't know to let them show, I have all tried, as Buff, as Condition, as Reactiv.....<br>3. Is there any way to show Paladin Seals in Tellmewhen ?</p><p>What do you expect to happen? What happens instead?</p><p>What version of TellMeWhen are you using? r575</p><p>Do you have an error log of what happened?</p><p>Please provide any additional information below (including any export strings if applicable; see above.)</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/cernykocky\">cernykocky</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/584\">#584</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/584.html\">Raw</a>","closed":true,"closed_at":"2012-09-03T23:04:30Z","created_at":"2012-09-03T22:20:09Z","updated_at":"2012-09-04T00:25:32Z","labels":["enhancement","invalid"]},"comments":[{"body":" <p>I got it, Tellmewhen show me again my Seals <span>:-)</span></p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/cernykocky\">cernykocky</a>","created_at":"2012-09-03T23:05:19Z"},{"body":" <p>For anybody who may come across this while searching for how to track paladin seals in TellMeWhen:</p>\r\n<p>Seals are considered to be stances now, which means that they can only be tracked by a condition. This condition can be found in the \"Player Attributes\" condition category, called \"Seal\".</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-09-04T00:25:32Z"}]}