{"issue":{"title":"[CF 590] graphic personalization ","body":" <p>Hello, i'm looking for some info:</p><p>1) it's possible to select a specific icon instead of using the same of the buff/spell object of the check?<br>2) it's possible to specify a different alpha % of the TIMER BAR OVERLAY, for example 60% alpha for the icon, but 100% alpha for the TIMER BAR, so the countdown is more visible?<br>3) it's possible for the TIMER BAR OVERLAY (but also for the TIMER SWEEP animation)&nbsp; to start from the BEGINNING of the icon, instead of at the % of the TOTAL tracked cooldown? Example: if i'm tracking a long cooldown (20 sec) and i want the icon appears with a countdown bar at 3 second from the end of the cooldown, when the icon appears i see an almost-fully filled cooldown bar (85%, because 3 seconds are only the 15% of the total 20seconds of the whole cooldown), so the countdown bar is graphically represented on a small remaining space of the whole icon (only 15%): not very understandable. My idea is to consider the whole icon width representing the 3 seconds REMAINING cooldown, so the bar can start from the BEGINNING of the icon (second 0 of 3), and move to the end of the icon (3 seconds) in a more visible way.<br>4) it's possible to show only the TIMER BAR instead of ICON+TIMER BAR OVERLAY? My idea is to place the timer bar overlay up to the \"original\" button (the same i press to spell), so i dont have useless additional icons, and only the bar counting down on the spell i have to press.</p><p>Thanks!</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/SmbSmb\">SmbSmb</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/590\">#590</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/590.html\">Raw</a>","closed":true,"closed_at":"2012-09-10T20:45:44Z","created_at":"2012-09-05T23:04:39Z","updated_at":"2012-09-10T20:45:44Z","labels":["declined"]},"comments":[{"body":" <p>1) That's what the custom texture setting is for (If i understand what you are asking)</p>\r\n<p>2) I have no idea what you are asking here. You want the timer bar to show at 60% opacity and at 100% opacity at the same time?</p>\r\n<p>3) No.</p>\r\n<p>4) No. Keybind your abilities and hide your action bars if you don't want redundancy.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-09-05T23:21:44Z"},{"body":" <p>Hello again.</p>\r\n<p>1) can i read somewhere about how texture settings works?</p>\r\n<p>2) no, very simple: ICON alpha 60%, TIMER BAR 100%. TIMER BAR is more important than the icon; the icon is only a picture, the timer \"tell me when\". ICON have the alpha settings, the overlayed TIMER BAR not.</p>\r\n<p>3) ok</p>\r\n<p>4) this will change completely the mode of play, not applicable <span>:-)</span> As workaround, what do you think about CLICKABLE ICON? So i can HIDE action bars, but i can click on the addon's icon, assigning the same spell to the event LEFT-CLICK.</p>\r\n<p>Thanks.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/SmbSmb\">SmbSmb</a>","created_at":"2012-09-06T09:30:23Z"},{"body":" <p>1) All the information you need is in the tooltip for the setting. For simple use, just type in the spell that you want to use the texture of and then choose it from the suggestion list.</p>\r\n<p>2) There is no way to only have the alpha settings only affect parts of an icon, and I don't plan on adding this any time soon.</p>\r\n<p>4) Clickable icons would be completely impossible in TMW without reducing the functionality of the addon down to something barely more useful than a normal action bar. So, aside from keybinding, there is no way to do what you are asking.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-09-06T09:37:10Z"}]}