{"issue":{"title":"[CF 610] An \"account-wide groups feature\" needed ","body":" <p>Groups that can be shared with all characters&nbsp; in one account.NO export and import needed because these groups are designed for all . .And some shared text layouts would be nice too..</p><p>I know it needs a lot of work to do this ,the whole structure of&nbsp; saved config files may need to change.</p><p>In&nbsp; powa there are auras for character only and auras for a whole account.It's very useful,</p><p>But when using tmw ,if i creat a group of icons to monitor pvp control status ,I need to export first and import for all other 9 characters.And when one day i changed it beeter in one character,I will need to do \" import\" and delete the old one for all 9 characters again,It's very inconvinient.</p><p>I notise that powa has two kind of config files,one in acccount\\SavedVariables,one in account\\server\\character\\SavedVariables,</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/yjcjh\">yjcjh</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/610\">#610</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/610.html\">Raw</a>","closed":true,"closed_at":"2012-11-03T03:49:29Z","created_at":"2012-09-12T09:09:16Z","updated_at":"2012-11-03T03:49:29Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>I've thought about this for a while now, and what I have come up with is this:</p>\r\n<p>TellMeWhen is just too far along now to be able to get this implemented. Account-wide groups would require sweeping changes to one of the most fundamental parts of TMW (groups), and I just don't have the time to do something like this anymore. TellMeWhen was designed and built around the idea of profile-specific groups.</p>\r\n<p>Probably the biggest obstacle is the assignment of groupIDs - icons and groups depend upon the fact that each group will always have the same ID all the time (and it is only adjusted when a group is added/deleted/moved within a profile. Now, if you were to create an account-wide group, what groupID would it be assigned? If they were assigned groupIDs starting at 1, it would require that all profiles shift their groupIDs (and any and all references to groups/icons within a profile would also have to be shifted to reflect this). If they were assigned groupIDs at the end of the current profile's groups, it would require that the groupIDs and groupID references of the account-wide groups be constantly shifted to reflect this.</p>\r\n<p>Also raised is the issue of referencing profile-specific groups from account-wide groups, and vice versa. Account-wide groups would not be able to reference profile-specific groups because these groups would not be the same for every character, so you would end up with nonfunctional and/or unintended references. Profile-specific groups and icons would not be able to reference account-wide groups and icons because the groupIDs of the account-wide groups could change at any time, including when your profiles are not loaded (and thus they cannot be aware of these changes).</p>\r\n<p>These are just a few of the challenges - there are way, way more, and certainly there are more that I haven't even been able to think of yet that would just make implementing something like this take way too long to justify the usefulness that it would provide.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-11-03T03:49:18Z"}]}