{"issue":{"title":"[CF 611] link param for text tag spell working opposite of documentation ","body":" <p>While setting up an event to output text, I noticed with the [Spell] tag that the value passed was producing the opposite result of what was listed in the help:<br>[[Spell(6,8,true)] created plain text<br>[Spell(6,8,false)] created a text link<br>Spell(6,8,nil)] created a text link</p><p>Oddly enough, if no value was passed then it worked as the help would leave you believe (that it would default to false and plain text):<br>[Spell(6,8)] created plain text</p><p>using version v6.0.2</p><p>As an aside I was trying to create a replacement for an event I had that included a link to an item as part of a humorous message.&nbsp; The brackets that were part of the item link started causing errors with the new version. I tried a few different approaches like using [Bracket()] around that part of item link, but nothing I tried worked. In the end I had to create a new item cooldown thats disabled and always hidden and just exists to provide an icon that the other tracker references through a Spell tag.&nbsp; If there are other ways that it could have been done, I'd be interested in seeing them (just for the sake of knowing how to do it, or what I missed trying to figure it out).</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/stencil\">stencil</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/611\">#611</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/611.html\">Raw</a>","closed":true,"closed_at":"2012-09-13T06:08:08Z","created_at":"2012-09-12T10:46:50Z","updated_at":"2012-09-13T06:08:08Z","labels":["defect","resolved"]},"comments":[{"body":" <p>Just played around with DogTag's parser for a few hours. Getting the compiler to recognize links as regular text instead of as tags was easy, but I/O has turned out to be a time vampire, so I think that the days of being able to shift-click links into the text output are done.</p>\r\n<p>What I will probably do is create some new tags like [ItemLink(itemID)], [SpellLink(spellID)], etc. Shift-clicking links into the text output will generate these tags instead of actual links.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-09-13T04:39:16Z"},{"body":" <p>Link behavior for item icon (the first half of your ticket) should now be working as intended in r604</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-09-13T04:47:17Z"},{"body":" <p>Well, in regards to the second part - sometimes the best solutions are extremely simple. They are also not usually the most obvious ones.</p>\r\n<p>Inserting links should work OK in r605 (no DogTag updates needed!). Just be aware that it is a bit strange in the way it works since the color has to be separated from the link. But, that also means that you can color your links whatever color you want (but only if not outputting to a Blizzard chat channel. They are very strict about outgoing links and their colors.)</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-09-13T05:38:17Z"},{"body":" <p>Going to mark as fixed. Please respond if there is still something not working right.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-09-13T06:06:47Z"}]}