{"issue":{"title":"[CF 62] Add a \"display icon\" option ","body":" <p>(Submit as a ticket per Cybeloras on the Curse.com comment page.)</p><p>Currently, the icon displayed is based on the contents of the \"Choose spell/item/buff/etc.\" setting.&nbsp; This is generally what you want.</p><p>However, for some procs, I find myself wanting to display the icon of the ability I want to use rather than the icon of the proc.&nbsp; (The example I gave was displaying the Howling Blast icon when Freezing Fog procs.)</p><p>With the new feature, I envision an extra field below the \"Choose...\" setting that would be \"Display icon.\"&nbsp; If empty or not set, it would follow the existing behavior.&nbsp; If it is set, it would follow the existing rules to determine whether or not to display, but if it does display, it would use the specified icon instead.</p><p>Thanks!</p><p>(Original text below, nothing new there.)</p><p>Second, I would love it if there were a way to override the icon displayed. I see this mainly applying to spontaneous procs. For example, on a DK, when Freezing Fog procs, I would like to have TellMeWhen pop up a Howling Blast icon, because I am just that dumb/lazy and can't remember the weird buff icons for every different proc on all the classes and specs I play. :-) Blizz has added a bunch of on-screen notifications for this stuff, but they're much more \"Power Auras\" style than TellMeWhen.. i.e. pretty but not useful. As with the above, one can get very close to this by having an intermediate icon for the buff and a display icon for the ability, but I thought it would be grand if this could be done without burning that extra precious icon slot. :-) (And/or by putting the intermediate icon in a separate group again.)</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Seladrei\">Seladrei</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/62\">#62</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/62.html\">Raw</a>","closed":true,"closed_at":"2010-12-18T21:50:42Z","created_at":"2010-12-13T02:58:24Z","updated_at":"2010-12-24T22:04:14Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>Good excuse for me to redo the choose name dialog, too</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2010-12-14T05:23:39Z"},{"body":" <p>Just changed my mind on this. Using your example provided, you could make a CD icon for howling blast that checks for a freezing fog buff icon. I think that this feature would just add more confusion and fluff to an addon that I am trying to keep really straightforward and simple.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2010-12-18T21:48:23Z"},{"body":" <p>I totally understand and respect that point of view. </p>\r\n<p>The issue I run into, which is why I brought this up, is that the number of icons isn't infinite. Ten bars of up to seven icons each seems like a lot, but with dual spec and the need to have various combinations of bar-wide settings, they go fast. Being able to eliminate intermediate icons that aren't independently useful buys me more space for fun stuff. <span>:)</span></p>\r\n<p>Anyway, thanks for considering it!</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Seladrei\">Seladrei</a>","created_at":"2010-12-24T22:04:14Z"}]}