{"issue":{"title":"[CF 63] Add conditional \"Icon Not Shown\" ","body":" <p>This would be the counterpoint to the \"Icon Shown\" conditional and would do exactly the same thing, only triggering if the specified icon is not shown.</p><p>Original text from curse.com:</p><p>First, I have run across a couple of abilities that have a cooldown that apply a buff with a different, longer duration. One example is the priest ability \"Power Word: Shield\" and another is the DK ability \"Bone Shield.\" I would really like to figure out a way to have these icons display only if the ability cooldown is up and the buff of the same name is absent. TellMeWhen is *almost* there. Currently, what I can do is make an icon for the Bone Shield debuff that displays if the buff is absent. Then, I can make a second icon for the Bone Shield cooldown and add a condition to display only if the Bone Shield debuff icon is shown. This works perfectly, but there are two drawbacks. First, an \"is not shown\" option for the icon conditional would give a bit more flexibility in making the intermediate icon more useful. (E.g. an icon showing that you do not have Power Word: Shield when you can't cast it is arguably less useful than an icon showing that you do have it with the remaining duration.) Second, I cannot seem to add a condition based on an icon in another group; ideally I would like to put all of the \"intermediate\" icons in a separate group by themselves and possibly/likely with \"fake hidden\" enabled.</p><p>---------------</p><p>1)Just set the icon that is being checked to display when unusable instead of usable, or vice versa, or am I not understanding this?</p><p>----------------</p><p>On #1, in the condition editor, under \"Type\" I'm wishing for the option \"Icon Not Shown\" after the option \"Icon Shown\" that would do the same thing in reverse.</p><p>This is a bit tricky because the utility of it doesn't apply to the icon you're editing, but to the icon your checking. It gives you the option to invert the other icon if that makes it more useful.</p><p>Consider Bone Shield. I don't want to Bone Shield myself if I already have Bone Shield on me.</p><p>So, I can currently make an \"intermediate\" icon that displays only if the Bone Shield buff is absent.</p><p>Then, I can make a \"final\" icon that displays if the Bone Shield cooldown is ready and (using conditional) the you-dont-have-boneshield intermediate icon is lit up.</p><p>So, functionally, I can do what I want.</p><p>However, if I do that, the intermediate icon spends most of the time shown to tell me I don't have a buff I can't cast. That's not particularly useful, so the design behavior seems to be to use \"Fake Hidden\" to keep it out of sight. Which, that's fine.</p><p>If I invert the intermediate Bone Shield buff icon, as you suggest, it now becomes useful and I don't have to hide it. (In this example, it can display the time &amp; number of charges left on Bone Shield.) However, this breaks the Bone Shield cooldown icon, because it now will only display when the Bone Shield buff is present, instead of absent.</p><p>I basically want a double negative. I want to invert the intermediate icon so it's useful (which can currently be done), and then invert the final icon's conditional to display if the intermediate one is NOT displayed (which currently cannot be done). This nets me the same original behavior with the added bonus that the intermediate icon conveys useful information.</p><p>Hope that clears it up.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Seladrei\">Seladrei</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/63\">#63</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/63.html\">Raw</a>","closed":true,"closed_at":"2010-12-20T20:13:58Z","created_at":"2010-12-13T07:35:50Z","updated_at":"2010-12-20T20:13:58Z","labels":["enhancement","resolved"]},"comments":[]}