{"issue":{"title":"[CF 632] v6.0.3: Timer Sweep Grays Out Buff/Debuff Stacks Number ","body":" <p>IMPORTANT: If your issue is only occurring with a specific icon, include an export string of the icon in this ticket. Subsequently, if the issue involves an entire group or an entire profile, include the entire export string of the group or profile.</p><p>To get an export string, open the icon editor, and click button labeled \"Import/Export/Backup\". Select the \"To string\" option for the appropriate export type (icon, group, or profile), and then press CTRL+C to copy it to your clipboard.</p><p>FAILURE TO COMPLY WITH THE ABOVE INSTRUCTIONS WILL RESULT IN YOUR TICKET BEING INVALIDATED.</p><p>What steps will reproduce the problem?<br>1. Make an icon with the buff/debuff type and choose a spell ID that has stacks and a limited duration, eg: Arcane Charge.<br>2. Check \"Show Timer\" under \"Timer Sweep\".<br>3.</p><p>What do you expect to happen? What happens instead?</p><p>I expect the stack number to be drawn on top of the timer sweep. It's being drawn under the timer sweep. The stack number is difficult to see after it's covered up, even with a larger font size. The color of the number is changing from white to dark gray because of the timer sweep. I thought I could change this in the text layouts, but I couldn't. I can see why some people would want it drawn under the sweep, but it would be nice for it being drawn on top to be put in as an option.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>I am using v6.0.3</p><p>Do you have an error log of what happened?</p><p>Please provide any additional information below (including any export strings if applicable; see above.)</p><p>Here's the export string of the icon in question:</p><p>^1^T^SShowTimer^B ^SBuffOrDebuff^SHARMFUL ^SConditionAlpha^N0.99 ^SOnlyMine^B ^SType^Sbuff ^SConditions^T ^N1^T ^SType^SDEBUFFSTACKS ^SChecked^B ^SName^SArcane~`Charge ^SLevel^N6 ^t^Sn^N1 ^t^SName^SArcane~`Charge ^SEvents^T ^N1^T ^SPassingCndt^B ^SType^SAnimations ^SValue^N100 ^SAnimation^SACTVTNGLOW ^SOperator^S== ^SEvent^SOnAlphaInc ^SPassThrough^b ^SInfinite^B ^t^N2^T ^SType^SAnimations ^SAnimation^SICONCLEAR ^SEvent^SOnAlphaDec ^SPassThrough^b ^t^Sn^N2 ^t^SSettingsPerView^T ^Sicon^T ^STextLayout^S,K#S3'[93dAa ^STexts^T ^N1^S ^t^t^t^SEnabled^B ^SFakeHidden^B ^t^N60345^S~`~| ^Sicon^^</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/lotsoftoons\">lotsoftoons</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/632\">#632</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/632.html\">Raw</a>","closed":true,"closed_at":"2012-09-19T07:34:03Z","created_at":"2012-09-19T06:56:41Z","updated_at":"2012-09-19T07:34:03Z","labels":["enhancement","invalid"]},"comments":[]}