{"issue":{"title":"[CF 659] Rotational helper and the way it tracks int/haste/sp changes... ","body":" <p>Ok, so I'll try to keep this simple, and I THINK? I may be able to do this with conditions, but I'm not sure if it's even possible.</p><p>Ok, let's say I'm tracking VT/SWP and if it's NOT on a target the icon shows. It also shows (through conditions) when there's &lt;5 seconds left. What I'm looking to do is have it do exactly what it currently does but ALSO \"show\" (regardless of whether or not the above 2 conditions are met or not) when int/haste/sp changes. I know I could use DoTHaste or add another icon to track the procs happen (and I have no problem finding the proc names I want to use), I just don't know if it's even possible using the original icon.</p><p>Example:</p><p>I click on target, it shows VT. I cast VT and the icon goes away. I go through about 6 seconds worth of a rotation and Blessing of the Celestials procs (DMF trinket) I'm curious if I can now have it show again (to reapply the dot), even though the first 2 conditions are met (it applied to my target, as well as it has more than 5 seconds left) or not?</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/xchrisgilroyx\">xchrisgilroyx</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/659\">#659</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/659.html\">Raw</a>","closed":true,"closed_at":"2012-11-03T05:21:42Z","created_at":"2012-10-16T03:23:45Z","updated_at":"2012-11-03T05:21:42Z","labels":["declined"]},"comments":[{"body":" <p>This sounds like it is just a bit too specialized for what TMW is intended for. The best that you can do is create separate icon(s) that watch for procs, and use your head to know when you have more procs than you previously did so that you can reapply the debuff.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-10-16T04:00:05Z"},{"body":" <p><cite>@<a href=\"https://github.com/tmw-issue-import/TellMeWhen/issues?q=%5BCF%20659%5D+in%3Atitle\" rel=\"nofollow\">Cybeloras</a>: <a href=\"https://github.com/tmw-issue-import/TellMeWhen/issues?q=%5BCF%20659%5D+in%3Atitle\" rel=\"nofollow\">Go</a></cite></p>\r\n<p>Yea, I was thinking of just making a seperate set of icons to track buff procs. Feel free to close this if the following really make this seem impossible:</p>\r\n<p>I guess I was just thinking conditions followed the \"order\" they are made, so I could have the first condition be \"is it on target? if no, show icon\" and the second \"is the duration less than 5 seconds? if yes show icon\" and the final one essentially IGNORING the first 2 conditions would be \"is this buff active on me? if so, show icon. if not, abide by the first 2 conditions\".</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/xchrisgilroyx\">xchrisgilroyx</a>","created_at":"2012-10-16T20:56:52Z"},{"body":" <p>Just encapsulate the first two conditions in parentheses, and change the operator between the second and third conditions to 'or' instead of 'and'.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-10-17T01:21:11Z"}]}