{"issue":{"title":"[CF 671] Please Allow GCD To Show On Non-Spell CDs ","body":" <p>IMPORTANT: If your issue is only occurring with a specific icon, include an export string of the icon in this ticket. Subsequently, if the issue involves an entire group or an entire profile, include the entire export string of the group or profile.</p><p>To get an export string, open the icon editor, and click button labeled \"Import/Export/Backup\". Select the \"To string\" option for the appropriate export type (icon, group, or profile), and then press CTRL+C to copy it to your clipboard.</p><p>FAILURE TO COMPLY WITH THE ABOVE INSTRUCTIONS WILL RESULT IN YOUR TICKET BEING INVALIDATED.</p><p>What steps will reproduce the problem?<br>1. Set up a debuff icon.<br>2. Check the Allow Global Cooldown box.<br>3. Cast the spell on a target that applies said debuff.</p><p>What do you expect to happen? What happens instead?<br>I expect the GCD timer sweep to complete on the debuff icon and then the normal timer sweep to continue if checked. The GCD timer sweep doesn't occur even if the normal timer sweep isn't turned on. I find myself looking down at my spellbars to watch my GCD. Most debuffs last much longer than the 1.5s base GCD, so I don't think allowing the GCD timer sweep to show up on a debuff icon would cause trouble, especially since it would be voluntary.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>v.6.0.3</p><p>Do you have an error log of what happened?<br>No</p><p>Please provide any additional information below (including any export strings if applicable; see above.)</p><p>Export string for a Corruption debuff on a target:</p><p>^1^T^SShowTimer^B ^SBuffOrDebuff^SHARMFUL ^SUnit^Starget ^SOnlyMine^B ^SType^Sbuff ^SShowTimerText^B ^SClockGCD^B ^SShowWhen^N3 ^SUnAlpha^N0.5 ^SName^SCorruption ^SEnabled^B ^t^N60345^S~`~| ^Sicon^^</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/lotsoftoons\">lotsoftoons</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/671\">#671</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/671.html\">Raw</a>","closed":true,"closed_at":"2012-10-23T00:46:28Z","created_at":"2012-10-23T00:28:01Z","updated_at":"2012-10-23T00:46:28Z","labels":["enhancement","invalid"]},"comments":[]}