{"issue":{"title":"[CF 672] Getting rangecheck to work with Halo. ","body":" <p>So I'm pretty sure I tried every combination of checking for a range with different spells thinking it was the way Halo worked (doesn't need a target selected to cast) to no avail.</p><p>What I'm looking to have is an icon that will show when my target is at least 25 yards away. The \"range\" of the spell is 30 yards. The reason for this is Halo does the most damage at 25 yards from the target, so literally having it show me the icon when I'm standing ontop of the boss would defeat the purpose.</p><p>I've tried the Rangecheck tick, nothing changes at all when standing next to the dummy or 40+ yards away. I tried making it \"check\" for Shackle Undead and just replacing the icon with Halo and again, nothing at all.</p><p>The reason I tried using Shackle Undead was because it was a 30 yard spell considering almost every other \"damage\" attack that priest have are 40 yard spells, which would be beyond the 30 yard range of Halo.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/xchrisgilroyx\">xchrisgilroyx</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/672\">#672</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/672.html\">Raw</a>","closed":true,"closed_at":"2012-11-03T05:24:14Z","created_at":"2012-10-23T03:12:04Z","updated_at":"2012-11-03T05:24:14Z","labels":["defect","resolved"]},"comments":[{"body":" <p>Add an \"Item in range of unit\" condition to the icon that checks itemID 31463 (<a href=\"http://www.wowhead.com/item=31463/zezzaks-shard\" rel=\"nofollow\">http://www.wowhead.com/item=31463/zezzaks-shard</a> just a quest item that has a 25 yard range) and set the slider to Not In Range. Make sure to change the unit to \"target\".</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-10-24T23:51:02Z"},{"body":" <p>Closing this ticket now.</p>\r\n<p>If you need any help with the solution that I provided, or if you need any help with any other problems relating to this ticket, please feel free to reply to it and I will be happy to help you in any way that I can!</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-11-03T05:24:04Z"}]}