{"issue":{"title":"[CF 674] Number of hostile NPCs in combat ","body":" <p>I am currently using version 6.0.3 and there is an option that I feel could benefit the addon greatly.<br>Certain classes have very different AOE rotations depending on how many mobs are going to be AOE'ed, but there are currently no way of tracking how many hostile NPCs are in combat or how many hostile NPCs are in a certain range of you. This would atleast help med out greatly when it comes to my AOE rotation. The way I see it, if there was a condition that you could add that could check for the number of hostile NPCs currently in combat or in a certain range from you, that would be AWESOME!</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/FlaereoX\">FlaereoX</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/674\">#674</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/674.html\">Raw</a>","closed":true,"closed_at":"2012-10-27T19:28:50Z","created_at":"2012-10-27T13:53:00Z","updated_at":"2012-10-27T21:12:57Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>There is no way that something like this would ever be implemented, mainly because its usefulness isn't worth the technical issues that arise when trying to create something like this </p>\r\n<p>There is no API for determining this sort of information, so watching the combat log would be the only way to check for hostile activity. There is no way to check the range of any NPC without a unitID, and the combat log does not provide unitIDs. Plus, most classes' AOE are targeted ground AOE, which would require the locations of NPCs to be mapped out using only information from the combat log, and then somehow TMW would have to understand what area you want to check for the number of NPCs in, which is quite simply impossible since Blizzard removed the APIs that the AddOn AVR a few years back in order to break it.</p>\r\n<p>TL;DR - WoW's API is just far too limited for any addon to be able to provide the functionality you have requested.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"10 27 2012 14:28:38 (CDT) (UTC-5:00)\" data-epoch=\"1351366118\">Oct 27, 2012</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-10-27T19:27:59Z"},{"body":" <p>Thank you so much for a quick response! I guess if the API doesn't allow it, it doesn't allow it, and I completely understand that. Again, thanks so much <span>:)</span></p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/FlaereoX\">FlaereoX</a>","created_at":"2012-10-27T21:12:57Z"}]}