{"issue":{"title":"[CF 691] Allow icons to react to UI error messages ","body":" <p>I would like to create a set of icons which will flash different warnings depending on whether an ability is:<br>1. Simply out of range<br>2. Not facing the right way<br>3. Being parried</p><p>The combat log differentiates these via parenthetical notations:<br>1. X failed. (Out of range)<br>2. X failed. (Target needs to be in front of you)<br>3. X missed Y. (Parried)</p><p>And the UI displays errors such as:<br>\"Target needs to be in front of you\" (failed special attacks)<br>\"You are facing the wrong way\" (failed auto-attacks)</p><p>The \"range\" check is simple and easy in TMW. However, I can't figure out a way to make TellMeWhen parse out the 2nd and 3rd conditions. I can check Combat Events for \"Swing Miss\", but this will include normal Misses as well as Dodges, neither of which warn me that I'm in front of the target. And I can't find any way to react to the red error text that spams the screen when you're doing something wrong.</p><p>I'm not quite sure whether this would belong in a new icon, an increase in Combat Event's detail level, a new Condition type (\"Error message\"), or something else. It would have interesting uses, though.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Lov3star\">Lov3star</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/691\">#691</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/691.html\">Raw</a>","closed":true,"closed_at":"2013-02-18T03:50:36Z","created_at":"2012-11-11T15:04:13Z","updated_at":"2013-02-18T03:50:36Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>The reason why I haven't done this yet is that I'm also \"not quite sure whether this would belong in a new icon, an increase in Combat Event's detail level, a new Condition type (\"Error message\"), or something else\".</p>\r\n<p>It doesn't really fit well into TellMeWhen.</p>\r\n<ul><li>An extension of the Combat Event icon type doesn't really work because that excludes all messages obtained through UI_ERROR_MESSAGE (the red text in the top-center of your screen).\r\n</li><li>An icon type would be required in order to expose the error message through to a DogTag tag so that you could display it as text on the icon.\r\n<ul><li>It would also require some sort of timing mechanism to determine how long to show the icon for after the error happens (like condition icons use).\r\n</li></ul></li><li>A condition implementation would also require some sort of a timer, as well as a message filter.\r\n</li></ul>\r\n<ul><li>In either a condition or an icon type implementation, there might have to be some kind of throttle or \"spam\" filter to prevent occasions where an error message is presented many times consecutively.\r\n</li></ul>\r\n<p>There are other reasons why this would be a difficult fit for TellMeWhen, but these are the main ones. I think I am going to have to say no to this feature request.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-02-18T03:50:17Z"}]}