{"issue":{"title":"[CF 697] More options for Custom Texture choices ","body":" <p>The Custom Texture feature is awesome and lets me do some really creative things with my icon indicators (for example, I created a custom .TGA which is completely transparent and use it to make complex layered text layouts via TMW Text Displays).</p><p>Here are some ideas to make it even more robust:</p><p>1. Allow some way to specify a custom texture per spell in lists that are monitoring multiple auras, spells, etc.</p><p>For example it could have a syntax like:</p><p>BuffNameA(tex:Inv_Misc_Lingerie_02), BuffNameB</p><p>So Buff A would display with a custom texture, while Buff B would display with its default texture (or perhaps the global Custom Texture for that icon) since it had nothing specified.</p><p>2. Allow the \"Custom texture\" slot to take a variable input. It could have many uses, but my initial motivation here is that I want the texture for an icon to display whatever is equipped in Slot 17 of my character sheet.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Lov3star\">Lov3star</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/697\">#697</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/697.html\">Raw</a>","closed":true,"closed_at":"2013-02-18T05:46:34Z","created_at":"2012-11-14T20:45:43Z","updated_at":"2013-02-18T05:46:34Z","labels":["enhancement","resolved"]},"comments":[{"body":" <p>1) Not possible without a huge resign of how this setting works that would require substantial changes to existing icon types. The closest thing to this that could ever happen is a global, addon-wide setting that would replace one specific texture for all icons with some other specific texture.</p>\r\n<p>2) I could see this happening.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-11-14T20:51:03Z"},{"body":" <p>@ #1: Ah, OK. Well it's not a big deal, like I said the Custom Texture feature is already awesome to have as it is.</p>\r\n<p>I only brought the idea up because I get bothered every once in a while when Blizz does weird things like give the \"Atonement\" Combat Event heal effect the icon for Circle of Healing, instead of just using the Atonement skill icon.</p>\r\n<p>Then I get it confused with Circle of Healing procs from other people in the raid. Blah. &gt;.&lt;</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Lov3star\">Lov3star</a>","created_at":"2012-11-14T21:50:10Z"},{"body":" <p>Added in r710.</p>\r\n<p>Use \"$item.17\" as a custom texture.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-02-18T05:46:25Z"}]}