{"issue":{"title":"[CF 722] Color Flash events not working ","body":" <p>As of TMW Release 6.1.0, and continuing in Release 6.1.1, all \"Color Flash\" events do not work — nothing happens. This affects both newly-created icons, and icons that were working with Color Flash before 6.1.0.</p><p>Downgrading to Release 6.0.4 returns Color Flash event behavior to normal.</p><p>I would post an export string but this is not an icon-specific issue — setting up a Color Flash event on any icon, new or old, produces no result. Neither when tested with the Play button, nor when the Event criteria are met.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Lov3star\">Lov3star</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/722\">#722</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/722.html\">Raw</a>","closed":true,"closed_at":"2012-12-03T06:47:11Z","created_at":"2012-12-03T05:39:16Z","updated_at":"2012-12-03T06:47:11Z","labels":["defect","resolved"]},"comments":[{"body":" <p>Sorry. Someone else commented on this (\"Hi, Great addon! I can't seem to get the icon: color flash to work since the 6.1 update. Maybe it is somthing new i have to set but i have looked through the settings. I noticed that the color is behind the icon and not infront (can see a little bit of the color in the corners behind the icon, instead of an overlay, it is underlay) when the event action trigers. I run it to change color when said spells are on cooldown; I have tried with a regular set time as well. Thanks\") but I have been horribly busy this weekend. I have some downtime tomorrow so I should be able to get it fixed then.</p>\r\n<p>The ticket helps me to not forget about it (moreso than an unread email in my inbox, anyway), though, so thanks! </p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-12-03T05:45:45Z"},{"body":" <p>I figured. :)</p>\r\n<p>My general logic when deciding between \"Post ticket?\" or \"Post comment?\" has become, \"How important is this?\"</p>\r\n<p>If it seems pretty important to basic functions I'll make a ticket. If it's Lovestar's NEWEST GREAT IDEA OMG OMG OMG #2,777, then I lean toward a comment. :p</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Lov3star\">Lov3star</a>","created_at":"2012-12-03T06:28:37Z"},{"body":" <p>Screw waiting. Fixed in r685.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-12-03T06:47:02Z"}]}