{"issue":{"title":"[CF 736] Sharing a group ","body":" <p>I have did a very quick search through the ticket about this so I am not sure if it has already been asked but I was wondering if there was plan to add Group sharing possibility. I would be a feature really useful for me on certain fight.</p><p>Example: I have a group in Tell me when that is hidden and contain over 60 icons of different boss ability that cover the last 4 tier of raiding. I have linked a Meta Icon on that group somewhere easy for me to see so when something happen that I Need to know it's always there. The problem come when I want to use that on another character the dirty solution is to copy the group but sometime I modify the icon as I see problem and I lose track of the most recent icon over different group on different profile.</p><p>I was wondering if there would be a possibility of sharing group as long as it's feasible.</p><p>Thank you.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/InfernalAura\">InfernalAura</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/736\">#736</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/736.html\">Raw</a>","closed":true,"closed_at":"2013-02-12T20:29:49Z","created_at":"2012-12-20T06:53:53Z","updated_at":"2013-02-12T20:29:49Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>It actually has been asked before, but the way that you phrased it here give me an idea that I didn't have when I created the original ticket. I'm not saying that it will allow this to be possible, but it is a different approach that I will consider.</p>\r\n<p>Note to self:\r\nInstead of having a global profile database that would act as a second source when creating groups (the old idea that doesn't work), use the global profile database as an optional data source that normal profile-specific groups can be linked to as an alternate data source. Then, the issue with changing groupIDs ALMOST disappears.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2012-12-20T07:02:11Z"},{"body":" <p>I thought about this a lot yesterday, and the only conclusion that I was able to come to no matter how I approached the problem is that this wouldn't work. There are just to many issues with the way TMW's db was originally designed to allow something like this to work.</p>\r\n<p>Icons would have be to identified with GUIDs in order for linkages in meta icons/conditions/event handlers/etc not to break under this system when a group gets assigned a different groupID for each profile it is used in. TMW (all 30,000+ lines of it at last count) was not built around this at all - icons are identified using their groupID and iconID combination. The amount of work that would have to go into redesigning every little piece of TMW that uses groupIDs and iconIDs to identify individual icons so that it can search for and identify icons using a GUID-based system would be staggering (not to mention all the new code and business logic that would be needed to reconcile GUID conflicts arising from different versions of icons).</p>\r\n<p>TMW, although I do love working on it very much, is still just a hobby, and I can only afford a limited amount of time to it, and unfortunately, this just isn't something that I will be able to work on in the limited amount of time I will still be playing WoW for before I move on to the next stages of my life.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-02-12T20:27:43Z"}]}