{"issue":{"title":"[CF 744] emote issue ","body":" <p>IMPORTANT: If your issue is only occurring with a specific icon, include an export string of the icon in this ticket. Subsequently, if the issue involves an entire group or an entire profile, include the entire export string of the group or profile.</p><p>To get an export string, open the icon editor, and click button labeled \"Import/Export/Backup\". Select the \"To string\" option for the appropriate export type (icon, group, or profile), and then press CTRL+C to copy it to your clipboard.</p><p>FAILURE TO COMPLY WITH THE ABOVE INSTRUCTIONS WILL RESULT IN YOUR TICKET BEING INVALIDATED.</p><p>What steps will reproduce the problem?<br>1. Set an icon to monitor combatlogs in which when successfully dispelled a harmful spell from target, show \" dispelled [s] from [where this harmful spell exits but not where it came from]\" by emote!!!!<br>2. When this target is the player itself<br>3. As well as when using the condition \"steal a certain speel\"</p><p>What do you expect to happen? What happens instead?<br>It is expected that \"dipelled [a spell] from [player name]\" however now it shows \"bad unit\"</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>R691</p><p>Do you have an error log of what happened?</p><p>Please provide any additional information below (including any export strings if applicable; see above.)<br>the setting for such icon has not been changed since 5.05, and this problem did not appear until 5.1 released. So I thought Blizzard might change the element or sequence of the combatlog for dispel or steal spell which resulted in such situation. Could you please have a look?</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/a1204350\">a1204350</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/744\">#744</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/744.html\">Raw</a>","closed":true,"closed_at":"2013-01-02T21:31:44Z","created_at":"2013-01-02T03:06:46Z","updated_at":"2013-01-02T21:31:44Z","labels":["defect","invalid"]},"comments":[{"body":" <p>Please include the export string of the icon that you are having trouble with.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-01-02T21:31:30Z"}]}