{"issue":{"title":"[CF 753] TMW fails to play a sound ","body":" <p>IMPORTANT: If your issue is only occurring with a specific icon, include an export string of the icon in this ticket. Subsequently, if the issue involves an entire group or an entire profile, include the entire export string of the group or profile.</p><p>To get an export string, open the icon editor, and click button labeled \"Import/Export/Backup\". Select the \"To string\" option for the appropriate export type (icon, group, or profile), and then press CTRL+C to copy it to your clipboard.</p><p>FAILURE TO COMPLY WITH THE ABOVE INSTRUCTIONS WILL RESULT IN YOUR TICKET BEING INVALIDATED.</p><p>What steps will reproduce the problem?<br>1. Create a new group<br>2. Add a sound at an event handler, e.g. \"On show\"<br>3.</p><p>What do you expect to happen? What happens instead?<br>A sound is supposed to play when an icon appears. Instead, TMW does not play any sounds regardless of whether the sound is custom or basic or the type of event at event handler is changed (even the most simple one - left click event - does not trigger TMW to play a sound). It just fails to play any sound at all. In the client settings sound is turned on.<br>When I click on the icon of the sound in the event handler settings, the sound is played normally.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>6.1.1</p><p>Do you have an error log of what happened?<br>-</p><p>Please provide any additional information below (including any export strings if applicable; see above.)<br>I am not sure whether it is necessary to provide any export strings for this ticket as this problem occurs with TMW just \"out of the box\".<br>P. S. I do not have any issues with the sound anywhere else on my PC.<br>Thanks.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/cegthlhekz\">cegthlhekz</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/753\">#753</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/753.html\">Raw</a>","closed":true,"closed_at":"2013-03-04T01:59:07Z","created_at":"2013-02-07T12:05:05Z","updated_at":"2013-03-04T01:59:07Z","labels":["defect","invalid"]},"comments":[{"body":" <p>So, just to be sure, when you are in combat, you can hear swords clanging, fireballs exploding, etc., but TMW sounds aren't working at all?</p>\r\n<p>Also, are you trying to use one of the sounds that are already listed in TellMeWhen, or are you trying to use a custom sound?</p>\r\n<p>I would like the export string of an icon that this isn't working with, yes.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"02 7 2013 12:37:15 (CDT) (UTC-6:00)\" data-epoch=\"1360262235\">Feb 7, 2013</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-02-07T18:06:09Z"},{"body":" <p>1. I can hear swords clanging, fireballs exploding, etc. by all means, but TMW sounds aren't working at all (the only exception is when you click on the button next to a sound file, then the sound is played).\r\n2. I have tried both listed and custom sounds, none of them work (except when you test the sound as I have stated previously).\r\n3. Here's the export string of an icon (it's just a simple one because sounds do not work anyway, so that is why I am posting quite a simple one - necrotic strike icon, when my target has a necrotic strike debuff, the icon appears AND the sound should be played.</p>\r\n<p>^1^T^SScale^N2.5 ^SOnlyInCombat^B ^SEnabled^B ^SColumns^N1 ^SIcons^T ^N1^T ^SShowTimer^B ^SBuffOrDebuff^SHARMFUL ^SUnit^Starget ^SType^Sbuff ^SName^SНекротический`удар ^SEvents^T ^N1^T ^SType^SSound ^SSound^SAlgalon:`Beware! ^SEvent^SOnShow ^t^Sn^N1 ^t^SOnlyMine^B ^SEnabled^B ^SUnitConditions^T ^N1^T ^SType^SREACT ^SLevel^N1 ^t^Sn^N1 ^t^t^t^SName^SNecrotic`strike ^t^N61103^S`| ^Sgroup^N2 ^^</p>\r\n<p>P.S. I'm posting the export string for the first time. so please correct me if I posted it wrong. Also, the client is Russian so the necrotic strike would be \"некротический удар\".\r\nThanks a lot for your help.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/cegthlhekz\">cegthlhekz</a>","created_at":"2013-02-07T19:53:21Z"},{"body":" <p>Try downloading and installing the latest alpha version of TellMeWhen. I seem to remember fixing some bug related to event handling in it, but I can't remember what it was.</p>\r\n<p>Everything seems to be working just fine on my end, which is what makes me think that it might be something that was fixed between the release of version 6.1.1 and now.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-02-08T01:03:57Z"},{"body":" <p>It might seem a little n00bish, but where do I get the alpha version? Curse Client says my version is the latest. Thanks again.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/cegthlhekz\">cegthlhekz</a>","created_at":"2013-02-09T17:22:38Z"},{"body":" <p>Sorry. Normally I say where to get it when I request someone download it, but I must have forgotten this time.</p>\r\n<p>Get it here: <a href=\"http://wow.curseforge.com/addons/tellmewhen/files/\" rel=\"nofollow\">http://wow.curseforge.com/addons/tellmewhen/files/</a></p>\r\n<p>(Click the file name for r700 for a direct download).)</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-02-09T17:59:44Z"},{"body":" <p>No response received in nearly a month. Closing ticket.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"03 3 2013 19:58:54 (CDT) (UTC-6:00)\" data-epoch=\"1362362334\">Mar 3, 2013</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-03-04T01:58:43Z"}]}