{"issue":{"title":"[CF 784] I cannot get a Harmony tracker or Clearcasting proc tracker ","body":" <p>IMPORTANT: If your issue is only occurring with a specific icon, include an export string of the icon in this ticket. Subsequently, if the issue involves an entire group or an entire profile, include the entire export string of the group or profile.</p><p>To get an export string, open the icon editor, and click button labeled \"Import/Export/Backup\". Select the \"To string\" option for the appropriate export type (icon, group, or profile), and then press CTRL+C to copy it to your clipboard.</p><p>FAILURE TO COMPLY WITH THE ABOVE INSTRUCTIONS WILL RESULT IN YOUR TICKET BEING INVALIDATED.</p><p>^1^T^SShowTimer^B ^SOnlyMine^B ^SType^Sbuff ^SName^SHarmony ^SCustomTex^S100977 ^SShowTimerText^B ^SEnabled^B ^t^N61501^S~`~| ^Sicon^^ (What I am trying to do in regards to a Harmony Tracker)</p><p>^1^T^SShowTimer^B ^SOnlyMine^B ^SType^Sbuff ^SName^SClearcasting ^SSettingsPerView^T ^Sicon^T ^STexts^T ^N1^S ^t^t^t^SCustomTex^S16870 ^SEnabled^B ^t^N61501^S~`~| ^Sicon^^ (The Clearcasting Tracker)</p><p>I copied the Clearcasting one from this forum but it does not work.</p><p>What steps will reproduce the problem?<br>1. I do not know, hence why I am asking<br>2.<br>3.</p><p>What do you expect to happen? What happens instead? I wanted to be able to get an indication whenever 'Harmony' and 'Clearcasting' procs; I am more concerned with the Harmony as I am trying to get into the habit of keeping it up at all times. I have set both as 'Reactionary', 'Buffs' and one other option.</p><p>What happens instead is nothing. I get no indication of either proc and there is nothing being shown in the 'TellMeWhen' grid. I have tested both in and out of groups and in neither instances do they work.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version) 6.1.5</p><p>Do you have an error log of what happened? No; as I mentioned before, I am getting nothing. If I received an error, it might help me understand why the addon is not working.</p><p>Please provide any additional information below (including any export strings if applicable; see above.)</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Casualsmooth\">Casualsmooth</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/784\">#784</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/784.html\">Raw</a>","closed":true,"closed_at":"2013-04-13T06:56:31Z","created_at":"2013-04-12T23:45:53Z","updated_at":"2013-04-13T06:56:31Z","labels":["invalid"]},"comments":[{"body":" <p>I also wanted to know if TellMeWhen is a stand alone addon or if another or other addons are needed in order to make it work. I ask because I have looked at your videos and read many of the comments but still cannot get any indicators that I set the icons up correctly.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Casualsmooth\">Casualsmooth</a>","created_at":"2013-04-12T23:51:35Z"},{"body":" <p>Both icons are working perfectly fine for me. Are you sure that you aren't in configuration mode? icons do not function while in configuration mode - type /tmw to toggle between configuration mode (unlocked) and functional (locked) states.</p>\r\n<p>TellMeWhen is a standalone addon. The videos are not mine.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-04-13T00:06:46Z"},{"body":" <p>Is configuration mode when you can see and interact with the addon? If so, then, yes, I am sure that I am not in configuration mode. I made the two trackers, typed '/tmw' so that I can no longer see the icons, and then try to test them. When Harmony and/or Clearcasting proc, I do not see the icons at all; as in they do not appear when either buffs happen.</p>\r\n<p>Sorry; I did not mean to imply that the videos are yours. I merely meant that I looked at some of the videos that utilise this addon.</p>\r\n<p>Edit: I found out what was wrong. For some reason, it was set on 'Only show in combat'. I have deleted the addon and reinstalled it and each time it is set this way. The trackers are working now.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"04 13 2013 00:33:53 (CDT) (UTC-5:00)\" data-epoch=\"1365831233\">Apr 13, 2013</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Casualsmooth\">Casualsmooth</a>","created_at":"2013-04-13T05:17:04Z"}]}