{"issue":{"title":"[CF 789] Recommend condition: Zone Text / MapID ","body":" <p>It could be helpful for players to filter icons and groups for specific zone / continent / map. The current implementation is lua expression, but it's not quite efficient since the change of zone / map is low frequency comparing with OnUpdate driver. It could be better if you implement an event-driven condition.</p><p>The zone / continent / map might be defined as a localized zone text. A better way that avoid localization problem could be mapID from GetCurrentMapAreaID(), but blizzard messed up this when player navigating world map, so it needs some work. It could be brilliant if there is a map name - mapID lookup table like the spell name - spellID does. With the continent and map APIs, I believe that it's easy to build the table for non-dungeon maps.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Tellaurea\">Tellaurea</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/789\">#789</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/789.html\">Raw</a>","closed":true,"closed_at":"2013-04-21T00:51:25Z","created_at":"2013-04-16T06:32:02Z","updated_at":"2013-04-21T00:51:25Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>I am currently trying to bring active development on TellMeWhen to an end since it is now finally in a state that I am happy with. This doesn't go to say that that I don't think that this would be a good idea (I do think it would be a good idea), but it is just not something that I am going to implement myself at this stage.</p>\r\n<p>You are more than welcome to create it using the condition API, though, which has just been freshly documented. If you do want to do it, and you need help, reply to this ticket and I will see what I can do. </p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-04-20T05:32:06Z"}]}