{"issue":{"title":"[CF 795] Problem during spell cooldown setting ","body":" <p>IMPORTANT: If your issue is only occurring with a specific icon, include an export string of the icon in this ticket. Subsequently, if the issue involves an entire group or an entire profile, include the entire export string of the group or profile.</p><p>To get an export string, open the icon editor, and click button labeled \"Import/Export/Backup\". Select the \"To string\" option for the appropriate export type (icon, group, or profile), and then press CTRL+C to copy it to your clipboard.</p><p>FAILURE TO COMPLY WITH THE ABOVE INSTRUCTIONS WILL RESULT IN YOUR TICKET BEING INVALIDATED.</p><p>What steps will reproduce the problem?<br>1. Setting the opacity of usable status as 100% and unusable as 50%<br>2. Setting event show activate border on finish, stop animation on start<br>3.</p><p>What do you expect to happen? What happens instead?<br>I want the icon border flashing when i tab to the enemy target that meet my requirement. But the first time I tab on the target only the icon showed up but the border didnt flash. It went normal after the first round I using this spell. What i want is once i tab on the target the icon border should flash not unless i use the spell once and wait for the second round. I have a another hunter that has the same problem. The icon should be flashing once i log in the game, because its usable. But instead it flash after I use it and the spell reset, that is actually the second time it become usable.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>6.1.5</p><p>Do you have an error log of what happened?<br>No</p><p>Please provide any additional information below (including any export strings if applicable; see above.)<br>^1^T^SShowTimer^B ^SType^Scooldown ^SConditions^T ^N1^T ^SType^SHEALTH ^SOperator^S&lt;= ^SUnit^Starget ^SLevel^N38 ^t^N2^T ^SType^SEXISTS ^SUnit^Starget ^t^N3^T ^SType^SALIVE ^SUnit^Starget ^t^N4^T ^SType^SISPLAYER ^SUnit^Starget ^SLevel^N1 ^t^Sn^N4 ^t^SShowTimerText^B ^SEvents^T ^N1^T ^SType^SAnimations ^SAnimation^SICONCLEAR ^SEvent^SOnStart ^t^N2^T ^SType^SAnimations ^SAnimation^SACTVTNGLOW ^SEvent^SOnFinish ^SInfinite^B ^t^Sn^N2 ^t^SShowWhen^N3 ^SUnAlpha^N0.5 ^SName^SSoul~`Reaper ^SEnabled^B ^t^N61501^S~`~| ^Sicon^^</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/will930128\">will930128</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/795\">#795</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/795.html\">Raw</a>","closed":true,"closed_at":"2013-04-28T00:23:50Z","created_at":"2013-04-24T11:15:38Z","updated_at":"2013-04-28T00:23:50Z","labels":["defect","invalid"]},"comments":[{"body":" <p>The spell's cooldown does not finish when you log into the game, so it will not fire the On Finish event.</p>\r\n<p>To make the default state of the animation be playing, add another event handler for the On Icon Setup event and have that event handler play the animation as well.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-04-24T15:42:43Z"},{"body":" <p><cite>@<a href=\"https://github.com/tmw-issue-import/TellMeWhen/issues?q=%5BCF%20795%5D+in%3Atitle\" rel=\"nofollow\">Cybeloras</a>: <a href=\"https://github.com/tmw-issue-import/TellMeWhen/issues?q=%5BCF%20795%5D+in%3Atitle\" rel=\"nofollow\">Go</a></cite></p>\r\n<p>I tried to set the animation start on shown. but sometimes when the icon showed it was not usable and it was 50% opacity, i dont want it flash on that moment, but it did. So i want to know is there anyway i can set the icon border to flash if the spell is usable in any case.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/will930128\">will930128</a>","created_at":"2013-04-24T23:03:15Z"},{"body":" <p>Use an On Condition Set Passing event then. Configure the conditions for it to succeed when the spell is usable.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-04-24T23:31:56Z"}]}