{"issue":{"title":"[CF 797] Combat event number of targets condition ","body":" <p>Hey, do you think you could make it possible to to show an icon that (in this specific instance) only reacts when I hit at least 4 targets with my whirlwind?</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/AmeroGer\">AmeroGer</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/797\">#797</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/797.html\">Raw</a>","closed":true,"closed_at":"2013-04-28T00:23:21Z","created_at":"2013-04-24T23:31:21Z","updated_at":"2013-04-28T00:23:21Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>No, sorry. That is just far too specific of a function and I couldn't see it being used by anybody else.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-04-24T23:40:07Z"},{"body":" <p>Obviously I also had in mind checking other abilities and other numbers of targets hit. I hope you didn't misunderstand me there.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/AmeroGer\">AmeroGer</a>","created_at":"2013-04-25T15:19:30Z"},{"body":" <p>Yeah, I know. I realize that it would help to figure out breakpoints where AoE vs single target become the best DPS and other things like that, but its just not something that I want to implement.</p>\r\n<p>It would be particularly tricky to implement, too, since the only way to figure this out would be watching the combat log for hits and aggregating them together based on their time to figure out what constitutes a single ability use - the time window has to be small enough not to count separate ability uses but also wide enough not to leave out any hits that are delayed a bit by lag and/or travel time for those AoEs that hit in a much wider area. There would have to be some sort of mechanism in place to delay updating the icon with this information until it could be certain that all hits were accounted for, which could be up to a full GCD after the ability was used.</p>\r\n<p>Something I told lsjyzjl about the other day bit didn't get around to telling you:</p>\r\n<p>I plan on quitting WoW and TMW development within the next month or so. (I will still continue doing updates to keep compatibility with new patches to the best of my ability, but there won't be anything new coming to TellMeWhen after I'm done with WoW. That is why I'm in the process of documenting the API - so that others can make the new things for TellMeWhen).</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"04 25 2013 15:06:47 (CST) (UTC-5:00)\" data-epoch=\"1366920407\">Apr 25, 2013</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-04-25T20:04:52Z"}]}