{"issue":{"title":"[CF 826] Tracking Shield Block recharge Timer ","body":" <p>What steps will reproduce the problem?<br>1. I create a Shield Block cooldown icon<br>2. I have OmniCC on<br>3.</p><p>What do you expect to happen? What happens instead?<br>I was expecting to have the CD displayed as text like it happens on Taunt, for example. Instead, it doesn't show the cd, only the rage necessary to use the spell, which I have also configured.<br>Is it because Shield Block has a Recharge of 9s instead of a cd? How to I track this type of spell?</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>6.2.1</p><p>Do you have an error log of what happened?<br>No</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Zhurk\">Zhurk</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/826\">#826</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/826.html\">Raw</a>","closed":true,"closed_at":"2013-06-23T19:32:36Z","created_at":"2013-06-23T17:34:36Z","updated_at":"2013-06-23T19:32:36Z","labels":["defect","invalid"]},"comments":[{"body":" <p>Please do not ignore the instructions given in the ticket template:</p>\r\n<blockquote><cite>Quote:</cite><p><strong>IMPORTANT: If your issue is only occurring with a specific icon, include an export string of the icon in this ticket.</strong> Subsequently, if the issue involves an entire group or an entire profile, include the entire export string of the group or profile.</p>\r\n<p>To get an export string, open the icon editor, and click button labeled \"Import/Export/Backup\". Select the \"To string\" option for the appropriate export type (icon, group, or profile), and then press CTRL+C to copy it to your clipboard.</p>\r\n<p><strong>FAILURE TO COMPLY WITH THE ABOVE INSTRUCTIONS WILL RESULT IN YOUR TICKET BEING INVALIDATED.</strong></p>\r\n</blockquote> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-06-23T19:32:25Z"}]}