{"issue":{"title":"[CF 844] Item CD for an equipment slot fooled by duplicate items in bags ","body":" <p> I'm an engineer, so I have an on-use on my belt. My icon for it is pretty simplistic, 100% opacity when usable, 0 when not. Checking on item 6, the belt slot. I found a corner case that breaks this icon. Everything works fine except:</p>\r\n<p> When I have a duplicate of my equipped belt in my bags, with no tinker on it, the icon always stays shown. I think it's finding the other belt with no CD ticking, since it doesn't have a tinker. The other belts in my bags all show CD timers, since they have tinkers. OmnicCC for my /use 6 macro isn't fooled, and counts down the CD for my equipped belt, and the other tinkered belts in my inventory.</p>\r\n<p> I check the CD on item number 6 rather by item name or ID because I sometimes have two (often vendor) belts with different tinkers and gemming, so of course I want to check the one I have equipped. If there's another icon type or something that would more exactly do what I want, then I must have missed it.</p>\r\n<div><div><div>\n\n```\n^1^T^SType^Sitem ^SName^S6 ^SConditions^T ^N1^T ^SType^STREE ^SLevel^N2 ^t^Sn^N1 ^t^SShowTimer^B ^SEnabled^B ^t^N62226^S~`~| ^Sicon^^\r\n\n```\n</div></div>\r\n</div><p> TMW r844.</p>\r\n<p> (note if you're testing this: the icon condition checks for demo spec. I usually wear a belt with nitros for aff)<br></p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Karsteck\">Karsteck</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/844\">#844</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/844.html\">Raw</a>","closed":true,"closed_at":"2013-07-22T01:45:13Z","created_at":"2013-07-17T22:03:36Z","updated_at":"2013-07-22T01:45:13Z","labels":["defect","resolved"]},"comments":[{"body":" <p>Fixed in r846</p>\r\n<ul><li>All features in TellMeWhen that track items (including Item Cooldown icons and any item conditions) are universally able to accept slotIDs as input, and all features will now correctly distinguished equipped items from items in your bag when tracking by slotID. This is the result of a new, robust system for managing items.\r\n</li></ul> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-07-22T01:45:04Z"}]}