{"issue":{"title":"[CF 848] 'Allow GCD' Incompatible w/Buff/Debuff+Combat Event? ","body":" <p>The 'Allow Global Cooldown' timer swing on each hit doesn't seem to properly work with Buff/Debuff or Combat Event icons. Works fine with Spell Cooldown. Might be broken/fine with other icon types, but I haven't looked at those yet.</p><p>This might be intended due to how the GCD doesn't really matter to those two, but I guess I'm finding use for it by making a placebo actionbar with TMW, so it'd have small use for others I suppose?</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Freeebo\">Freeebo</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/848\">#848</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/848.html\">Raw</a>","closed":true,"closed_at":"2013-07-24T22:30:30Z","created_at":"2013-07-24T20:39:50Z","updated_at":"2013-07-24T22:47:41Z","labels":["defect","invalid"]},"comments":[{"body":" <p>The more I play with this the more I think they are meant to be mutually exclusive.</p>\r\n<p>Maybe there's a way to make the 'Show Timer' and 'Allow Global Cooldown' an either/or option?</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Freeebo\">Freeebo</a>","created_at":"2013-07-24T21:00:18Z"},{"body":" <p>I don't understand what the issue is here. Don't enable the \"allow global cooldown\" option for icons that aren't tracking things with global cooldowns. Or is there something else that I'm not getting here?</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-07-24T21:50:29Z"},{"body":" <p>My issue (or likely it's a non-issue) is that it doesn't track things on the GCD for...well things that aren't on the GCD, even though there's some here-and-there use for emulating the GCD.</p>\r\n<p>For example, if I want to properly make an icon for Wild Strike, and also have to encompass the Bloodsurge buff, I could make a meta icon, but when the bloodsurge is showing, it won't show the GCD swing, as it's tracking a buff and not a spell cooldown. </p>\r\n<p>Like I said, not tracking it is probably an intended happening.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Freeebo\">Freeebo</a>","created_at":"2013-07-24T21:54:43Z"},{"body":" <p>A buff icon isn't going to show the GCD because it is showing the timer of the buff.</p>\r\n<p>The \"Allow Global Cooldown\" option doesn't cause the icon to display the GCD if there is one happening. It allows the icon to show the timer of the icon if the timer is currently the same as the GCD. If the icon isn't showing something that is on the GCD then it isn't going to show the GCD - because it isn't there.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-07-24T22:30:20Z"},{"body":" <p>Sucks. I'll have to try to make some kind specific timer setup in the Text Layouts that'll emulate a timer that matches OmniCC's.</p>\r\n<p>Thanks though, although I had assumed from the start that was the case.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Freeebo\">Freeebo</a>","created_at":"2013-07-24T22:47:41Z"}]}