{"issue":{"title":"[CF 852] Add Set Bonus Detection ","body":" <p><a href=\"http://wow.curseforge.com/addons/ovale/\" rel=\"nofollow\">Ovale</a> for example allows as a condition to check what set bonuses are available based on the gear equiped.</p>\r\n<p>Their code for this can be found in the 'OvaleEquipement.lua'.</p>\r\n<p>I know i would find this handy myself as i build a lot of rotation helpers and share them amongst my friends who want them.</p>\r\n<p>I would be more than happy each patch to provide all the item id's for the gear and it could be limited to gear per expansion of course same as <a href=\"http://wow.curseforge.com/addons/ovale/\" rel=\"nofollow\">Ovale</a> has done.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Torchler\">Torchler</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/852\">#852</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/852.html\">Raw</a>","closed":true,"closed_at":"2013-08-07T06:00:37Z","created_at":"2013-08-06T23:27:20Z","updated_at":"2013-08-07T06:00:37Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>I just can't see a feature like this being used enough to justify its existence. There are two options for this:</p>\r\n<ol><li>Let you maintain the list of items in each set and trust that you will keep it updated each and every patch from here on out. Problem: I don't know you at all so I don't know how long you would actually stick around for. Don't take this the wrong way. I would also have to merge in your list every time you update it which can be a bit of a hassle especially since TMW is extremely close to reaching the state where it only <em>needs</em> to be updated once per expansion.\r\n</li><li>Use LibPeriodicTable-3.1 to get the data for sets. This requires less maintenance, but it also requires a larger justification for its inclusion into the AddOn because of the not-insignificant amount of memory usage increase it would cause. It also relies on that library being updated and maintained in a timely fashion in the future, and while it is much more likely than a custom solution, it is still an unknown factor.\r\n</li></ol>\r\n<p>This feature would essentially be used to track something that would only ever change one time in a character's life - you only acquire each tier set once, and after you get it, you are never going to wear a lesser tier set. It makes a lot more sense to me to just give you friends several icons for each tier bonus and have them enable/disable the ones that do/don't apply to their current gear configuration.</p>\r\n<p>Conditions should be used for things that will change frequently (or at the very least, will change more than once), and this one just doesn't fit the bill.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"08 6 2013 21:43:39 (CST) (UTC-5:00)\" data-epoch=\"1375843419\">Aug 6, 2013</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-08-07T02:43:30Z"},{"body":" <p>I appreciate the well thought out and written response. I understand and agree with what you're saying.</p>\r\n<p>FYI Thanks for the awesome addon</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Torchler\">Torchler</a>","created_at":"2013-08-07T03:33:28Z"}]}