{"issue":{"title":"[CF 864] Some Events Break after Leaving /tmw Config ","body":" <p>At first I'll note that not ALL event break after this, just some, sometimes. Usually it's my dancing steel/enrage/T16 4pc proc icons (I can export these for you if you like). I don't think it has to do with the icon events either, because the DS/enrage uses start/finish events, and the T16 4pc one uses show/hide.</p><p>I dunno what else to add. I'll export things if you want. I suppoooooose it could be some magical residual effect of me removing and then readding the events folder when we were troubleshooting that memory leak, but I doubt it.</p><p>E: Possible it could have something to do with entering config mode while auras are still running? But that wouldn't fully explain why my execute proc aura breaks usually after going into config.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Freeebo\">Freeebo</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/864\">#864</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/864.html\">Raw</a>","closed":true,"closed_at":"2014-04-27T04:36:50Z","created_at":"2013-09-26T08:56:34Z","updated_at":"2014-04-27T04:36:50Z","labels":["defect","resolved"]},"comments":[{"body":" <p>What exactly breaks? Do they fail to start once you get these effects again? Or is it something else? A step-by-step breakdown of what you do and what you observe as a result (including what the expected behavior is at each step) would help.</p>\r\n<p>Is it stands current, On Show events can be a little bit inconsistent when leaving configuration mode. They aren't supposed to fire at all, but sometimes they do, which could be what is causing the inconsistency. I have never investigated why this happens, though. Anyway, a more detailed breakdown of what is happening would help. I am assuming that the icons in question are some of the ones that have the plain, static border as an On Show and a Stop Animations as an On Hide. </p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"09 26 2013 14:25:02 (CST) (UTC-5:00)\" data-epoch=\"1380223502\">Sep 26, 2013</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-09-26T19:02:05Z"},{"body":" <p>The event won't fire until the icon shows, hides, then shows again, upon showing the second time the event will actually work. This isn't a consistent issue, as sometimes it'll happen and sometimes it won't and sometimes it'll happen on different events. And some icons aren't even effected by it.</p>\r\n<ul><li>Go whack dummy\r\n</li><li>Events fire properly\r\n</li><li>Exit combat\r\n</li><li>Enter config\r\n</li><li>Leave config\r\n</li><li>Enter combat\r\n</li><li>Certain icons will sometimes not properly go through their set events until they are shown, hidden, then shown again.\r\n</li></ul>\r\n<p>Most of the icons in question use start/finish, whereas one uses show/hide. The issue happens on both, so it's not specifically a show/hide thing. It's possible the start/finish might have something to do with entering config while the aura is still going, as when I'm in config I sometimes notice the dancing steel aura is still running against the # of buffs in the aura frame.</p>\r\n<p>I suppose one could do something like make the event trigger 'on icon setup' then the stop animation for finish/hide.</p>\r\n<p>E: <a href=\"http://imgur.com/a/L0QGV#6\" rel=\"nofollow\">http://imgur.com/a/L0QGV#6</a> Some screenshots. Note the DS aura tracking # while still in config mode, and then in successive screenshots the DS aura being broken as far as the event goes. If I were to click that aura off and then wait for it to reproc, the border event would fire correctly. I also always waited until out of combat to go to config, although going in config during combat and then back out would probably break most start/show events.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"09 26 2013 16:04:23 (CST) (UTC-5:00)\" data-epoch=\"1380229463\">Sep 26, 2013</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Freeebo\">Freeebo</a>","created_at":"2013-09-26T20:58:52Z"},{"body":" <p>Most issues like this should now be resolved with the addition of the \"While Condition Set Passing\" trigger to notifications (formerly events). You will have to convert things over to the new trigger, but it should be 100% reliable and should be 200% easier to configure.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-04-27T04:36:42Z"}]}