{"issue":{"title":"[CF 895] Unexpected Behaviour ","body":" <p>IMPORTANT: If your issue is only occurring with a specific icon, include an export string of the icon in this ticket. Subsequently, if the issue involves an entire group or an entire profile, include the entire export string of the group or profile.</p><p>To get an export string, open the icon editor, and click button labeled \"Import/Export/Backup\". Select the \"To string\" option for the appropriate export type (icon, group, or profile), and then press CTRL+C to copy it to your clipboard.</p><p>FAILURE TO COMPLY WITH THE ABOVE INSTRUCTIONS WILL RESULT IN YOUR TICKET BEING INVALIDATED.</p><p>What steps will reproduce the problem?<br>1. Make a combat event icon<br>2. Set destination target to player<br>3. Set icon to react to Symbiosis<br>4. Make text event for On Combat Event</p><p>What do you expect to happen? What happens instead?<br>To have the icon react only when symbiosis is cast on player. Instead the icon will react to any druid casting Symbiosis regardless of it's set destination.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>6.2.6</p><p>Do you have an error log of what happened?<br>No</p><p>Please provide any additional information below (including any export strings if applicable; see above.)</p><p>If the same icon is made reacting only to Innervate it will work as intended. Seems to not work for Symbiosis however.</p><p>String for icon:<br>^1^T^SCLEUEvents^T ^SSPELL_CAST_SUCCESS^B ^t^SType^Scleu ^SName^SSymbiosis ^SFakeHidden^B ^SEvents^T ^N1^T ^SType^SAnnouncements ^SChannel^SWHISPER ^SLocation^S[Source] ^SText^SThanks~`for~`giving~`me~`[\"[Prowl]\":Color(\"71d5ff\")].~`I'll~`give~`you~`[\"[Spiritwalker's~`Grace]\":Color(\"71d5ff\")]. ^SEvent^SOnCLEUEvent ^t^Sn^N1 ^t^SDestUnit^SRakaroo ^SEnabled^B ^t^N62602^S~`~| ^Sicon^^</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/felrece\">felrece</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/895\">#895</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/895.html\">Raw</a>","closed":true,"closed_at":"2013-12-30T22:31:28Z","created_at":"2013-12-04T07:39:09Z","updated_at":"2013-12-30T22:31:28Z","labels":["defect","declined"]},"comments":[{"body":" <p>I suspect this is an issue with the combat log not providing correct information, but I can't be sure until I see the actual event firing when this happens. I have reproduced the issue, though. Thanks for the report.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-12-14T22:29:44Z"},{"body":" <p>After investigating the issue, it does appear to be an issue with the event parameters not being provided.</p>\r\n<p>You should be able to use the Aura Applied event in order to determine when symbiosis is cast on you.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-12-30T05:37:23Z"}]}