{"issue":{"title":"[CF 897] Sort by cooldown remaining, move shown icons when another is hidden ","body":" Hello, i'd like to make a suggestion for a new feature for TellMeWhen.<br>\r\n<br>\r\nFor example i have a horizontal group that has 6 icons, i would like TMW to automatically sort the icons by remaining cooldown. What i mean is to put the icon with the lowest remaining cooldown all the way to the right and the one with the longest cooldown remaining on the left side.<br>\r\n<br>\r\nAnother suggestion (that is sort of related) is to move icons that are shown to fill spots that are hidden. Example, i have this group in config mode:<br>\r\n<div>\n\n```\n[A] [B] [C] [D] [E] [F]\n```\n</div><br>\r\nNow, for example, only A, C and F are currently shown, right now this would look like this:\r\n<div>\n\n```\n[A]     [C]         [F]\n```\n</div><br>\r\nBut i want TMW to move and allign those icons to the right so it looks like this:\r\n<div>\n\n```\n            [A] [C] [F]\n```\n</div><br>\r\nIf there would be a cool 'slide' animation for when icons are automatically moved by TMW that would be very awesome but not necessary \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Comboqt\">Comboqt</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/897\">#897</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/897.html\">Raw</a>","closed":true,"closed_at":"2013-12-13T04:29:44Z","created_at":"2013-12-10T23:29:47Z","updated_at":"2013-12-13T04:29:44Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>All of these things, with the exception of animations, are already possible in TellMeWhen. Animations when moving an icon will probably never happen.</p>\r\n<p>Check out the Layout Direction and Icon Sorting group options.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-12-13T04:29:36Z"}]}