{"issue":{"title":"[CF 900] Track Non-Player Cooldowns w/2 Charges ","body":" <p>As of right now, there's no real fluent way to track another player's cooldowns when they have multiple charges. For example, if I'd want to track a friendly paladin's hand of sacrifice and he's using clemency (which grants all of his 'hand' spells two charges, which cooldown independently), it'd show his hand on cooldown when it's not, and when he uses it the second time, the time displayed would only represent the cooldown of the second charge, and not the first one, which would be coming up earlier.</p><p>I suppose there're a few ways you might be able to do this, but it'd probably take multiple icons and a few conditionals, not sure it's possible in a single icon without some kind of advanced snippets/LUA that I'm not smart enough to put together.</p><p>Basically it'd work something like:</p><p>1) If both charges are up, the icon is shown with a 2 stack count.<br>2) If one charge is up, the icon is shown with the smaller cooldown sweep and a 1 stack count.<br>3) If no charges are up, the icon shows the cooldown of the first charge used and shows a 0 stack count.</p><p>Basically just like it'd be if it was your own spell that has multiple charges.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Freeebo\">Freeebo</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/900\">#900</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/900.html\">Raw</a>","closed":true,"closed_at":"2014-02-24T00:32:53Z","created_at":"2013-12-21T11:44:56Z","updated_at":"2014-02-24T00:32:53Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>Tracking others' cooldowns is already a spectacular guessing game. When you try to add ability charges in there, it becomes massively more complicated, not the least of which comes from having to change the configuration to allow input of max charges as well as duration. </p>\r\n<p>I'm not saying that this won't ever happen, but there are a lot of things that I would want to get implemented before this.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2013-12-21T23:20:46Z"}]}