{"issue":{"title":"[CF 911] somehow i lose all my settings ","body":" <p>cannot figure out what is happening but i will set my buttons for whatever spell .. ill play with them for weeks...working mind you then one day Ill log in and i will get the blank tmw bar,,,cant seem to figure out what is causing it.&nbsp; is there a way to save all your icons so that when this happens you can quickly restore them?</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/earlbless\">earlbless</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/911\">#911</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/911.html\">Raw</a>","closed":true,"closed_at":"2014-01-21T18:14:45Z","created_at":"2014-01-13T04:59:56Z","updated_at":"2014-01-21T18:16:36Z","labels":["defect","resolved"]},"comments":[{"body":" <p>Data loss is likely a result of WoW not exiting properly - either through a crash or premature termination of the game client before addon settings have saved or finished saving. Improperly shutting down WoW includes, but is not limited to, closing out with Alt+F4, terminating the process via task manager, or shutting down or restarting Windows (or OSX) when WoW is still running or has just been exited a few seconds ago. If all of your profiles are gone (or if any of them are gone) then this is probably what happened. If you do not have a backup of your settings, then you will have to start from scratch.</p>\r\n<p>Your TellMeWhen settings can be found in World of Warcraft/WTF/Account/ACCOUNTNAME/SavedVariables/TellMeWhen.lua. There may be a file in that location named TellMeWhen.lua.bak that contains an old version of your settings, but there is no guarantee on how old this file will be or if it will exist at all - its creation is not something that AddOn authors have any control over (for example, mine was last modified in 2012). If it is there, make a copy of it and rename that copy to TellMeWhen.lua, replacing the near-empty settings file you have currently and then start up WoW again (you must do this while WoW is closed).</p>\r\n<p>Apologies for the inconvenience caused by this, but this is just how WoW saves addon settings, and there are various factors that can cause this process to go awry.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-01-13T05:50:56Z"},{"body":" <p>ok that makes sense with Windows 8 I have been having these random freezes forcing me to do a hard restart of my PC.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/earlbless\">earlbless</a>","created_at":"2014-01-20T15:53:42Z"},{"body":" <p>I just added in a feature that will keep a backup of your settings in TellMeWhen_Option's SVs since it is very unlikely that both TMW's and Option's SVs will both become corrupted at the same time.</p>\r\n<p>This will be available in the next build.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-01-21T18:16:36Z"}]}