{"issue":{"title":"[CF 916] Issue with icons showing based on timers ","body":" <p>IMPORTANT: If your issue is only occurring with a specific icon, include an export string of the icon in this ticket. Subsequently, if the issue involves an entire group or an entire profile, include the entire export string of the group or profile.</p><p>To get an export string, open the icon editor, and click button labeled \"Import/Export/Backup\". Select the \"To string\" option for the appropriate export type (icon, group, or profile), and then press CTRL+C to copy it to your clipboard.</p><p>FAILURE TO COMPLY WITH THE ABOVE INSTRUCTIONS WILL RESULT IN YOUR TICKET BEING INVALIDATED.</p><p>What steps will reproduce the problem?</p><p>This is in response to <a href=\"http://www.curse.com/addons/wow/tellmewhen?comment=4357\" rel=\"nofollow\">http://www.curse.com/addons/wow/tellmewhen?comment=4357</a> where you suggested the configuration that worked for me perfectly in the beginning of December 2013 (or so it seemed), but is glitching now, after TMW updates (see below).</p><p>1. Export the string attached below. It's a group of 12 icons and a text layout.<br>2. Go to a Raider's Training Dummy and target it.<br>3. As you do 2, start a stopwatch and watch the timings.</p><p>What do you expect to happen?<br>1. I expect every /say to happen at equal intervals of 5 seconds each (except for the very first interval which is 4 seconds): '/say 1' right as I target the Dummy, '/say 2' 4 seconds later, '/say 3' 5 seconds later, '/say 4' 5 seconds later and so on.<br>2. I expect every icon to show a number on the screen (icon layout) along with each /say.</p><p>What happens instead?<br>1. '/say 1' happens right away. Then '/say 2' happens 9-10 seconds later. Then each /say happens at 5 second intervals, but '/say9' and '/say 10' happen simultaneously (/say 10 happens right after /say 9 at about 45 seconds on the stopwatch, the order is never broken though, 10 follows 9). Then nothing happens for 10 seconds, then '/say 11' happens at 55 seconds and '/say 12' at 60 seconds.<br>2. Only icons number 1 and 10 are showing on my screen. The rest are showing nothing.</p><p>I suspect that with a different set of timers different icons would be mistimed/not showing layout text on the screen. This is my test group, in my raid group I used different (longer) timers and I believe different icons were glitching. If try to reproduce on the same computer with the same timers, the same icons seem to be glitching.</p><p>I tried this test group on another computer and the results were slightly different:<br>'/say 1' happened right away after targeting the Dummy, icon text layout \"1\" was showing on the screen (as expected),<br>'/say 2' happened 4-5 seconds later, \"2\" was showing on the screen (as expected),<br>then there was a 10 seconds break, then '/say 3' happened around 15 seconds on the stopwatch, the icon text layout was not shown. The rest of the icons counted up at 5 second intervals without clumping together, none of the icons text layouts were shown on the screen.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>It shows as 6.2.6-263-g8904113 in my Curse Client and as v7.0.0 dev in my WoW UI.</p><p>Do you have an error log of what happened?<br>No.</p><p>Please provide any additional information below (including any export strings if applicable; see above.)<br>Uploading group export string in a file. Apologies for a big group, I didn't want to change too much in my test group compared to my raid group.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/nordveien\">nordveien</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/916\">#916</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/916.html\">Raw</a>","closed":true,"closed_at":"2014-02-05T05:30:19Z","created_at":"2014-01-17T13:01:46Z","updated_at":"2014-02-05T05:30:19Z","labels":["defect","resolved"]},"comments":[{"body":"<strong>Attachment Added:</strong><a href=\"https://media.forgecdn.net/attachments/76/116/TMW_916.txt\" target=\"_blank\"> TMW_916.txt</a><br> <div class=\"attachment-desc\"> <h4 class=\"attachment-title\">TMW_916.txt</h4> <p>&lt;p&gt;Export string&lt;/p&gt;</p> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/nordveien\">nordveien</a>","created_at":"2014-01-17T13:01:46Z"},{"body":" <p>Thanks for the report and the excellent test case you gave me. Sorry for taking so long to get to this - it should be fixed now. Without a test case like the one you gave me, this could have easily been one of the most frustrating bugs I have ever encountered.</p>\r\n<p>Basically what was happening is that all duration triggers were being broken after an icon was encountered that was already finished. The order in which icons are checked for duration triggers depends entirely on where they get placed into the hash table, and this ordering is <a href=\"https://en.wikipedia.org/wiki/Undefined_behavior\" rel=\"nofollow\">undefined</a> from session to session because icons get assigned different memory addresses each time they are created when you reload your UI, which is why the behavior was so weird.</p>\r\n<p>Fixed in g9f28ed6.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-02-04T01:21:33Z"},{"body":" <p>OMG I love you Cybeloras <span>&lt;3</span> Thank you!</p>\r\n<p>The group is working for me now (tested in raid as well). Thank you for the kind words, I'm happy my test example was helpful. But really it was all Blizzard (who designed a fight that would inspire a set of timers like that) and you who helped me set the whole thing up in the first place <span>:)</span></p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"02 4 2014 23:11:52 (CST) (UTC-6:00)\" data-epoch=\"1391577112\">Feb 4, 2014</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/nordveien\">nordveien</a>","created_at":"2014-02-05T04:42:38Z"}]}