{"issue":{"title":"[CF 925] AddOn Will Not Load in Character Screen ","body":" <p>IMPORTANT: If your issue is only occurring with a specific icon, include an export string of the icon in this ticket. Subsequently, if the issue involves an entire group or an entire profile, include the entire export string of the group or profile.</p><p>To get an export string, open the icon editor, and click button labeled \"Import/Export/Backup\". Select the \"To string\" option for the appropriate export type (icon, group, or profile), and then press CTRL+C to copy it to your clipboard.</p><p>FAILURE TO COMPLY WITH THE ABOVE INSTRUCTIONS WILL RESULT IN YOUR TICKET BEING INVALIDATED.</p><p>What steps will reproduce the problem?<br>1. Logging into the character screen in WoW<br>2.<br>3.</p><p>What do you expect to happen? What happens instead?<br>I expect for the add on to be on the list of loaded add ons and it is not. Once I log into my character the add on also is not loaded.</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>I am using version 6.2.6</p><p>Do you have an error log of what happened?<br>No.</p><p>Please provide any additional information below (including any export strings if applicable; see above.)</p><p>I do run Mac OS X version 10.7.5 and this problem happens with some other add ons as well.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Colbearack\">Colbearack</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/925\">#925</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/925.html\">Raw</a>","closed":true,"closed_at":"2014-02-12T17:36:39Z","created_at":"2014-02-07T04:49:46Z","updated_at":"2014-02-12T17:36:39Z","labels":["defect","invalid"]},"comments":[{"body":" <p>This is not an issue with TellMeWhen. You can find a guide that shows you how to install addons here: <a href=\"http://www.curse.com/faqs/wow-addons\" rel=\"nofollow\">http://www.curse.com/faqs/wow-addons</a></p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-02-12T17:35:44Z"}]}