{"issue":{"title":"[CF 928] debuff tracking &amp; exception for non dispellable debuffs ","body":" <p>Hello, I'm new to this (posting here about issues &amp; ideas ans such), I hope that i am putting this in the right place as well. But i didn't see any other area for it.&nbsp; I absolutely love your tell me when addon,&nbsp; I have been using this addon for a couple of years now, and I just wanted to thank you for all of your hard work that you put into this great addon that can do just about anything that you can think of and want to do or track.</p><p>No one else seems to be able to help me or answer my question, so here goes.&nbsp; I have made an icon for a few classes, to track when your slowed or rooted. But for this one Let just use the paladin for an example. So we setup an icon for to track debuffs (on player) then set it for track slowed and rooted.&nbsp; I set this icon to look like the spell Emancipate, so that when I get slowed or rooted, I will notice it and be able to quickly free myself from them using the spell Emancipate. Only thing i noticed when doing this is when the debuff dazed that comes up. It can not be dispelled (it has the red around the spell icon frame indicating so). So dazed would be something I would like for it not to track and omit it from the rest of the slowed group. So finally here is my question, is there anyway to track slowed and remove a spefic spell from being tracked along with the rest.</p><p>But here is the bigger and more important part my question, Is there anyway to track debuffs like slowed or magic and be able setup a condition&nbsp; to ignore debuffs that can not be dispelled? Is there anyway to do this as of yet? Because i have not able able to successfully track this and have it ignore the dazed debuff that can not be dispelled.</p><p>I am using release version - 6.2.6</p><p> Here is the code for the Icon for emancipate tracking that i have setup - ^1^T^SBuffOrDebuff^SHARMFUL ^SType^Sbuff ^SAlpha^N0.9 ^SName^SSlowed;~`Rooted ^SConditions^T ^N1^T ^SType^SDEBUFFDUR ^SOperator^S&lt;= ^SName^SDazed ^SLevel^N5 ^t^Sn^N1 ^t^SEvents^T ^N1^T ^SType^SAnimations ^SAnimation^SACTVTNGLOW ^SEvent^SOnShow ^SInfinite^B ^t^Sn^N1 ^t^SCustomTex^S121783 ^SEnabled^B ^SFakeHidden^B ^t^N62602^S~`~| ^Sicon^^</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Zorknap\">Zorknap</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/928\">#928</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/928.html\">Raw</a>","closed":true,"closed_at":"2014-02-20T02:08:18Z","created_at":"2014-02-18T04:10:31Z","updated_at":"2014-02-20T02:08:18Z","labels":["defect","resolved"]},"comments":[{"body":" <p>Being able to omit a few spells from an equivalency is something that I have thought about before, but I was never sure if there was any demand for it. I see now that there is, so I will look into implementing it somehow.</p>\r\n<p>For your last paragraph: There is no flag provided by the Blizzard API to check if something is dispellable or not, so I can't really do that. For tracking \"Magic\" as a dispel type, there is no good way that I would be able to add configuration to omit certain spells. For tracking \"Slowed\" as a TMW equivalency, I could add in some syntax like \"Slowed; -Dazed\" that would remove dazed (or whatever you want that is prefixed with a \"-\") from the compiled list.</p>\r\n<p>This shouldn't be too terribly difficult to implement, so there is a good chance that I will get to this in the next couple of days.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-02-18T05:12:06Z"},{"body":" <p>Adding in the capability to omit (like: slowed; -dazed) would be a great help, Thank you so much! I think I would speak for alot people out there, and say that we really do appreciate all your hard work that you put into this amazing addon.\r\nThank you from all us that use this great addon! Keep up all of the outstanding work that you do!! =D</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"02 19 2014 12:00:48 (CST) (UTC-6:00)\" data-epoch=\"1392832848\">Feb 19, 2014</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Zorknap\">Zorknap</a>","created_at":"2014-02-19T17:47:34Z"},{"body":" <p>Done in gc5b6cc60.</p>\r\n<p><a href=\"http://wow.curseforge.com/addons/tellmewhen/files/\" rel=\"nofollow\">http://wow.curseforge.com/addons/tellmewhen/files/</a></p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-02-20T02:08:02Z"}]}