{"issue":{"title":"[CF 943] Track the percent dmg of a usable dot in relation to the existing dot ","body":" <p>Hello first of all and sorry for my english,it´s not my native language and i hope that you can understand what i wanna ask you.<br>I´m usin TMW version 6.2.6.<br>What i want to ask is :</p><p>Is it possible to make an icon in TMW with the condition \"Show the Icon only if the dot that I can use is x% stronger than the existing dot on the target\"?Whereby x is a custom variable set by the player.<br>As a basis I thought at factors, like 1.15 or 0.95...</p><p>The keynote behind this is to help the player, to show when you have a strong trinket proc or buff or something else, so that you know when to set/refresh your dots efficiently which is important for dot dmg based characters like feral,affl. warlock... .</p><p>And here is the problem for which I dont find a solution</p><p>For this,TMW has to track the strenght of any bleed you apply, taking into account attack/spell power, crit chance, mastery, and other multipliers.<br>So it has to take a snapshot of the dot/bleed you could cast (based on your current stats) and that of the dot/bleed that is already on your current target.(This means that it has to remember dot/bleed strength on the target.)<br>So for example, if i set the factor to 1.15 then the icon only shows up if the dot/bleed you could apply is 115% stronger than the one that´s already up.<br>For a factor like 0.95,the icon only appears if the new dot/bleed would be 5% weaker.</p><p>Is it possible to find a solution, probably with the LUA-code, for this?</p><p>I think that this would be a good improvement and would be a help for many players,me included.</p><p>Sincere regards,</p><p>Jack</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Jacksonvye\">Jacksonvye</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/943\">#943</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/943.html\">Raw</a>","closed":true,"closed_at":"2014-04-17T23:32:34Z","created_at":"2014-04-17T19:43:17Z","updated_at":"2014-04-17T23:32:34Z","labels":["enhancement","declined"]},"comments":[{"body":" <p>No, this isn't natively possible, and I have no plans on ever implementing something like this because this functionality of DoTs is bring removed in Warlords of Draenor.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-04-17T23:32:15Z"}]}