{"issue":{"title":"[CF 949] TMW spiking on CPU / MEM use on Warlock mainly ","body":" <p>Allright so i have the weirdest problem ever</p><p>\"Hey Cybeloras, i have sort of a super odd issue that i simply cannot figure out why.</p><p>I've had a long period of issues with small spikes (0,5 sec freeze) and i disregarded it as hardware issue. But after long time investigation and now testing it down to 100% the fact of TMW \"spiking\" my memory and CPU usage, jumping from a stable 4 use to 150+ with all TMW icons on. I then tried to fix it by disabling all TMW icons, and i still get a small spike 3-4 turns into 10 with 0 active ones. I tried to reinstall and i dont know what. Here is the catch. These things does NOT happen on my fully loaded TMW characters beside my WARLOCK. Both my warlocks have this issue together with TMW, but neither of the other classes has the issue.</p><p>I cannot for the love of god figure out why as soon as i add more and more icons it spikes higher and higher but there is constantly a spike with TMW + my Warlock. Im only testing this with TMW, so there is no other addon enabled.</p><p>I simply has to move away from TMW if this issue persist or i cant figure out how to fix it. It's been nagging the shit out of me where these spikes came from and didn't think it was from TMW.</p><p>Screenshot of earlier tests with other addons enabled - <a href=\"http://i.imgur.com/HvgheWP.png\" rel=\"nofollow\">http://i.imgur.com/HvgheWP.png</a> showing how it spikes 100 randomly. Mage, rogue, druid with decent amount of TMW icons no issue. Tried disabling 1 by 1 on the bars, but the spike keeps happening with 0-to all bars enabled, deleted or anything (just determines how big the spike becomes)\"</p><p>from the post i made</p><p>What steps will reproduce the problem?<br>1. Problems occour just running around, the CPU usage spikes to 10-180 (depending on how many icons you have active, 4-10 with 0 icons active)<br>2. Only happens on my Warlocks mainly<br>3. It's not related to turning TMW settings on and off, or the normal spikes that can happen in TMW<br>4. It happens frequently while running around, it just gives these small freezes because of the high CPU use to all of wow.</p><p>What do you expect to happen? What happens instead?</p><p>I tried everything, fresh install, no icons at all importing string again (making a new wow with WTF, cache, interface reset -&gt; Fresh TMW) still spikes from 4 CPU use to 10 out of nowhere with 0 icons)</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)</p><p>6.2.6 (tried newest alpha too)</p><p>Do you have an error log of what happened?</p><p>No</p><p>Please provide any additional information below (including any export strings if applicable; see above.)</p><p>Screenshot above showcases how the spike looks when it happens. The normal i get is 180 with my warlocks TMW string<br><a href=\"\" rel=\"nofollow\">http://sparkuggz.com/ui/&amp;nbsp;</a> can be found at the bottom</p><p>Also, remember i tried this with ONLY TMW enabled, meaning no conflicting addons despite the picture showing it.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Sparkuggz\">Sparkuggz</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/949\">#949</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/949.html\">Raw</a>","closed":true,"closed_at":"2014-05-11T03:25:28Z","created_at":"2014-04-30T01:17:32Z","updated_at":"2014-05-11T03:25:28Z","labels":["defect","resolved"]},"comments":[{"body":"<strong>Attachment Added:</strong><a href=\"https://media.forgecdn.net/attachments/76/61/SavedVariables.rar\" target=\"_blank\"> SavedVariables.rar</a><br> <div class=\"attachment-desc\"> <h4 class=\"attachment-title\">SavedVariables.rar</h4> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Sparkuggz\">Sparkuggz</a>","created_at":"2014-04-30T01:17:32Z"},{"body":" <p>Thanks for creating this ticket. A few questions:</p>\r\n<p>- When you say that the problem happens when you are running around, do you mean that this is the only time that it happens?<br>\r\n- I.E it doesn't happen while standing still?<br>\r\n- Does it happen inside raids/instances, or does it only happen out in the world?<br>\r\n- Does it only happen when you move between zones (e.g. leave Orgrimmar/Stormwind and go into Durotar/Elwynn, and vice-versa)? Or does it happen while running around in a city?</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-04-30T01:41:42Z"},{"body":" <p>- Happens running around in Shrine/Orgrimmar, all the time. No zoning, just running up an down a pair of stairs or side to side. It didn't feel like it happend if i was tabbed out of the game. </p>\r\n<p>- As mentioned above, does happen outside world thats when i started to notice something is wrong. </p>\r\n<p>- Running around in a city :/</p>\r\n<p>It's the weirdest issue i ever encountered with an addon. How it can spike on warlock ,but nothing else.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Sparkuggz\">Sparkuggz</a>","created_at":"2014-04-30T09:06:55Z"},{"body":" <p>I made a video showcasing how it spikes from 3-4 to 10 out of nowhere frequently on my 2 warlocks and then never does it on my druid / mage</p>\r\n<p><a href=\"http://youtu.be/5iEyJAXVY2o\" rel=\"nofollow\">http://youtu.be/5iEyJAXVY2o</a></p>\r\n<p>Mind you, the spike becomes 4 to 180 with all my TMW's enabled. Just having 1-2 bars is 4 to 40-50, so it's obviously not any noticeable lag from 4 to 10, but it increases if i start using TMW</p>\r\n<p>I tried to just add, disable, and adjust all the bars, still lags regardless. The more enabled the worse it gets.</p>\r\n<p>I'm clueless</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Sparkuggz\">Sparkuggz</a>","created_at":"2014-04-30T09:27:37Z"},{"body":" <p>Does it happen on a new level 1 warlock?</p>\r\n<p>Here's some more things you can do to help debug this. Paste this command into chat and hit enter:</p>\r\n<p>/run TMW.ScheduleUpdate = function(...) print(debugstack(), ...) TMW:Update() end</p>\r\n<p>Then, show me what gets printed to your chat (if anything) when the lag spike happens. You will need to either remove your chat mask or transcribe what gets printed manually.</p>\r\n<p>Also, switch your Interface Usage addon to \"Frame OnUpdate Usage\" (sort by totalTime) and show me that that looks like as you run around with your full profile enabled (and what it looks like when you get the spike, of course) in a video.</p>\r\n<p>If you can get it setup so that it causes a noticeable framerate hit when it happens, or if the command I gave you above causes anything to be printed to chat, then also show me a video of what \"Event Calls\" in Interface Usage looks like as it happens.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"04 30 2014 15:41:43 (CST) (UTC-5:00)\" data-epoch=\"1398890503\">Apr 30, 2014</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-04-30T20:04:36Z"},{"body":" <p>1 ) It doesn't spike with all TMW imported on lvl 1 char, odd.</p>\r\n<p>2 ) I pasted the command, here is the reply\r\n<a href=\"http://i.imgur.com/uHOUVSh.png\" rel=\"nofollow\">http://i.imgur.com/uHOUVSh.png</a></p>\r\n<p>3 ) Event calls during spike - <a href=\"http://i.imgur.com/1kUDmCS.jpg\" rel=\"nofollow\">http://i.imgur.com/1kUDmCS.jpg</a>\r\npassive it just has 30-50 on combat_log_event and sometimes some chat msg, thats it</p>\r\n<p>4 ) Nothing special on Frame OnUpdate Usage even during spikes\r\n<a href=\"http://i.imgur.com/x69LrHJ.png\" rel=\"nofollow\">http://i.imgur.com/x69LrHJ.png</a> looks like that the whole time boucning around those 0,1 numbers</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Sparkuggz\">Sparkuggz</a>","created_at":"2014-04-30T21:17:11Z"},{"body":" <p>Ok, thanks for all your help. Problem found.</p>\r\n<p>For some reason, Blizzard is firing PLAYER_TALENT_UPDATE for no reason when no talents are being updated. This is causing TMW to run a full update (the same action performed when you lock/unlock TMW), which is fully intended in order to respond to actual changes to talents. It isn't supposed to happen while you are just walking around, though. That's also why I asked about a level 1 warlock.</p>\r\n<p>As expected, TMW's main OnUpdate script won't spike in response to this, but the event view shows that it is firing a crapton (technical term) of times, and the stacktrace confirms my suspicion about what was causing it.</p>\r\n<p>When I get some time, I'll clone your spec on my warlock and see if I can't narrow down why PLAYER_TALENT_UPDATE is getting fired randomly, and then I'll try to see what I can do to implement a workaround. Worst case fix is manually checking to see if any talents actually changed before acting on any PLAYER_TALENT_UPDATE fires.</p>\r\n<p>Thanks for your help!</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-04-30T22:15:41Z"},{"body":" <p>Latest versions intial test has indeed fixed the issue. Thank you Cybeloras, appreciate it mate</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Sparkuggz\">Sparkuggz</a>","created_at":"2014-05-02T15:34:36Z"}]}