{"issue":{"title":"[CF 969] single square bracket [ is not auto-corrected to [\"[\"] ","body":" <p>What steps will reproduce the problem?</p><p>tried to create a custom text label for an icon that will show just the open square bracket character on the second line<br>(to remind me what keyboard button is assigned for that function)</p><p>What do you expect to happen? What happens instead?<br>expected output: the [ chraracter appears on the icon. I get \"syntax error\" instead.</p><p>i tried:<br>\"[\" - got error<br>\\[ - got error<br>\"\\[\" - got error<br>'[' - got error<br>'\\[' - got error</p><p>What version of TellMeWhen are you using? (\"The latest\" is not a version)<br>v7.0.2</p><p>Do you have an error log of what happened?<br>not applicable</p><p>Please provide any additional information below:</p><p>after poking around i discovered that the interface auto-corrects ] to [\"]\"] and i figured that the correct syntax for what i want is [\"[\"]...however this is not auto-corrected by the configurator when pressing the Okay button and \"syntax error\" appears instead of the single bracket.<br>Is this the intended behaviour?</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Adrian_G2\">Adrian_G2</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/969\">#969</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/969.html\">Raw</a>","closed":true,"closed_at":"2014-07-19T01:40:04Z","created_at":"2014-07-15T21:08:28Z","updated_at":"2014-07-19T01:40:04Z","labels":["defect","resolved"]},"comments":[{"body":" <p>A closing bracket will autocorrect because it is easy to determine that an opening bracket was never paired with it, and it can also be assumed that someone would never type a lone closing bracket without meaning anything else. A closing bracket only has special meaning when it is paired with an opening bracket.</p>\r\n<p>An opening bracket doesn't get autocorrected because it immediately gets interpreted as being the start of a tag sequence, and if there is nothing following that then it is indeed a syntax error.</p>\r\n<p>I will add in some code to manually correct a single opening bracket. Anything besides exactly that will not be autocorrected, though (since its DogTag's parser that corrects these things, not TMW).</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-07-19T01:28:40Z"}]}