{"issue":{"title":"[CF 983] Making Icons Check Specific Raid Frames ","body":" <p>What version of TellMeWhen are you using? (\"The latest\" is not a version)</p><p>7.0.2</p><p>Please provide any additional information below (including any export strings if applicable; see above.)</p><p>I want to make TellMeWhen icons able to check a specific raid frame, regardless of its raid ID. For example, I want to make TMW check the first raid frame for my rejuvenation with a standard buff/debuff tracker, no matter what that players raid unit ID may be. I use VuhDo for raid frames, so I can sort them by unit ID, and then it should work by having the first rejuvenation icon check raid 1, the second check raid 2, etc. However, I like to sort them by tank &gt; healer &gt; DPS, which means my icon for raid 1 would be on the first VuhDo raid frame, but it would still be checking raid 1, who could be anywhere. I assume this is possible via Lua, and I'm trying to learn Lua, but sadly I don't have the faintest idea how to make this work.</p><p>Anyone reading this may be confused as to why I want to do this, since VuhDo can already show rejuvenation on frames. As great as VuhDo is, it doesn't have even a fraction of the customization that TMW offers in icons. With TMW I can control precisely when, where, and how information shows up on the raid frames. I can add conditions, notifications, and there are tons of interesting applications with DogTags text customization. Then there's just the fact that TMW is more responsive and easier on my computer's CPU.</p><p>Anyway, I'm not exactly sure what this ticket is, so I'm really sorry if this doesn't belong here or is formatted wrong. I'm not sure if this is a question of how to do something or a suggestion of a feature to be implemented. Either way, thanks for making and maintaining this awesome addon! In my opinion it is, by far, the best WoW addon ever created.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Pip646\">Pip646</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/983\">#983</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/983.html\">Raw</a>","closed":true,"closed_at":"2014-08-18T19:55:55Z","created_at":"2014-08-13T18:08:07Z","updated_at":"2014-08-18T19:55:55Z","labels":["enhancement","resolved"]},"comments":[{"body":" <p>Some screenshots of what you are wanting to do here would help me to figure out how to help you.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-08-17T05:02:59Z"},{"body":" <p>Sorry I didn't explain that very well.</p>\r\n<p><a href=\"http://i.imgur.com/uQW7Ngw.jpg\" rel=\"nofollow\">Basic Vuhdo Setup</a></p>\r\n<p>If you look at the VuhDo frame, right next to my player frame in the lower center area of my screen, you can see how it shows buffs on that target. In this case, prayer of mending, renew, and power word: shield. Those are put there by VuhDo, but TMW has spoiled me with the amount of custimazation it has and I want to have TMW do that instead, like <a href=\"http://i.imgur.com/TqpUAnn.jpg\" rel=\"nofollow\">this</a>.</p>\r\n<p>I have buff/debuff trackers on my TMW frame to check those same abilities. This frame is anchored to the VuhDo frame, but I need to make sure it's checking the correct player's buffs.</p>\r\n<p>I can have VuhDo create some <a href=\"http://i.imgur.com/PppHljr.jpg\" rel=\"nofollow\">testing frames</a> like these to pretend I'm in a raid group, then I can copy that TMW group to each one, like <a href=\"http://i.imgur.com/ZXvrcua.jpg\" rel=\"nofollow\">this</a>. If I had VuhDo sorted by unitID, the warrior tank in the top right side of VuhDo would be raid1 and the healer monk on the bottom right would be raid10. I could have the first TMW group checking raid1's buffs, the second checking raid2, etc. Each group should be showing for the correct person. However, if I actually sort my VuhDo frames by criteria other than the unitID, such as tanks &gt; healers &gt; DPS, raid1 could be anywhere, but TMW wouldn't know. Raid1's information would still show up in the first TMW group, rather than wherever he had been moved to.</p>\r\n<p>I like having tanks show up at the top, so they are easier to keep track of, so I want to see if it's possible to make TMW check the frame it's over, rather than a specific unitID. If not, I'll just make VuhDo sort them by unitID so I can still use TMW to display things.</p>\r\n<p>I hope this was clearer, and thanks again.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Pip646\">Pip646</a>","created_at":"2014-08-17T16:41:23Z"},{"body":" <p>Import this code snippet: </p>\r\n<p><code>^1^T^SName^SVuhDo~`Unit~`Updater ^SCode^S--~`To~`use~`this~`script:~J --~`Name~`a~`group~`with~`a~`name~`that~`begins~`with~`\"VuhDo\"~`(no~`quotes,~`case~`insensitive)~J --~`Anchor~`that~`group~`to~`a~`VuhDo~`frame~J --~`That~`group's~`icons~`will~`automatically~`be~`updated~`to~`that~`frame's~`unit.~J ~J CreateFrame(\"Frame\"):SetScript(\"OnUpdate\",~`~J ~`~`~`~`function()~J ~`~`~`~`~`~`~`~`for~`group,~`domain,~`groupID~`in~`TMW:InGroups()~`do~J ~`~`~`~`~`~`~`~`~`~`~`~`if~`group.Name:lower():match(\"~}vuhdo\")~`then~J ~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`local~`anchor~`=~`_G[group.Point.relativeTo]~J ~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`if~`anchor~`and~`anchor:GetName():sub(1,~`2)~`==~`\"Vd\"~`and~`anchor.raidid~`then~J ~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`local~`updated~`=~`false~J ~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`for~`ics~`in~`TMW:InIconSettings(domain,~`groupID)~`do~J ~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`if~`ics.Unit~`~|=~`anchor.raidid~`then~J ~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`ics.Unit~`=~`anchor.raidid~`~J ~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`updated~`=~`true~J ~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`end~J ~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`end~`~J ~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`if~`updated~`then~J ~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`group:Setup()~J ~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`end~J ~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`~`end~J ~`~`~`~`~`~`~`~`~`~`~`~`end~`~J ~`~`~`~`~`~`~`~`end~J end)~J ~J ~J ^t^N71033^S~`~| ^Scodesnippet^^</code></p>\r\n<p>Then,</p>\r\n<ul><li>Manually run the snippet, or reload your UI to have it automatically run.\r\n</li><li>Name a group with a name that begins with \"VuhDo\" (no quotes, case insensitive)\r\n</li><li>Anchor that group to a VuhDo frame (right-click-and-drag the group to a vuhdo frame and choose the \"anchor to\" option from the dropdown menu that appears.)\r\n</li><li>That group's icons will automatically be updated to that frame's unit.</li></ul> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"08 17 2014 14:38:22 (CST) (UTC-5:00)\" data-epoch=\"1408304302\">Aug 17, 2014</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-08-17T19:37:14Z"},{"body":" <p>You are seriously awesome. That is exactly what I wanted and it works perfectly. Thank you very much for taking the time to do this!</p>\r\n<p>EDIT: Quick question. With this method of displaying information I'll be making a total of 25 (30 in WoD) of these TMW groups. Does the total number of groups have much of an impact on CPU performance? So far I have found TMW to be extremely easy on my computer, but I'd like to make numerous groups for every single VuhDo frames to show things in different sizes. For example, if I had 4 groups per raid frame, each checking 1 icon for 100 total, would that be any different than 1 group per raid frame, checking 4 icons for 100 total in terms of CPU usage?</p>\r\n<p>I'm not too worried about this, since I already have so many TMW icons and it hasn't had a noticeable impact, but I'm just curious if there's a difference between the two methods.</p>\r\n<p>Thanks again.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"08 17 2014 17:21:07 (CST) (UTC-5:00)\" data-epoch=\"1408314067\">Aug 17, 2014</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Pip646\">Pip646</a>","created_at":"2014-08-17T22:02:38Z"},{"body":" <p>It would use slightly more RAM to do it with more groups, but even that is totally negligible. CPU-wise, there is no real impact at all.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-08-17T23:14:40Z"}]}