{"issue":{"title":"[CF 998] Icon Shown Time in DogTags ","body":" <p>What version of TellMeWhen are you using? - Version 7.0.2</p><p>Hi, I have another rather unusual request/question. To put it as simply as possible, I want to be able to see the data for the Icon Shown Time or Icon Hidden Time conditions in DogTags.</p><p>The basic idea of what I'm trying to create is text that tracks \"inactive\" time in realtime. I spend a lot of time teaching people how to improve as players, and a huge part of that is teaching them to minimize downtime between abilities. They often don't understand that a tenth of a second wasted on each GCD can end up being huge amounts of time over the duration of a boss fight. Having a TMW tracker that counted this lost time would be an excellent teaching tool that could benefit a lot of players, including myself. Much easier than doing the math on warcraftlogs.</p><p>As far as I can tell, there are a few ways this can be made. My main idea was to create a condition icon that checks player in combat = true and player casting = false and GCD active = false, like this one.</p><p>^1^T^SType^Sconditionicon ^SSettingsPerView^T ^Sicon^T ^STextLayout^Sicon1 ^STexts^T ^N1^S ^N2^S ^t^t^t^SCustomTex^S1 ^SFakeHidden^B ^SConditions^T ^N1^T ^SType^SCOMBAT ^t^N2^T ^SType^SGCD ^SLevel^N1 ^t^N3^T ^SType^SCASTING ^SLevel^N2 ^t^Sn^N3 ^t^SEnabled^B ^t^N70206^S~`~| ^Sicon^^</p><p>I could have a seperate icon counting how long the condition icon was shown and then displaying that information in text. So, for example, if I casted a spell and then waited for .3 seconds before beginning a second spell, the text displayed on the second icon would count up to 0.3. Then if I waited for .6 seconds after the second cast finished to begin my third cast, the timer would count up to 0.9. If I just sat there for 5 seconds before casting agian, it'd count up to 5.9, etc etc.</p><p>I would want it to reset the timer upon leaving combat, but I believe that would be fairly easy to do through DogTags with something along the lines of</p><p>[if ~InCombat then<br>&nbsp; &nbsp; 0<br>end]</p><p>I think all I really need to make this work is a plain stopwatch tag in DogTags. For example, DogTags has [AFKDuration] or [DeadDuration]. I just need the [Duration] part combined with [IsShown] or something. Sadly, I'm still pretty clueless when it comes to Lua.</p><p>I tried to make this using a counter in notifications, like this,</p><p>^1^T^SType^Sconditionicon ^SConditions^T ^N1^T ^SType^SCOMBAT ^t^Sn^N1 ^t^SEvents^T ^N1^T ^SType^SCounter ^SCounterAmt^N0 ^SCounter^Sinactive ^SCounterOperation^S= ^SEvent^SWCSP ^SOnConditionConditions^T ^N1^T ^SType^SCOMBAT ^SLevel^N1 ^t^Sn^N1 ^t^t^N2^T ^SType^SCounter ^SCounter^Sinactive ^SEvent^SWCSP ^SOnConditionConditions^T ^N1^T ^SType^SGCD ^SLevel^N1 ^t^N2^T ^SType^SCASTING ^SLevel^N2 ^t^Sn^N2 ^t^t^Sn^N2 ^t^SSettingsPerView^T ^Sicon^T ^STextLayout^STMW:textlayout:1JvdPBuGRVOf ^STexts^T ^N1^S[Counter(\"inactive\")] ^N2^S[IsShown] ^t^t^t^SEnabled^B ^t^N70206^S~`~| ^Sicon^^</p><p>^1 ^T^N1^T ^SAnchors^T ^N1^T ^Sy^N-1 ^Sx^N1 ^t^t^SStringName^SStack~`Text ^SSize^N26 ^t^SName^SCenter~`Text ^SGUID^STMW:textlayout:1JvdPBuGRVOf ^t^N70206^S~`~| ^Stextlayout^STMW:textlayout:1JvdPBuGRVOf ^^</p><p>It didn't really work though. While the numbers did count up while not on a GCD or casting, it seems to be very inaccurate, since it isn't directly measuring time, like a stopwatch would.</p><p>Anyway, last time I made a ticket I didn't explain what I wanted clearly enough. I hope I didn't go overboard this time. As always, thanks for everything you do with this addon, it helps me so much.</p><p>EDIT: Oh, one other thing I forgot to mention. Having the ability to track total time in combat would also be extremely helpful to me.</p> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Pip646\">Pip646</a> | Imported from CurseForge issue <a href=\"https://wow.curseforge.com/projects/tellmewhen/issues/998\">#998</a> | <a href=\"https://github.com/tmw-issue-import/dump/blob/master/html/998.html\">Raw</a>","closed":true,"closed_at":"2014-11-11T03:34:45Z","created_at":"2014-09-16T18:27:38Z","updated_at":"2014-11-12T04:29:36Z","labels":["enhancement","resolved"]},"comments":[{"body":" <p>I think the best solution for this would be for me to add timer functionality to the Counter notification type (since it is pretty bare right now).</p>\r\n<p>You could choose between counter and timer, and for timers, there would be operations to start, stop (pause), and reset the timer.</p>\r\n<p>It might be a bit before I get around to this since it isn't a super essential thing. Sorry about taking so long to get to this ticket in the first place - every time I looked at it in the list I just got to thinking about how to do it and never actually came up with a plan until now.</p> <div class=\"project-issue-comment-body-modified\"> <hr> <span class=\"e-infoLabel\">Edited</span><span> <abbr class=\"tip standard-date standard-datetime\" title=\"10 15 2014 20:08:00 (CST) (UTC-5:00)\" data-epoch=\"1413421680\">Oct 15, 2014</abbr></span> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-10-16T01:07:33Z"},{"body":" <p>I have no clue if this is actually any use to you at all, I'm completely out of my depth with this, but I happened to see this while browsing Curse.</p>\r\n<p><a href=\"http://www.curse.com/addons/wow/accuratetime\" rel=\"nofollow\">AccurateTime</a></p>\r\n<p>If I understand it, this is a library for getting accurate timers, and the developer mentions it can be used in other addons. Again, I'm pretty clueless here, but since TMW uses a bunch of embedded libraries, I thought it might be worth mentioning.</p>\r\n<p>Thanks again for looking into adding this feature.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Pip646\">Pip646</a>","created_at":"2014-11-02T20:50:14Z"},{"body":" <p>That's overkill for this purpose. </p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-11-02T21:18:19Z"},{"body":" <p>Done in g5bbdf05 (as a brand new notification handler - it isn't merged with the counter handler).</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Cybeloras\">Cybeloras</a>","created_at":"2014-11-10T04:35:25Z"},{"body":" <p>Thank you very much, you're the best.</p> <div class=\"project-issue-comment-body-modified\"> </div> \n<br>\n\n> Posted by CurseForge user <a href=\"https://wow.curseforge.com/members/Pip646\">Pip646</a>","created_at":"2014-11-12T04:29:36Z"}]}